In [237]:
import pandas as pd
import numpy as np
from fuzzywuzzy import process
from IPython.display import display, HTML

In [2]:
path1 = 'Correct_cities.csv'
path2 = 'Misspelt_cities.csv'
df_correct = pd.read_csv(path1)
df_incorrect = pd.read_csv(path2)

In [3]:
print(df_correct.dtypes)
print(df_incorrect.dtypes)

name       object
country    object
id          int64
dtype: object
misspelt_name    object
country          object
dtype: object

In [4]:
df_correct.head(2)

               name  country       id
0      les Escaldes  Andorra  3040051
1  Andorra la Vella  Andorra  3041563

In [5]:
df_incorrect.head(2)

    misspelt_name  country
0  Hfjdúszoposzló  Hungary
1        Otrajnyy   Russia

In [12]:
print(f'Count of records in correct cities - {df_correct.shape[0]}')
print(f'Count of unique countires in correct cities - {df_correct.country.nunique()}')
print(f'Count of unique cities in correct cities - {df_correct.name.nunique()}')
print(f'Count of unique id in correct cities - {df_correct.id.nunique()}')

print(f'\nCount of records in incorrect cities - {df_incorrect.shape[0]}')
print(f'Count of unique countires in incorrect cities - {df_incorrect.country.nunique()}')
print(f'Count of unique misspelt cities in incorrect countries - {df_incorrect.misspelt_name.nunique()}')

Count of records in correct cities - 23018
Count of unique countires in correct cities - 244
Count of unique cities in correct cities - 21940
Count of unique id in correct cities - 23018

Count of records in incorrect cities - 23018
Count of unique countires in incorrect cities - 244
Count of unique misspelt cities in incorrect countries - 22951

In [7]:
#Check is there exist any country in df_incorrect that is not present in correct cities dataframe
df_incorrect[~df_incorrect['country'].isin(df_correct['country'])]

Empty DataFrame
Columns: [misspelt_name, country]
Index: []

In [8]:
#Check cities with same name belonging to different countries
df_correct_count = df_correct.groupby('name')['id'].count().reset_index().rename(columns={'id':'count_id'})
df_same_city_name = df_correct[df_correct['name'].isin(df_correct_count[df_correct_count['count_id']>1]['name'])].sort_values(by='name')
df_same_city_name.head()

           name         country       id
18731    Abadan    Turkmenistan   162099
11473    Abadan            Iran   145459
21584  Aberdeen   United States  5225857
7736   Aberdeen  United Kingdom  2657832
22274  Aberdeen   United States  5785243

In [119]:
def levenshtein(seq1, seq2):
    seq1 = seq1.lower()
    seq2 = seq2.lower()
    size_x = len(seq1) + 1
    size_y = len(seq2) + 1
    matrix = np.zeros ((size_x, size_y))
    for x in range(size_x):
        matrix [x, 0] = x
    for y in range(size_y):
        matrix [0, y] = y

    for x in range(1, size_x):
        for y in range(1, size_y):
            if seq1[x-1] == seq2[y-1]:
                matrix [x,y] = min(
                    matrix[x-1, y] + 1,
                    matrix[x-1, y-1],
                    matrix[x, y-1] + 1
                )
            else:
                matrix [x,y] = min(
                    matrix[x-1,y] + 1,
                    matrix[x-1,y-1] + 1,
                    matrix[x,y-1] + 1
                )
    return (matrix[size_x - 1, size_y - 1])

In [169]:
# df_backup = df_correct.copy()

In [268]:
def calculate_score(incorrect_city_name, country):
    score_dict = {}
    df2_list = []
    df_check = df_correct[(df_correct['country']==country) & \
                          (df_correct['name'].str.len()==len(incorrect_city_name)) & \
                          (df_correct['selected']==False)]
    
    for correct_city in df_check.name.tolist():
        score = levenshtein(correct_city, incorrect_city_name)
        score_dict['score'] = score
        score_dict['correct_city'] = correct_city
        score_dict['incorrect_city'] = incorrect_city_name
        score_dict['country'] = country
        df2_list.append({'score': score, 'correct_city': correct_city, 'incorrect_city_name': incorrect_city_name, 'country':country})
    df_final = pd.DataFrame(df2_list).drop_duplicates()
    df_min_score = df_final[df_final['score']==df_final.score.min()]
    df_final = df_min_score.copy()
    if(df_min_score.shape[0]>1):
        df_min_score['ratio'] = df_min_score.apply(lambda x: get_jaro_distance(x['correct_city'],x['incorrect_city_name']), axis=1)
        df_final = df_min_score[df_min_score['ratio']==df_min_score['ratio'].max()]
        if (df_final.shape[0]>1):
            df_final = df_final.head(1)
    df_correct.loc[(df_correct['name']==df_final.iloc[0]['correct_city']) & (df_correct['country']==country),'selected']=True
    df_res = df_final.merge(df_correct, how='inner', left_on=['correct_city','country'], right_on=['name','country'])
    display(df_res[['incorrect_city_name','correct_city','country','id']])

In [ ]:
df_test = df_incorrect.copy()
df_correct['selected'] = False
ss = df_test.apply(lambda x: calculate_score(x['misspelt_name'], x['country']), axis=1)

  incorrect_city_name    correct_city  country      id
0      Hfjdúszoposzló  Hajdúszoboszló  Hungary  720276

  incorrect_city_name correct_city country      id
0            Otrajnyy     Otradnyy  Russia  513883

  incorrect_city_name correct_city country       id
0          ian Isidre   San Isidro    Peru  3929631

  incorrect_city_name   correct_city  country       id
0       Bordj Zemoufa  Bordj Zemoura  Algeria  2503620

  incorrect_city_name correct_city        country       id
0         ChulamViwta  Chula Vista  United States  5336899

  incorrect_city_name  correct_city      country       id
0        PalqyanlCity  Palayan City  Philippines  1696165

  incorrect_city_name correct_city   country       id
0         Kaset wioai  Kaset Wisai  Thailand  1610185

  incorrect_city_name correct_city country       id
0          Baipe Citx   Baise City   China  1816269

  incorrect_city_name correct_city        country       id
0            Hiqhland     Highland  United States  4921402
1            Hiqhland     Highland  United States  5356868
2            Hiqhland     Highland  United States  5775863

  incorrect_city_name        correct_city country       id
0  hgggio nell'lmilia  Reggio nell'Emilia   Italy  3169522

  incorrect_city_name correct_city  country       id
0               xitte        Mitte  Germany  6545310

  incorrect_city_name   correct_city country       id
0       Lamjhia Terme  Lamezia Terme   Italy  6534232

  incorrect_city_name correct_city     country       id
0            Bbktemir     Bektemir  Uzbekistan  1514396

  incorrect_city_name correct_city    country       id
0           Quitflipi    Quitilipi  Argentina  3839490

  incorrect_city_name correct_city country       id
0              Beidaf       Beidao   China  1816751

  incorrect_city_name correct_city  country       id
0              Igbxho       Igboho  Nigeria  2338711

  incorrect_city_name correct_city country       id
0                Zibo         Zibo   China  1785286

  incorrect_city_name correct_city country       id
0           Shrīgoada    Shrīgonda   India  1256426

  incorrect_city_name correct_city         country       id
0          Coatbricgu   Coatbridge  United Kingdom  2652696

  incorrect_city_name   correct_city  country       id
0       Arcmxko-Ekiti  Aramoko-Ekiti  Nigeria  2349529

  incorrect_city_name correct_city country      id
0               Siasa        Siaya   Kenya  383388

  incorrect_city_name correct_city country       id
0             Dam Dah      Dam Dam   India  1272243

  incorrect_city_name correct_city  country       id
0          Nevuünster   Neumünster  Germany  2864475

  incorrect_city_name correct_city        country       id
0              jlythe       Blythe  United States  5329649

  incorrect_city_name correct_city  country       id
0           Rotsecaar    Rotselaar  Belgium  2787662

  incorrect_city_name correct_city      country       id
0             Zurphen      Zutphen  Netherlands  2743608

  incorrect_city_name correct_city country       id
0              Letehi       Leteri   India  1264949

  incorrect_city_name correct_city         country       id
0            Staqford     Stamford  United Kingdom  2637104

  incorrect_city_name correct_city country       id
0          tomalcalcn   Comalcalco  Mexico  3530385

  incorrect_city_name correct_city country       id
0              Zhuhat       Zhuhai   China  1790437

  incorrect_city_name correct_city country       id
0               Dnhui        Dehui   China  2037712

     incorrect_city_name           correct_city country       id
0  SaintaGermain-enhaayi  Saint-Germain-en-Laye  France  2979783

  incorrect_city_name correct_city country       id
0                 Ōme          Ōme   Japan  1854162

  incorrect_city_name   correct_city country      id
0       Kapiri Mpouii  Kapiri Mposhi  Zambia  913029

  incorrect_city_name correct_city    country       id
0                Baki         Baki  Indonesia  1650670

  incorrect_city_name correct_city        country       id
0           Rochnster    Rochester  United States  5043473
1           Rochnster    Rochester  United States  5091872
2           Rochnster    Rochester  United States  5134086

  incorrect_city_name correct_city country       id
0          Chodavarlz   Chodavaram   India  1274020

  incorrect_city_name correct_city  country       id
0            Arnjtadt     Arnstadt  Germany  2955439

  incorrect_city_name correct_city  country       id
0         Szombathaiy  Szombathely  Hungary  3044310

  incorrect_city_name correct_city country      id
0            cusurluk     Susurluk  Turkey  300058

  incorrect_city_name correct_city country       id
0             Jojmtla      Jojutla  Mexico  3526467

  incorrect_city_name correct_city country       id
0               Kxnan        Kōnan   Japan  1858836

  incorrect_city_name   correct_city        country       id
0       Boqle Heiuhts  Boyle Heights  United States  5330413

  incorrect_city_name correct_city                           country      id
0             aabinda      Kabinda  Democratic Republic of the Congo  215527

  incorrect_city_name correct_city   country       id
0           Chon Dfen    Chon Daen  Thailand  1611106

  incorrect_city_name correct_city    country       id
0               depok        Depok  Indonesia  1645518
1               depok        Depok  Indonesia  1645524

  incorrect_city_name correct_city country       id
0            Rājpīpia     Rājpīpla   India  1258819

     incorrect_city_name           correct_city country       id
0  San Mmtco Otzacatipjn  San Mateo Otzacatipan  Mexico  3827254

   incorrect_city_name         correct_city country       id
0  Saksomaggiore herse  Salsomaggiore Terme   Italy  3168627

  incorrect_city_name correct_city   country       id
0               jhāro        Ghāro  Pakistan  1178587

  incorrect_city_name correct_city  country      id
0              Reşvţa       Reşiţa  Romania  668954

  incorrect_city_name correct_city  country      id
0              zaardu       Maardu  Estonia  590447

  incorrect_city_name correct_city        country       id
0           Oak Grovo    Oak Grove  United States  5743731

  incorrect_city_name     correct_city      country       id
0     zitybol Isabela  City of Isabela  Philippines  1710519

  incorrect_city_name correct_city   country      id
0           Namanynre    Namanyere  Tanzania  151986

   incorrect_city_name         correct_city country       id
0  Konsbaitynów Łódxki  Konstantynów Łódzki  Poland  3095277

  incorrect_city_name      correct_city     country       id
0    Esch-hur-Alzpxte  Esch-sur-Alzette  Luxembourg  2960596

  incorrect_city_name correct_city country       id
0               luneo        Cuneo   Italy  3177700

  incorrect_city_name correct_city        country       id
0          Cazrolltzn   Carrollton  United States  4186416
1          Cazrolltzn   Carrollton  United States  4679195

  incorrect_city_name correct_city country       id
0             Ronchiz      Ronchin  France  2982944

  incorrect_city_name    correct_city    country       id
0      Puerto La drvz  Puerto La Cruz  Venezuela  3629672

  incorrect_city_name correct_city         country       id
0             tateley      Yateley  United Kingdom  6620293

  incorrect_city_name correct_city country       id
0             Baxgaon      Bangaon   India  1277322
1             Baxgaon      Bangaon   India  1277324

  incorrect_city_name correct_city  country       id
0             suanuni      Huanuni  Bolivia  3914839

  incorrect_city_name correct_city  country      id
0             Bolhrad      Bolhrad  Ukraine  711841

  incorrect_city_name correct_city         country       id
0         Čeyký Tršín  Český Těšín  Czech Republic  3077882

  incorrect_city_name correct_city  country       id
0            Burgforf     Burgdorf  Germany  2941405

  incorrect_city_name correct_city   country       id
0            BanePhai     Ban Phai  Thailand  1614455

  incorrect_city_name correct_city country       id
0           Tiruvalua    Tiruvalla   India  1254335

  incorrect_city_name correct_city      country       id
0             Veruelb      Veruela  Philippines  1680040

  incorrect_city_name correct_city country       id
0          Ermitagoña   Ermitagaña   Spain  8050880

  incorrect_city_name correct_city country       id
0             Jvypore      Jeypore   India  1269092

  incorrect_city_name correct_city country       id
0         xadanatalle  Madanapalle   India  1264621

  incorrect_city_name correct_city  country      id
0            Zimsicea     Zimnicea  Romania  662187

  incorrect_city_name correct_city    country       id
0             Jdkarta      Jakarta  Indonesia  1642911

  incorrect_city_name correct_city  country       id
0         veiligwnsee  Heiligensee  Germany  2907551

  incorrect_city_name correct_city country       id
0            Navzongo     Navrongo   Ghana  2297505

  incorrect_city_name correct_city country       id
0               Condd        Conde  Brazil  3385077
1               Condd        Conde  Brazil  3465713

  incorrect_city_name correct_city country      id
0            Chalkjda     Chalkída  Greece  260133

  incorrect_city_name    correct_city country      id
0      Novoulxyanovsm  Novoul’yanovsk  Russia  517766

  incorrect_city_name correct_city country       id
0              Luadda       Luanda  Angola  2240449

  incorrect_city_name correct_city country      id
0            Sungurlv     Sungurlu  Turkey  739236

  incorrect_city_name correct_city country      id
0          Kurganioek   Kurganinsk  Russia  538836

  incorrect_city_name correct_city  country      id
0              Oravea       Oradea  Romania  671768

  incorrect_city_name correct_city  country       id
0             Dklbeek      Dilbeek  Belgium  2799365

  incorrect_city_name correct_city        country       id
0              Groveo       Groves  United States  4695317

  incorrect_city_name correct_city country      id
0                 Ełk          Ełk  Poland  772621

  incorrect_city_name correct_city     country       id
0            Mirzāpua     Mirzāpur  Bangladesh  1185165

  incorrect_city_name correct_city country      id
0          Yasqokorsk   Yasnogorsk  Russia  468671

  incorrect_city_name       correct_city country       id
0   Vilkeyate-d’Ornon  Villenave-d’Ornon  France  2968620

  incorrect_city_name correct_city country      id
0               Hoiea        Hoima  Uganda  233312

  incorrect_city_name correct_city             country       id
0           Bayaguzna    Bayaguana  Dominican Republic  3511626

  incorrect_city_name correct_city                           country       id
0              Bolofo       Bolobo  Democratic Republic of the Congo  2316748

  incorrect_city_name correct_city country       id
0          Ncrāyanpzt   Nārāyanpet   India  1261823

  incorrect_city_name correct_city        country       id
0           Watertswn    Watertown  United States  4954611
1           Watertswn    Watertown  United States  5143396
2           Watertswn    Watertown  United States  5232741
3           Watertswn    Watertown  United States  5278005

  incorrect_city_name   correct_city        country       id
0       Bowwidg Green  Bowling Green  United States  4285268
1       Bowwidg Green  Bowling Green  United States  5147968

  incorrect_city_name     correct_city   country       id
0     Samut Skqgkgram  Samut Songkhram  Thailand  1606586

  incorrect_city_name correct_city        country       id
0          wovth Bend   South Bend  United States  4926563

  incorrect_city_name correct_city        country       id
0               Caqby        Canby  United States  5717758

  incorrect_city_name correct_city country       id
0            Deoālpur     Depālpur   India  1273181

          incorrect_city_name                correct_city country       id
0  Sen vrisxóbal de lqs Cmsas  San Cristóbal de las Casas  Mexico  3519537

  incorrect_city_name  correct_city country       id
0        xonstitmción  Constitución   Chile  3893726

  incorrect_city_name       correct_city  country       id
0   Thành Pnố yạaLong  Thành Phố Hạ Long  Vietnam  1580410

  incorrect_city_name correct_city  country       id
0             Pigdiga      Pindiga  Nigeria  2324857

  incorrect_city_name correct_city country       id
0              Sāsvat       Sāsvad   India  1257066

  incorrect_city_name correct_city country       id
0            Sainthin     Sainthia   India  1257751

  incorrect_city_name correct_city   country       id
0           Hydsrabad    Hyderabad  Pakistan  1176734

  incorrect_city_name  correct_city        country       id
0        qahumet City  Calumet City  United States  4886255

,incorrect_city_name,correct_city,country,id
0,Pvrqie Indnstrial Ciudad Mirrjn,Parque Industrial Ciudad Mitras,Mexico,8858109

  incorrect_city_name correct_city country       id
0         Sisjā Bāzāz  Siswā Bāzār   India  1255995

  incorrect_city_name correct_city country       id
0              nūrpur       Nūrpur   India  1261122

  incorrect_city_name correct_city  country       id
0                Doma         Doma  Nigeria  2344600

  incorrect_city_name correct_city  country       id
0              Leaach       Lebach  Germany  2879832

  incorrect_city_name   correct_city country       id
0       Clstelvmtrano  Castelvetrano   Italy  2525083

  incorrect_city_name       correct_city country       id
0   San Andres tunyla  San Andres Tuxtla  Mexico  3519907

  incorrect_city_name correct_city    country       id
0           San Jmrge    San Jorge  Argentina  3837441

  incorrect_city_name correct_city country       id
0           Arayatuba    Araçatuba  Brazil  3471859

  incorrect_city_name        correct_city country       id
0  Carzx do Piranaíba  Carmo do Paranaíba  Brazil  3466902

  incorrect_city_name correct_city   country       id
0               Divga        Dinga  Pakistan  1179790

  incorrect_city_name correct_city country       id
0             uuorong      Luorong   China  1801850

  incorrect_city_name correct_city    country       id
0            Esrlwood     Earlwood  Australia  2167949

  incorrect_city_name correct_city country       id
0              bametá       Cametá  Brazil  3403697

  incorrect_city_name correct_city country       id
0             Rāmpuro      Rāmpura   India  1258584
1             Rāmpuro      Rāmpura   India  1258592

  incorrect_city_name correct_city  country       id
0           Obehkirch    Oberkirch  Germany  2860080

  incorrect_city_name correct_city       country       id
0         Ouagmdougor  Ouagadougou  Burkina Faso  2357048

  incorrect_city_name correct_city  country      id
0             Asmavir      Armavir  Armenia  616631

  incorrect_city_name correct_city  country       id
0          qinigerloh   Ennigerloh  Germany  2930030

  incorrect_city_name correct_city country       id
0            Mollmndo     Mollendo    Peru  3934707

  incorrect_city_name correct_city country       id
0          jemlavista   Bellavista    Peru  3699364

  incorrect_city_name correct_city country      id
0            Hurghnda     Hurghada   Egypt  361291

  incorrect_city_name correct_city        country       id
0             Portagf      Portage  United States  4925006
1             Portagf      Portage  United States  5006250

  incorrect_city_name    correct_city        country       id
0      Ekergieen Park  Evergreen Park  United States  4891431

  incorrect_city_name     correct_city country       id
0     Duque dt Cvxiis  Duque de Caxias  Brazil  3464374

  incorrect_city_name correct_city  country       id
0           Vĩnh Lone    Vĩnh Long  Vietnam  1562693

  incorrect_city_name correct_city   country       id
0          qan Mamtín   San Martín  Colombia  3669332

  incorrect_city_name correct_city country      id
0             qaralal      Maralal   Kenya  187725

  incorrect_city_name      correct_city  country       id
0    Thành Phố fer Lý  Thành Phố Phủ Lý  Vietnam  1570449

  incorrect_city_name correct_city        country       id
0           Tezksbury    Tewksbury  United States  4952762

  incorrect_city_name correct_city   country      id
0             mulenge      Rulenge  Tanzania  150436

  incorrect_city_name correct_city country      id
0             Mlltepe      Maltepe  Turkey  741763

  incorrect_city_name   correct_city country       id
0       Ciudad Vvllts  Ciudad Valles  Mexico  3530582

  incorrect_city_name       correct_city country       id
0   Pontault-Cpmbpust  Pontault-Combault  France  3024195

  incorrect_city_name correct_city   country       id
0              Tampzn       Tampin  Malaysia  1734738

  incorrect_city_name correct_city country       id
0                 Lar          Lar   India  1265053

  incorrect_city_name correct_city  country      id
0            Recuytsa     Rechytsa  Belarus  622794

  incorrect_city_name correct_city  country       id
0             Gbongaz      Gbongan  Nigeria  2341355

  incorrect_city_name correct_city  country       id
0              Siufok       Siófok  Hungary  3045332

  incorrect_city_name correct_city         country       id
0              Beleer       Belper  United Kingdom  2655942

  incorrect_city_name correct_city country      id
0                Sari         Sari    Iran  116996

  incorrect_city_name correct_city country       id
0               Nuono        Nuoro   Italy  3172154

  incorrect_city_name correct_city        country       id
0          Greqnjield   Greenfield  United States  4258285
1          Greqnjield   Greenfield  United States  4938378
2          Greqnjield   Greenfield  United States  5255068
3          Greqnjield   Greenfield  United States  5354172

  incorrect_city_name correct_city country       id
0             Illhpel      Illapel   Chile  3887344

  incorrect_city_name correct_city country       id
0            Seqtânia     Sertânia  Brazil  3387663

  incorrect_city_name correct_city country       id
0           Itimādhur    Itimādpur   India  1269646

  incorrect_city_name correct_city      country       id
0               Yaucd        Yauco  Puerto Rico  4568917

  incorrect_city_name correct_city country       id
0         Srn Ignacix  San Ignacio  Belize  3581194

  incorrect_city_name correct_city country       id
0            La Barja     La Barca  Mexico  4003526

  incorrect_city_name correct_city country       id
0           Nāsrijanj    Nāsriganj   India  1261722

  incorrect_city_name correct_city    country       id
0              Perdut       Percut  Indonesia  1214189

  incorrect_city_name      correct_city country       id
0    corigliaoo Scalw  Corigliano Scalo   Italy  9003711

  incorrect_city_name correct_city country       id
0             Salernc      Salerno   Italy  3168673

  incorrect_city_name      correct_city         country       id
0    wďwb nad Sázavou  Žďár nad Sázavou  Czech Republic  3061695

  incorrect_city_name correct_city country       id
0         Cadapicuíbk  Carapicuíba  Brazil  3466998

  incorrect_city_name correct_city      country       id
0               Hwaoo        Hwado  South Korea  1897118

  incorrect_city_name correct_city country      id
0                 Qom          Qom    Iran  119208

  incorrect_city_name correct_city country       id
0          Vwcersborg   Vänersborg  Sweden  2665171

  incorrect_city_name correct_city country       id
0            Graznano     Gragnano   Italy  3175952

  incorrect_city_name correct_city  country       id
0            Niddewau     Nidderau  Germany  2863712

  incorrect_city_name correct_city country       id
0                Aioi         Aioi   Japan  1865661

  incorrect_city_name correct_city  country       id
0               Nvewi        Nnewi  Nigeria  2328765

  incorrect_city_name correct_city    country       id
0          Charalqava   Charallave  Venezuela  3645854

  incorrect_city_name correct_city     country       id
0              Iradau       Iradan  Kyrgyzstan  1528283

  incorrect_city_name correct_city country       id
0          Huamahhmco   Huamachuco    Peru  3696509

  incorrect_city_name correct_city country       id
0                Lugo         Lugo   Italy  3174494

  incorrect_city_name correct_city country       id
0         qhaaakvasla  Kharakvasla   India  1266966

  incorrect_city_name correct_city country       id
0          Barddvamkn   Barddhamān   India  1277029

  incorrect_city_name correct_city country       id
0             Skhāwar      Sahāwar   India  1257799

   incorrect_city_name         correct_city country       id
0  Hidashimdreyama-shi  Higashimurayama-shi   Japan  7279570

  incorrect_city_name correct_city country       id
0         Portodbelho  Porto Velho  Brazil  3662762

  incorrect_city_name correct_city  country       id
0            mesterlo     Westerlo  Belgium  2783801

  incorrect_city_name correct_city country       id
0             Guarvba      Guariba  Brazil  3461824

  incorrect_city_name     correct_city country       id
0     Exgliano Zawata  Emiliano Zapata  Mexico  3527879
1     Exgliano Zawata  Emiliano Zapata  Mexico  3527880
2     Exgliano Zawata  Emiliano Zapata  Mexico  8858099

  incorrect_city_name correct_city country       id
0          Arganzgela   Arganzuela   Spain  6544487

  incorrect_city_name correct_city country       id
0         Lasoa Sauta  Lagoa Santa  Brazil  3459138

  incorrect_city_name    correct_city country       id
0      Sampsqngevskiy  Sampsonievskiy  Russia  8504965

  incorrect_city_name     correct_city country       id
0     eantes-lg-Volle  Mantes-la-Ville  France  2996146

  incorrect_city_name correct_city        country       id
0               pacon        Macon  United States  4207400

  incorrect_city_name correct_city country       id
0            Bravpton     Brampton  Canada  5907364

  incorrect_city_name correct_city country       id
0           Newmazket    Newmarket  Canada  6087701

  incorrect_city_name correct_city        country       id
0           los Banos    Los Banos  United States  5368453

  incorrect_city_name correct_city        country       id
0              xalton       Dalton  United States  4190581

  incorrect_city_name correct_city        country       id
0           Roskledge    Rockledge  United States  4170358

  incorrect_city_name correct_city     country       id
0          qan Maruno   San Marino  San Marino  3168070

  incorrect_city_name correct_city     country      id
0               Qazab        Qazax  Azerbaijan  585226

  incorrect_city_name correct_city        country       id
0          Saygeville   Sayreville  United States  5104404

  incorrect_city_name   correct_city country      id
0       Ad carbāsxyah  Ad Darbāsīyah   Syria  170887

  incorrect_city_name correct_city        country       id
0           La Grrnge    La Grange  United States  4204230
1           La Grrnge    La Grange  United States  4898846

  incorrect_city_name correct_city  country       id
0          Halstenqpk   Halstenbek  Germany  2911408

  incorrect_city_name   correct_city   country      id
0       Dsr es Salaim  Dar es Salaam  Tanzania  160263

  incorrect_city_name     correct_city        country       id
0     Brooflyf Crnter  Brooklyn Center  United States  5019330

  incorrect_city_name   correct_city        country       id
0       Lawrenbevillm  Lawrenceville  United States  4205196

  incorrect_city_name correct_city   country       id
0            Caaguazú     Caaguazú  Paraguay  3439317

  incorrect_city_name correct_city country      id
0              ivtury       Avtury  Russia  580218

  incorrect_city_name correct_city  country       id
0            Bojjniba     Boujniba  Morocco  6546693

  incorrect_city_name correct_city country       id
0             Yanzhog      Yanzhou   China  1787031

  incorrect_city_name correct_city country       id
0                Puqi         Puqi   China  1798473

  incorrect_city_name correct_city      country       id
0            Dimbokrc     Dimbokro  Ivory Coast  2289983

  incorrect_city_name correct_city  country      id
0             Kayayza      Kayanza  Burundi  430952

  incorrect_city_name correct_city      country       id
0               Kosar        Kosan  North Korea  1875632

  incorrect_city_name correct_city         country       id
0             Břeclam      Břeclav  Czech Republic  3078773

  incorrect_city_name correct_city  country       id
0             Sohoten      Schoten  Belgium  2786963

  incorrect_city_name correct_city country      id
0                Molo         Molo   Kenya  186315

  incorrect_city_name  correct_city country       id
0        phincha Alva  Chincha Alta    Peru  3943789

  incorrect_city_name correct_city country       id
0              Elbetf       Elbeuf  France  3020307

  incorrect_city_name correct_city country       id
0              eakabe       Makabe   Japan  2112019

  incorrect_city_name correct_city country       id
0             Cosenzr      Cosenza   Italy  2524907

  incorrect_city_name   correct_city        country       id
0       liagaraaFalls  Niagara Falls  United States  5128723

  incorrect_city_name  correct_city   country       id
0        bakhwn Sawan  Nakhon Sawan  Thailand  1608527

  incorrect_city_name     correct_city  country       id
0     Dihurche Mourad  Didouche Mourad  Algeria  2500401

  incorrect_city_name correct_city country       id
0                Dome         Dome   Ghana  2301639

  incorrect_city_name correct_city    country       id
0             Gleoroy      Glenroy  Australia  2165200

  incorrect_city_name   correct_city        country       id
0       Stevens Poinw  Stevens Point  United States  5274644

  incorrect_city_name correct_city country       id
0             Paterja      Paterna   Spain  2512862

  incorrect_city_name correct_city country       id
0             Åtesund      Ålesund  Norway  3163392

  incorrect_city_name correct_city   country      id
0             Lushotk      Lushoto  Tanzania  155569

  incorrect_city_name correct_city country       id
0          yiruvawlur   Tiruvallur   India  1254331

  incorrect_city_name correct_city country       id
0           Hazāiībāg    Hazārībāg   India  1270164

  incorrect_city_name correct_city country       id
0           Orta Nosa    Orta Nova   Italy  3171900

  incorrect_city_name correct_city      country       id
0         San Nicores  San Nicolas  Philippines  1688859

  incorrect_city_name correct_city  country      id
0              Kkrcag       Karcag  Hungary  719404

  incorrect_city_name correct_city   country       id
0           Olancdito    Olanchito  Honduras  3604251

  incorrect_city_name correct_city   country       id
0            Sâmraung     Sâmraông  Cambodia  1825093

  incorrect_city_name correct_city       country       id
0          Malmesbuty   Malmesbury  South Africa  3364346

  incorrect_city_name correct_city country      id
0            Geliboxu     Gelibolu  Turkey  746983

  incorrect_city_name correct_city      country       id
0             Veeddam      Veendam  Netherlands  2745783

      incorrect_city_name            correct_city country       id
0  Kokamachō-koqaiamingmi  Kodamachō-kodamaminami   Japan  1859113

  incorrect_city_name correct_city        country       id
0             Lanving      Lansing  United States  4899340
1             Lanving      Lansing  United States  4998830

  incorrect_city_name correct_city country       id
0              Yucawa       Yuzawa   Japan  2110460

  incorrect_city_name correct_city country       id
0          Chvaxrauli   Chhaprauli   India  1274351

  incorrect_city_name correct_city  country       id
0            Maljhide     Malahide  Ireland  2962725

  incorrect_city_name correct_city country      id
0          hartoszycb   Bartoszyce  Poland  776337

  incorrect_city_name correct_city      country       id
0             Tqlisay      Talisay  Philippines  1683860
1             Tqlisay      Talisay  Philippines  1683877
2             Tqlisay      Talisay  Philippines  1683881

  incorrect_city_name correct_city country       id
0             Jyaxing      Jiaxing   China  1805953

  incorrect_city_name correct_city country       id
0            Linqicng     Linqiong   China  1803365

  incorrect_city_name correct_city   country       id
0               mmora        Amora  Portugal  2271680

  incorrect_city_name correct_city  country      id
0           Balaklina    Balakliya  Ukraine  712926

  incorrect_city_name    correct_city   country       id
0      Mcrinha Goande  Marinha Grande  Portugal  2266703

  incorrect_city_name correct_city        country       id
0          PalguCoast   Palm Coast  United States  4167538

  incorrect_city_name correct_city country       id
0             Barmcoa      Baracoa    Cuba  3567834

  incorrect_city_name correct_city country       id
0            ehusāval     Bhusāval   India  1275778

  incorrect_city_name correct_city country      id
0           Krasnodaz    Krasnodar  Russia  542420

  incorrect_city_name  correct_city country      id
0        tosnwvyy Bor  Sosnovyy Bor  Russia  490172

  incorrect_city_name correct_city  country       id
0              Dazlem       Dahlem  Germany  2939440

  incorrect_city_name correct_city   country       id
0              Siudai       Skudai  Malaysia  1732745

  incorrect_city_name correct_city country       id
0            Mhnhuaçu     Manhuaçu  Brazil  3457952

  incorrect_city_name correct_city        country       id
0             soswell      Roswell  United States  4219934
1             soswell      Roswell  United States  5488441

  incorrect_city_name    correct_city         country       id
0      HradecrKrálxvé  Hradec Králové  Czech Republic  3074967

  incorrect_city_name correct_city      country       id
0             Talisas      Baliuag  Philippines  1727995

  incorrect_city_name correct_city    country       id
0          Wongnrrejo   Wongsorejo  Indonesia  1621439

  incorrect_city_name correct_city country       id
0           zoose Jaw    Moose Jaw  Canada  6078112

     incorrect_city_name           correct_city country       id
0  SaftJuan deslob Lagos  San Juan de los Lagos  Mexico  3985865

  incorrect_city_name correct_city  country      id
0               vahlé        Zahlé  Lebanon  266045

  incorrect_city_name correct_city    country       id
0             Sundury      Sunbury  Australia  2147914

  incorrect_city_name correct_city country       id
0         zwlininskiy  Kalininskiy  Russia  8504951

  incorrect_city_name correct_city country       id
0            fuocheng     Luocheng   China  1801983

  incorrect_city_name correct_city country       id
0            Mişrjtah     Mişrātah   Libya  2214846

  incorrect_city_name correct_city      country       id
0              Meppel       Meppel  Netherlands  2750947

  incorrect_city_name correct_city country       id
0                Wako         Wako   Japan  1907300

  incorrect_city_name correct_city    country       id
0            Armakale     Armadale  Australia  2077579

  incorrect_city_name correct_city country       id
0          Mmrukkanam   Marakkanam   India  1263564

  incorrect_city_name    correct_city   country       id
0      Kgmyhaeng Phet  Kamphaeng Phet  Thailand  1153090

  incorrect_city_name correct_city country       id
0          Concarnowu   Concarneau  France  3024035

  incorrect_city_name correct_city        country       id
0               Gyeen        Green  United States  5156371

  incorrect_city_name correct_city country       id
0              Kturów       Knurów  Poland  3095971

  incorrect_city_name correct_city    country       id
0         Villa Nufta  Villa Nueva  Guatemala  3587902

  incorrect_city_name correct_city country       id
0              sishan       Xishan   China  1803616

  incorrect_city_name correct_city  country       id
0            Bayrejth     Bayreuth  Germany  2951825

  incorrect_city_name correct_city country       id
0          Solleztuno   Sollentuna  Sweden  2675408

  incorrect_city_name correct_city        country       id
0           Ropeville    Roseville  United States  5007655
1           Ropeville    Roseville  United States  5043799
2           Ropeville    Roseville  United States  5388881

  incorrect_city_name   correct_city     country       id
0       Chlle Bwancos  Calle Blancos  Costa Rica  3624509

  incorrect_city_name correct_city  country      id
0            Habbkûch     Habboûch  Lebanon  274874

  incorrect_city_name correct_city country       id
0             Fukurox      Fukuroi   Japan  1863945

  incorrect_city_name correct_city        country       id
0           Englewowd    Englewood  United States  5097672
1           Englewowd    Englewood  United States  5421250

  incorrect_city_name correct_city country       id
0              Coratz       Corato   Italy  3178131

  incorrect_city_name correct_city country       id
0            Rājmirāj     Rājbirāj   Nepal  1282884

    incorrect_city_name          correct_city  country       id
0  Alt-fjhenscmanhausen  Alt-Hohenschönhausen  Germany  8334624

  incorrect_city_name correct_city country       id
0          Pozoblanpy   Pozoblanco   Spain  2512340

  incorrect_city_name    correct_city         country       id
0      Bejhill-on-Sca  Bexhill-on-Sea  United Kingdom  2655777

  incorrect_city_name   correct_city  country       id
0       gchwalzenberg  Schwarzenberg  Germany  2834978

  incorrect_city_name correct_city        country       id
0         Los mngells  Los Angeles  United States  5368361

  incorrect_city_name correct_city  country       id
0                Lere         Lere  Nigeria  2332079

  incorrect_city_name correct_city country       id
0             Seibata      Shibata   Japan  1852607

  incorrect_city_name correct_city        country       id
0         Wesn Islmnd  West Island  Cocos Islands  7304591

  incorrect_city_name correct_city   country       id
0            nalamina     Salamina  Colombia  3670370

  incorrect_city_name correct_city  country       id
0             Aisbach      Ansbach  Germany  2955936

  incorrect_city_name correct_city country      id
0             Vyselkg      Vyselki  Russia  470338

  incorrect_city_name correct_city   country       id
0             Chūnivn      Chūniān  Pakistan  1180942

  incorrect_city_name correct_city country      id
0               Erbua        Erbaa  Turkey  747489

  incorrect_city_name correct_city country       id
0          Thiruiarur   Thiruvarur   India  1254589

  incorrect_city_name      correct_city       country       id
0    bronkhoritapruit  Bronkhorstspruit  South Africa  1015504

  incorrect_city_name correct_city country      id
0              Vranje       Vranje  Serbia  784227

  incorrect_city_name    correct_city   country       id
0      Djmnoen Soduak  Damnoen Saduak  Thailand  1153513

  incorrect_city_name correct_city country      id
0              Rongai       Rongai   Kenya  181135

  incorrect_city_name correct_city country       id
0           Chakapwra    Chakapara   India  1348753

  incorrect_city_name correct_city country       id
0              Tezate       Tecate  Mexico  3982266

  incorrect_city_name correct_city        country       id
0              Krnner       Kenner  United States  4329753

  incorrect_city_name  correct_city country       id
0        Port Albefbi  Port Alberni  Canada  6111632

  incorrect_city_name correct_city    country       id
0           Caloundfa    Caloundra  Australia  2172710

  incorrect_city_name correct_city country       id
0            Lyncheng     Lincheng   China  1803560

  incorrect_city_name  correct_city   country       id
0        mamut Prbkan  Samut Prakan  Thailand  1606590

  incorrect_city_name correct_city    country       id
0         Craigibbzrn  Craigieburn  Australia  2170089

  incorrect_city_name correct_city        country       id
0              Pqrris       Perris  United States  5382146

  incorrect_city_name correct_city country       id
0            Bārbkpur     Bārākpur   India  1277100

  incorrect_city_name correct_city country      id
0         Argureúpoli  Argyroúpoli  Greece  264516

  incorrect_city_name correct_city country       id
0           Kobayaehi    Kobayashi   Japan  1859175

  incorrect_city_name correct_city  country      id
0            Haycoron     Hayvoron  Ukraine  708898

  incorrect_city_name  correct_city        country       id
0        Saint Getrgg  Saint George  United States  5546220

  incorrect_city_name correct_city      country       id
0              Ermeld       Ermelo  Netherlands  2756039

  incorrect_city_name correct_city country       id
0                 Tsu          Tsu   Japan  1849796

  incorrect_city_name correct_city country      id
0              Sobhan       Solhan  Turkey  300377

  incorrect_city_name correct_city country       id
0              Shiwai       Shiwan   China  1794947

  incorrect_city_name correct_city country      id
0               Thike        Thika   Kenya  179330

  incorrect_city_name correct_city country       id
0          Smimhnovsk   Shimanovsk  Russia  2016701

  incorrect_city_name correct_city country      id
0               Wewer        Wawer  Poland  756092

  incorrect_city_name correct_city  country       id
0         Hottersgeim  Hattersheim  Germany  2909240

  incorrect_city_name correct_city        country       id
0           Dicoinson    Dickinson  United States  4686163
1           Dicoinson    Dickinson  United States  5688789

  incorrect_city_name correct_city country       id
0              Nasano       Nakano   Japan  1855863

  incorrect_city_name correct_city country       id
0              Abaegé       Abaeté  Brazil  3473267

  incorrect_city_name correct_city    country       id
0            Semarsng     Semarang  Indonesia  1627896

  incorrect_city_name      correct_city  country       id
0    dal Münsteresfel  Bad Münstereifel  Germany  2953398

  incorrect_city_name    correct_city  country       id
0      Schwelt (Odee)  Schwedt (Oder)  Germany  2834629

    incorrect_city_name          correct_city country       id
0  LesxClauds-sgus-Bois  Les Clayes-sous-Bois  France  3001402

  incorrect_city_name correct_city   country       id
0             Ban Mai      Ban Mai  Thailand  1601579

  incorrect_city_name correct_city         country       id
0           Kingswoob    Kingswood  United Kingdom  2645418

  incorrect_city_name correct_city  country       id
0             Kelhgim      Kelheim  Germany  2891834

  incorrect_city_name correct_city         country       id
0          eorkingmon   Workington  United Kingdom  2633553

  incorrect_city_name correct_city country      id
0           Al Manqvf    Al Manqaf  Kuwait  285778

  incorrect_city_name  correct_city country      id
0        Kravjoufimsk  Krasnoufimsk  Russia  542199

  incorrect_city_name correct_city        country       id
0              Uplazd       Upland  United States  5404915

  incorrect_city_name correct_city country      id
0          Snndomimrz   Sandomierz  Poland  759603

  incorrect_city_name correct_city country       id
0            Nagasadi     Nagasaki   Japan  1856177

  incorrect_city_name correct_city country       id
0         jm Chorrera  La Chorrera  Panama  3707961

  incorrect_city_name correct_city country       id
0           dontluçon    Montluçon  France  2992292

     incorrect_city_name           correct_city country       id
0  Swntiago do las Vwgys  Santiago de las Vegas    Cuba  3536724

  incorrect_city_name correct_city country       id
0              Raipxr       Raipur   India  1258972
1              Raipxr       Raipur   India  1258980

  incorrect_city_name  correct_city         country       id
0        Port Gtasgou  Port Glasgow  United Kingdom  2640060

  incorrect_city_name     correct_city country       id
0     Glórij zofGoitá  Glória do Goitá  Brazil  3398920

  incorrect_city_name correct_city    country       id
0           Watafpone    Watampone  Indonesia  1621884

  incorrect_city_name    correct_city country       id
0      Rostrio do Sbl  Rosário do Sul  Brazil  3450873

  incorrect_city_name correct_city       country       id
0             Marinot      Marigot  Saint Martin  3578851

  incorrect_city_name correct_city        country       id
0          Manhhegter   Manchester  United States  4396915
1          Manhhegter   Manchester  United States  5089178

   incorrect_city_name         correct_city   country       id
0  Nakhon Sl ohammurat  Nakhon Si Thammarat  Thailand  1151933

  incorrect_city_name   correct_city country       id
0       Torbodembarra  Torredembarra   Spain  3107807

  incorrect_city_name correct_city        country       id
0              Cutlkr       Cutler  United States  4152564

    incorrect_city_name          correct_city  country       id
0  Könkgstein im diunus  Königstein im Taunus  Germany  2885760

  incorrect_city_name correct_city   country       id
0             Corintv      Corinto  Colombia  3685871

  incorrect_city_name correct_city        country       id
0                Lynn         Lynn  United States  4942807

  incorrect_city_name correct_city  country      id
0           Comăneşti    Comăneşti  Romania  681017

  incorrect_city_name correct_city country       id
0            fadhupur     Madhupur   India  1264551

  incorrect_city_name  correct_city  country       id
0        Spanisn Towh  Spanish Town  Jamaica  3488465

  incorrect_city_name    correct_city country       id
0      Senyder Canedo  Senador Canedo  Brazil  3447854

  incorrect_city_name correct_city country       id
0             Ctuzhou      Chuzhou   China  1814757

  incorrect_city_name correct_city country       id
0             Goisnia      Goiânia  Brazil  3462377

  incorrect_city_name correct_city country       id
0           yoyoshina    Toyoshina   Japan  1849817

  incorrect_city_name     correct_city country       id
0     ranto pnascácio  Santo Anastácio  Brazil  3449707

  incorrect_city_name correct_city        country       id
0               kslip        Islip  United States  5122413

  incorrect_city_name correct_city  country       id
0           Antwezpen    Antwerpen  Belgium  2803138

  incorrect_city_name correct_city country       id
0              Fuyaxg       Fuyang   China  1810845
1              Fuyaxg       Fuyang   China  1810846

  incorrect_city_name correct_city             country       id
0                 Mao          Mao  Dominican Republic  3496831

  incorrect_city_name correct_city      country       id
0           Koranadal    Koronadal  Philippines  1708522

  incorrect_city_name correct_city     country       id
0            Hājīgqnj     Hājīganj  Bangladesh  1201753

  incorrect_city_name correct_city        country       id
0          Beclrlower   Bellflower  United States  5327422

  incorrect_city_name  correct_city country       id
0        zurukeshwara  Murudeshwara   India  6941937

  incorrect_city_name correct_city        country       id
0          tcgaumburg   Schaumburg  United States  4910713

  incorrect_city_name correct_city   country      id
0              Ignnga       Igunga  Tanzania  159386

  incorrect_city_name correct_city  country       id
0              rashio       Lashio  Myanmar  1314759

  incorrect_city_name    correct_city  country       id
0      Szrzhalombptta  Százhalombatta  Hungary  3044821

  incorrect_city_name correct_city country       id
0               Dayia        Datia   India  1273403

  incorrect_city_name correct_city   country      id
0         'Alm Sabies  'Ali Sabieh  Djibouti  225284

  incorrect_city_name correct_city country       id
0              Ancoha       Ancona   Italy  3183089

  incorrect_city_name       correct_city         country       id
0   Vluašské Meziřačí  Valašské Meziříčí  Czech Republic  3063447

  incorrect_city_name correct_city country       id
0               Cecon        Cenon  France  3027950

  incorrect_city_name correct_city country       id
0         São Josqcim  São Joaquim  Brazil  3448828

  incorrect_city_name correct_city      country       id
0           Purmcrend    Purmerend  Netherlands  2748413

   incorrect_city_name         correct_city country       id
0  Sal Dozato Milanese  San Donato Milanese   Italy  3168414

  incorrect_city_name   correct_city country       id
0       Sarta Cecílid  Santa Cecília  Brazil  3450376

  incorrect_city_name correct_city   country       id
0                Mach         Mach  Pakistan  1171757

  incorrect_city_name  correct_city        country       id
0        Santx Monzca  Santa Monica  United States  5393212

  incorrect_city_name correct_city country      id
0         Akqaamadeni  Akdağmadeni  Turkey  324768

  incorrect_city_name   correct_city country       id
0       Mayāng hxphāl  Mayāng Imphāl   India  1263255

  incorrect_city_name correct_city        country       id
0                Hays         Hays  United States  4272782

  incorrect_city_name correct_city  country      id
0           Vasyeivka    Vasylivka  Ukraine  686729

  incorrect_city_name correct_city country       id
0          sepomucenp   Nepomuceno  Brazil  3456324

  incorrect_city_name correct_city  country       id
0            oaffrine     Kaffrine  Senegal  2251007

  incorrect_city_name   correct_city               country      id
0       Dibka fl-Hisn  Dibba Al-Hisn  United Arab Emirates  292239

  incorrect_city_name correct_city country       id
0               Bawkk        Bawku   Ghana  2303287

  incorrect_city_name correct_city  country       id
0             kalupon      Lalupon  Nigeria  2332357

  incorrect_city_name correct_city country       id
0             Allaucj      Allauch  France  3038159

  incorrect_city_name   correct_city      country       id
0       Ayuteotepeque  Ayutuxtepeque  El Salvador  3587308

  incorrect_city_name correct_city   country      id
0          Pazkrdbhik   Pazardzhik  Bulgaria  728378

  incorrect_city_name correct_city      country       id
0          Kang-neuni   Kang-neung  South Korea  1843137

  incorrect_city_name correct_city     country      id
0           Sabqrabad    Sabirabad  Azerbaijan  585187

  incorrect_city_name correct_city country       id
0              Wusotg       Wusong   China  1792621

  incorrect_city_name correct_city country       id
0          Lucvegoesk   Luchegorsk  Russia  2020689

  incorrect_city_name correct_city   country       id
0             Lzčenec      Lučenec  Slovakia  3058986

  incorrect_city_name correct_city country      id
0            Kkğızman     Kağızman  Turkey  744873

  incorrect_city_name  correct_city country       id
0        Cauto Cricto  Cauto Cristo    Cuba  3564885

  incorrect_city_name correct_city  country       id
0               Macau        Macas  Ecuador  3654541

  incorrect_city_name correct_city country       id
0               pumia        Rumia  Poland  3086706

  incorrect_city_name correct_city country       id
0            Bārzmati     Bārāmati   India  1277091

  incorrect_city_name correct_city        country       id
0         Avbuquarque  Albuquerque  United States  5454711

  incorrect_city_name correct_city        country       id
0            Hamildon     Hamilton  United States  4513575

  incorrect_city_name correct_city country       id
0           Jacutinga    Jacutinga  Brazil  3460267

  incorrect_city_name correct_city country     id
0               Lvḩij        Laḩij   Yemen  73560

  incorrect_city_name correct_city country       id
0              Pabdua       Pandua   India  1260527

  incorrect_city_name correct_city country      id
0               Mudom        Murom  Russia  524294

  incorrect_city_name correct_city  country       id
0           Oued Lily    Oued Lill  Tunisia  2464168

  incorrect_city_name correct_city country      id
0           Moskháten    Moskháton  Greece  256750

  incorrect_city_name correct_city country       id
0             Ayaviri      Ayaviri    Peru  3946985

  incorrect_city_name  correct_city country       id
0        Mxvattupuzhw  Muvattupuzha   India  7279735

  incorrect_city_name correct_city  country       id
0             Mödlinr      Mödling  Austria  2771335

  incorrect_city_name      correct_city country       id
0    Lz Teste-rekBuch  La Teste-de-Buch  France  3006283

  incorrect_city_name correct_city         country       id
0             Watfjrd      Watford  United Kingdom  2634677

  incorrect_city_name     correct_city        country       id
0     GrhenxcresdCity  Greenacres City  United States  4157467

  incorrect_city_name   correct_city country      id
0       Ust’-Dzhegudh  Ust’-Dzheguta  Russia  478130

  incorrect_city_name correct_city      country       id
0              Elsurg       Elburg  Netherlands  2756232

  incorrect_city_name correct_city         country       id
0          Kidlihgtfn   Kidlington  United Kingdom  2645722

  incorrect_city_name correct_city country      id
0            Nīnhābūr     Nīshābūr    Iran  122285

  incorrect_city_name correct_city  country       id
0          Malufyashi   Malumfashi  Nigeria  2331005

  incorrect_city_name correct_city country       id
0            La Unióy     La Unión    Peru  3695466

  incorrect_city_name correct_city        country       id
0            klermont     Clermont  United States  4151352

  incorrect_city_name correct_city         country       id
0          harmvrthen   Carmarthen  United Kingdom  2653755

  incorrect_city_name  correct_city  country       id
0        müninghausen  Lüdinghausen  Germany  2875417

  incorrect_city_name correct_city country       id
0             yhimoda      Shimoda   Japan  1852357

  incorrect_city_name correct_city country       id
0            Tdraiyūr     Turaiyūr   India  1254043

  incorrect_city_name       correct_city country       id
0   Basavanallāsevādi  Basavana Bāgevādi   India  1276782

           incorrect_city_name                 correct_city country       id
0  Franbionamirjio Real Palmas  Fraccionamiento Real Palmas  Mexico  8858093

  incorrect_city_name correct_city country       id
0               bānki        Bānki   India  1277273

  incorrect_city_name correct_city        country       id
0         SprinuzHill  Spring Hill  United States  4173838
1         SprinuzHill  Spring Hill  United States  4659446

  incorrect_city_name  correct_city country       id
0        Mbanfa Congx  Mbanza Congo  Angola  2239520

  incorrect_city_name correct_city country       id
0           Luanchyng    Luancheng   China  1802204

  incorrect_city_name correct_city        country       id
0           LayCrosse    La Crosse  United States  5258957

  incorrect_city_name correct_city country      id
0          yikcoretsk   Tikhoretsk  Russia  483029

  incorrect_city_name  correct_city        country       id
0        Meaiow Wpods  Meadow Woods  United States  4163918

  incorrect_city_name     correct_city country       id
0     Pihkary Śvąsgie  Piekary Śląskie  Poland  3089125

  incorrect_city_name correct_city country      id
0            Sevdobsk     Serdobsk  Russia  496934

  incorrect_city_name  correct_city  country       id
0        uâs el Aïouz  Râs el Aïoun  Algeria  2483968

  incorrect_city_name correct_city country       id
0              Dasūya       Dasūya   India  1273410

  incorrect_city_name correct_city  country       id
0         zildhrstadt  Filderstadt  Germany  3336891

  incorrect_city_name correct_city country      id
0              Ugeich       Uglich  Russia  479532

  incorrect_city_name correct_city country       id
0           uondaicha    Dondaicha   India  1272411

  incorrect_city_name correct_city country       id
0             Mascotl      Mascote  Brazil  3457566

           incorrect_city_name                 correct_city country      id
0  Orekdovo-Bcrisxvo Severpzye  Orekhovo-Borisovo Severnoye  Russia  515027

  incorrect_city_name correct_city country       id
0             Tbhamba      Tchamba    Togo  2363908

  incorrect_city_name correct_city        country       id
0              vurien       Burien  United States  5788516

   incorrect_city_name         correct_city  country      id
0  Chervonoptrtyqanx’k  Chervonopartyzans’k  Ukraine  710548

  incorrect_city_name correct_city                 country       id
0               Bifać        Bihać  Bosnia and Herzegovina  3204222

  incorrect_city_name correct_city    country       id
0           Melbournk    Melbourne  Australia  2158177

  incorrect_city_name  correct_city         country       id
0        iewtownabbeq  Newtownabbey  United Kingdom  2641520

  incorrect_city_name correct_city country       id
0            Bertifga     Bertioga  Brazil  3470052

  incorrect_city_name correct_city      country       id
0              Gijanv       Gijang  South Korea  1842966

  incorrect_city_name correct_city country       id
0            Sgiojiri     Shiojiri   Japan  1852003

  incorrect_city_name       correct_city  country       id
0   Khemih el Khechem  Khemis el Khechna  Algeria  2491913

  incorrect_city_name   correct_city        country       id
0       SaintcChzrles  Saint Charles  United States  4367734
1       SaintcChzrles  Saint Charles  United States  4406831
2       SaintcChzrles  Saint Charles  United States  4908737

  incorrect_city_name    correct_city  country      id
0      Saintj-Sumanne  Sainte-Suzanne  Reunion  935248

  incorrect_city_name   correct_city         country       id
0       Northahlerjon  Northallerton  United Kingdom  2641435

  incorrect_city_name     correct_city country      id
0     Kochubenefskoyh  Kochubeyevskoye  Russia  841006

  incorrect_city_name correct_city country       id
0             Wucheag      Wucheng   China  1791347

  incorrect_city_name correct_city country       id
0             Koeluār      Koelwār   India  1266372

  incorrect_city_name correct_city  country       id
0           rgaminana    Ogaminana  Nigeria  2327827

  incorrect_city_name correct_city  country       id
0              aubize       Tubize  Belgium  2785169

  incorrect_city_name correct_city country       id
0               gmbur        Ambur   India  1278815

  incorrect_city_name correct_city     country       id
0              Matoba       Mathba  Bangladesh  1185173

  incorrect_city_name correct_city        country       id
0              Doltzn       Dolton  United States  4890009

  incorrect_city_name correct_city country       id
0         Bellamprvli  Bellampalli   India  7302806

  incorrect_city_name correct_city        country       id
0            Limeriik     Limerick  United States  5198034

  incorrect_city_name correct_city     country       id
0             Bexioky      Betioky  Madagascar  1066310

  incorrect_city_name correct_city country       id
0              sorhāt       Jorhāt   India  1268820

  incorrect_city_name correct_city  country       id
0          Dxngilfing   Dingolfing  Germany  2936909

  incorrect_city_name correct_city country      id
0             Sedheke      Sesheke  Zambia  898905

  incorrect_city_name correct_city  country       id
0                Jena         Jena  Germany  2895044

  incorrect_city_name correct_city        country       id
0             Rnading      Reading  United States  4948462
1             Rnading      Reading  United States  5207728

  incorrect_city_name correct_city      country       id
0               Roqas        Roxas  Philippines  1691441
1               Roqas        Roxas  Philippines  1691446

  incorrect_city_name correct_city        country       id
0             Medyord      Medford  United States  4943629
1             Medyord      Medford  United States  5126518
2             Medyord      Medford  United States  5740099

  incorrect_city_name correct_city  country      id
0         Piatykhappy  Piatykhatky  Ukraine  695965

  incorrect_city_name  correct_city country       id
0        Lloydminstwp  Lloydminster  Canada  6058024

  incorrect_city_name correct_city country       id
0           Xirivflla    Xirivella   Spain  2519466

  incorrect_city_name correct_city  country       id
0         Taefkwrchen  Taufkirchen  Germany  2823812

  incorrect_city_name correct_city        country       id
0           Whixehall    Whitehall  United States  4528291

  incorrect_city_name correct_city country       id
0           Kirovgryd    Kirovgrad  Russia  1503335

  incorrect_city_name correct_city country      id
0              Kāsqān       Kāshān    Iran  128477

  incorrect_city_name correct_city        country       id
0           Plalnview    Plainview  United States  5131638
1           Plalnview    Plainview  United States  5528450

  incorrect_city_name correct_city  country       id
0                Cham         Cham  Germany  2940204

  incorrect_city_name correct_city country       id
0          egua Dzlce   Agua Dulce  Mexico  3533269

  incorrect_city_name correct_city         country       id
0         Kirg's tynn  King's Lynn  United Kingdom  2645456

  incorrect_city_name correct_city country       id
0              Cajtro       Castro  Brazil  3466704

  incorrect_city_name  correct_city country       id
0        Pueblo dfevo  Pueblo Nuevo  Mexico  4007676

  incorrect_city_name correct_city country       id
0            Ayamodte     Ayamonte   Spain  2521456

  incorrect_city_name   correct_city     country       id
0       hovc Figueira  Cova Figueira  Cape Verde  3374707

  incorrect_city_name correct_city  country       id
0           Dpbrovnik    Dubrovnik  Croatia  3201047

  incorrect_city_name correct_city  country       id
0               Daxas        Dabas  Hungary  3053836

  incorrect_city_name correct_city country       id
0           Naxjangūd    Nanjangūd   India  1261910

  incorrect_city_name correct_city      country       id
0             aariaya      Sariaya  Philippines  1687164

  incorrect_city_name correct_city country       id
0              Sagara       Sagara   Japan  1853280

  incorrect_city_name correct_city country       id
0            nimbiras     Timbiras  Brazil  3386372

  incorrect_city_name correct_city    country       id
0            Bengkuhu     Bengkulu  Indonesia  1649150

  incorrect_city_name correct_city country       id
0           mrosinone    Frosinone   Italy  3176515

  incorrect_city_name correct_city                           country       id
0              Tshelc       Tshela  Democratic Republic of the Congo  2311127

  incorrect_city_name correct_city country       id
0           Ängelhodm    Ängelholm  Sweden  2725901

  incorrect_city_name correct_city country       id
0              kasaki       Hasaki   Japan  2112802

  incorrect_city_name  correct_city country       id
0        Syimo-furanl  Shimo-furano   Japan  2128147

  incorrect_city_name correct_city   country      id
0              Sheyui       Shelui  Tanzania  150037

  incorrect_city_name correct_city country       id
0             horosso      Yorosso    Mali  2448442

  incorrect_city_name correct_city     country       id
0              Betafm       Betafo  Madagascar  1066514

  incorrect_city_name correct_city country       id
0              Lattei       Lattes  France  3006121

  incorrect_city_name correct_city country      id
0              Lccapa       Lucapa  Angola  145724

  incorrect_city_name    correct_city country       id
0      Nāmatiriprttai  Nāmagiripettai   India  1262040

  incorrect_city_name correct_city country       id
0            fchinohe     Ichinohe   Japan  2129961

  incorrect_city_name correct_city country       id
0           Biahmapur    Brahmapur   India  1275198

  incorrect_city_name correct_city country       id
0               Syhum        Suhum   Ghana  2295065

  incorrect_city_name correct_city country       id
0             Harstah      Harstad  Norway  3153823

  incorrect_city_name correct_city country       id
0           Guangmpng    Guangming   China  2034497

  incorrect_city_name correct_city country       id
0         Chiguayxnve  Chiguayante   Chile  3895138

  incorrect_city_name correct_city  country       id
0              Kacoro       Kagoro  Nigeria  2335614

  incorrect_city_name correct_city country      id
0                Aden         Aden   Yemen  415189

  incorrect_city_name correct_city        country       id
0          BocanRatoy   Boca Raton  United States  4148411

      incorrect_city_name            correct_city country       id
0  Cjrnnwvirres-sur-Marne  Chennevières-sur-Marne  France  3025509

  incorrect_city_name       correct_city country       id
0   uzudad del varmen  Ciudad del Carmen  Mexico  3530599

  incorrect_city_name correct_city country       id
0          Mahnsamfnd   Mahāsamund   India  1264414

  incorrect_city_name correct_city country       id
0          Pipijkapan   Pijijiapan  Mexico  3521476

  incorrect_city_name correct_city country       id
0               xālūr        Sālūr   India  1257587

  incorrect_city_name correct_city country      id
0              Wakiko       Wakiso  Uganda  225964

  incorrect_city_name correct_city  country       id
0             Gödkllő      Gödöllő  Hungary  3052236

  incorrect_city_name correct_city        country       id
0          Wiqmingson   Wilmington  United States  4145381
1          Wiqmingson   Wilmington  United States  4499379
2          Wiqmingson   Wilmington  United States  4955840

  incorrect_city_name correct_city country       id
0              Mikuxi       Mikuni   Japan  1857260

  incorrect_city_name correct_city country      id
0              okyazı       Akyazı  Turkey  752288

  incorrect_city_name correct_city country       id
0               Jilip        Jilin   China  2036502

  incorrect_city_name correct_city  country      id
0            Rubiyhne     Rubizhne  Ukraine  695274

  incorrect_city_name correct_city country       id
0               Nagas        Nagar   India  1262253

  incorrect_city_name correct_city country      id
0                Luga         Luga  Russia  533690

  incorrect_city_name correct_city        country       id
0              Eluira       Elmira  United States  5116497

  incorrect_city_name      correct_city country       id
0    Maisees-Laffitte  Maisons-Laffitte  France  2996564

  incorrect_city_name correct_city  country      id
0            Korseolm     Korsholm  Finland  651299

  incorrect_city_name correct_city       country      id
0         Tmohoyandoo  Thohoyandou  South Africa  949224

  incorrect_city_name correct_city  country       id
0              Kaduna       Kaduna  Nigeria  2335727

  incorrect_city_name  correct_city country       id
0        gão ueopoldo  São Leopoldo  Brazil  3448622

  incorrect_city_name correct_city   country       id
0               Gijón        Girón  Colombia  3682018

  incorrect_city_name correct_city   country      id
0               Mlali        Mlalo  Tanzania  153423

  incorrect_city_name correct_city   country      id
0              Kongoa       Kondoa  Tanzania  156510

  incorrect_city_name correct_city     country       id
0            Sakhikur     Sakhipur  Bangladesh  1189056

  incorrect_city_name correct_city country      id
0             Lieiāja      Liepāja  Latvia  457954

  incorrect_city_name correct_city country       id
0             Jaciarl      Jaciara  Brazil  3460355

  incorrect_city_name correct_city     country      id
0              Sauyan       Salyan  Azerbaijan  147271

  incorrect_city_name correct_city country       id
0             Chamala      Chapala  Mexico  4014553

  incorrect_city_name correct_city country       id
0                Rota         Rota   Spain  2511700

  incorrect_city_name correct_city    country       id
0            ueli Tua     Deli Tua  Indonesia  1215199

  incorrect_city_name correct_city    country       id
0             Fedtral      Federal  Argentina  3433956

  incorrect_city_name correct_city   country      id
0              Mqbama       Mabama  Tanzania  155515

  incorrect_city_name correct_city        country       id
0              Elmoot       Elmont  United States  5116508

  incorrect_city_name correct_city  country       id
0              oreden       Vreden  Germany  2815824

    incorrect_city_name          correct_city country       id
0  ian Swlvador El secv  San Salvador El Seco  Mexico  3517831

  incorrect_city_name      correct_city  country       id
0    WaldshxtyTixngen  Waldshut-Tiengen  Germany  2814791

  incorrect_city_name correct_city        country       id
0         Bensenvillf  Bensenville  United States  4884509

  incorrect_city_name correct_city      country       id
0                Velp         Velp  Netherlands  2745677

  incorrect_city_name    correct_city  country       id
0      Stadtalleidorp  Stadtallendorf  Germany  2829804

  incorrect_city_name correct_city   country       id
0              Naudot       Naukot  Pakistan  1169367

  incorrect_city_name   correct_city   country       id
0       Prtaling Jayh  Petaling Jaya  Malaysia  1735158

  incorrect_city_name  correct_city        country       id
0        Groveroville  Gloversville  United States  5118743

  incorrect_city_name correct_city country       id
0             Jiashab      Jiashan   China  7303248

  incorrect_city_name      correct_city   country       id
0    Jalāxpur Piraāla  Jalālpur Pīrwāla  Pakistan  1176358

  incorrect_city_name correct_city country       id
0             Pinhnan      Pingnan   China  1798733

  incorrect_city_name correct_city country      id
0          Chistoboc’   Chistopol’  Russia  567990

  incorrect_city_name correct_city        country       id
0              Salfna       Salina  United States  4278890

  incorrect_city_name correct_city  country       id
0          Regevsburx   Regensburg  Germany  2849483

  incorrect_city_name correct_city country     id
0         Aş Şuwssrah  Aş Şuwayrah    Iraq  98459

  incorrect_city_name correct_city country       id
0           Fīrlzābād    Fīrozābād   India  1271885

  incorrect_city_name  correct_city country       id
0        Puerto Vbrad  Puerto Varas   Chile  3874930

  incorrect_city_name correct_city country       id
0              hshawa       Oshawa  Canada  6094578

  incorrect_city_name correct_city country       id
0               ptami        Itami   Japan  1861310

,incorrect_city_name,correct_city,country,id
0,HotgSpridgs datbonallPark,Hot Springs National Park,United States,8605040

  incorrect_city_name correct_city  country      id
0            lloieşti     Ploieşti  Romania  670474

  incorrect_city_name correct_city  country       id
0            Frfeport     Freeport  Bahamas  3572375

  incorrect_city_name correct_city country       id
0            Pāranpur     Pālanpur   India  1260777

  incorrect_city_name correct_city  country       id
0            aüllheim     Müllheim  Germany  2867770

  incorrect_city_name correct_city country       id
0               Ystyd        Ystad  Sweden  2662149

  incorrect_city_name correct_city country       id
0          Ourp Pretf   Ouro Preto  Brazil  3455671

  incorrect_city_name correct_city country      id
0           Kuz’minki    Kuz’minki  Russia  537832

  incorrect_city_name correct_city  country       id
0             Pturham      Pourham  Senegal  2246608

  incorrect_city_name correct_city country       id
0             Hwizhou      Huizhou   China  1806776

  incorrect_city_name correct_city country       id
0         Mqra Tagdio  Mira Taglio   Italy  3173385

  incorrect_city_name correct_city      country       id
0              Nhpier       Napier  New Zealand  2186313

  incorrect_city_name correct_city country       id
0         Barahzchāna  Bara Uchāna   India  1254000

  incorrect_city_name    correct_city         country       id
0      Westzqridgford  West Bridgford  United Kingdom  2634493

  incorrect_city_name correct_city country       id
0             llalpan      Tlalpan  Mexico  3515428

  incorrect_city_name correct_city        country       id
0             Livonik      Livonia  United States  4999837

  incorrect_city_name correct_city country      id
0             Vzluyki      Valuyki  Russia  477192

  incorrect_city_name correct_city country       id
0              Chāgar       Chāpar   India  1274618

  incorrect_city_name correct_city country       id
0               Deohi        Deoli   India  1273083
1               Deohi        Deoli   India  1273228

  incorrect_city_name correct_city country       id
0               Zushi        Zushi   Japan  1847968

  incorrect_city_name correct_city country       id
0               Nagad        Nagai   Japan  2111781

  incorrect_city_name correct_city country       id
0               Pjnda        Ponda   India  1259429

  incorrect_city_name correct_city                           country       id
0            Mbandakp     Mbandaka  Democratic Republic of the Congo  2312895

  incorrect_city_name correct_city country       id
0                Lugu         Lugu  Taiwan  1672551

  incorrect_city_name correct_city     country       id
0          Ilanadnana   Ifanadiana  Madagascar  1064366

  incorrect_city_name correct_city        country       id
0           Dmersburg    Dyersburg  United States  4619800

  incorrect_city_name correct_city   country      id
0            Bashanat     Bashanet  Tanzania  161204

  incorrect_city_name correct_city   country       id
0            Mxntekab     Mentekab  Malaysia  1735018

  incorrect_city_name    correct_city country       id
0      Ctmpbell Rivej  Campbell River  Canada  5914132

  incorrect_city_name correct_city country       id
0              Nabnwa       Nainwa   India  1262115

  incorrect_city_name correct_city        country       id
0            Rotamond     Rosamond  United States  5388735

  incorrect_city_name  correct_city  country       id
0        Crimmitschru  Crimmitschau  Germany  2939747

  incorrect_city_name correct_city        country       id
0              Oswegk       Oswego  United States  4904996
1              Oswegk       Oswego  United States  5130081

  incorrect_city_name correct_city   country      id
0                Wete         Wete  Tanzania  148842

  incorrect_city_name correct_city country      id
0           Shchukinf    Shchukino  Russia  495136

  incorrect_city_name correct_city country       id
0             rortici      Portici   Italy  3170116

   incorrect_city_name         correct_city country       id
0  Minskuwhichō-mptoba  Minakuchichō-matoba   Japan  1857209

  incorrect_city_name correct_city  country      id
0               Kutka        Kotka  Finland  650946

  incorrect_city_name correct_city country       id
0          LacPinrana   La Pintana   Chile  7281017

  incorrect_city_name correct_city country      id
0               Magan        Ma'an  Jordan  248382

  incorrect_city_name  correct_city             country       id
0        suerto Platt  Puerto Plata  Dominican Republic  3493175

  incorrect_city_name correct_city     country      id
0               eqsay        Aqsay  Kazakhstan  610613

  incorrect_city_name correct_city country       id
0             Fioranf      Fiorano   Italy  3176970

  incorrect_city_name correct_city country      id
0            Gorelrvo     Gorelovo  Russia  560142

  incorrect_city_name correct_city country      id
0               Hixan        Hizan  Turkey  312024

  incorrect_city_name correct_city  country       id
0             Lebbeie      Lebbeke  Belgium  2793144

  incorrect_city_name correct_city country      id
0             Apafity      Apatity  Russia  581357

  incorrect_city_name correct_city  country      id
0          Ybsyquvata   Yasynuvata  Ukraine  688373

  incorrect_city_name correct_city  country       id
0              Pdayas       Playas  Ecuador  3653015

  incorrect_city_name correct_city    country       id
0           Pemangkat    Pemangkat  Indonesia  1631637

  incorrect_city_name correct_city     country       id
0             Zsosaly      Zhosaly  Kazakhstan  1516519

  incorrect_city_name       correct_city country       id
0   Samigwy-le-Temzle  Savigny-le-Temple  France  2975536

  incorrect_city_name correct_city  country       id
0                Saki         Saki  Nigeria  2323390

  incorrect_city_name correct_city country       id
0               Mobhe        Moche    Peru  3694725

  incorrect_city_name correct_city   country       id
0              Taunsz       Taunsa  Pakistan  1163724

  incorrect_city_name correct_city   country       id
0             Amadord      Amadora  Portugal  2271772

  incorrect_city_name correct_city       country      id
0              Ţurayc       Ţurayf  Saudi Arabia  101312

  incorrect_city_name correct_city       country       id
0          Aqlanridge   Allanridge  South Africa  1023287

  incorrect_city_name correct_city   country       id
0                Yoro         Yoro  Honduras  3600195

       incorrect_city_name             correct_city country       id
0  SãozGunçalo do Amtranee  São Gonçalo do Amarante  Brazil  3388714

  incorrect_city_name  correct_city country      id
0        kovordssiysk  Novorossiysk  Russia  518255

  incorrect_city_name correct_city                   country       id
0                Nola         Nola  Central African Republic  2383827

  incorrect_city_name        correct_city country       id
0  Actpulux de Juárez  Acapulco de Juárez  Mexico  3533462

  incorrect_city_name correct_city      country       id
0              Chinru       Chinju  South Korea  1846052

  incorrect_city_name correct_city country      id
0                 Muş          Muş  Turkey  304081

  incorrect_city_name correct_city country      id
0             Sürmene      Sürmene  Turkey  739215

  incorrect_city_name correct_city country       id
0             Yunguyo      Yunguyo    Peru  3925476

  incorrect_city_name correct_city   country       id
0               Yopap        Yopal  Colombia  3665688

  incorrect_city_name      correct_city country       id
0    Tiruptaraogunrlm  Tirupparangunram   India  1254356

  incorrect_city_name correct_city country      id
0              Kevrov       Kovrov  Russia  543460

  incorrect_city_name correct_city country       id
0             Machabí      Machalí   Chile  3881102

  incorrect_city_name correct_city      country       id
0               xmmen        Emmen  Netherlands  2756136

  incorrect_city_name correct_city        country       id
0            Delawgre     Delaware  United States  5151891

  incorrect_city_name correct_city country       id
0             Amalneh      Amalner   India  1278931

  incorrect_city_name correct_city   country       id
0               donga        Tonga  Cameroon  2221394

  incorrect_city_name correct_city  country       id
0               Anhim        Achim  Germany  2959681

  incorrect_city_name   correct_city    country       id
0       South Grscton  South Grafton  Australia  2148997

  incorrect_city_name correct_city  country       id
0           Thasetmyo    Thayetmyo  Myanmar  1292037

  incorrect_city_name correct_city country       id
0            Ktandian     Kuandian   China  2036283

  incorrect_city_name correct_city         country       id
0               Alton        Alton  United Kingdom  2657408

  incorrect_city_name   correct_city country       id
0       qhunganācheri  Changanācheri   India  1274664

  incorrect_city_name correct_city country      id
0           Morozohsk    Morozovsk  Russia  525162

  incorrect_city_name correct_city        country       id
0              Nzrton       Norton  United States  4945911

  incorrect_city_name correct_city  country       id
0           Bergedozf    Bergedorf  Germany  7290243

  incorrect_city_name correct_city     country       id
0           Badyrganj    Badarganj  Bangladesh  1185283

       incorrect_city_name             correct_city country       id
0  Marechal Chnyido Roneok  Marechal Cândido Rondon  Brazil  3457772

  incorrect_city_name correct_city country       id
0             Nirwāna      Narwāna   India  1261739

  incorrect_city_name     correct_city country      id
0     utaryy Mafgjbek  Staryy Malgobek  Russia  874045

  incorrect_city_name correct_city country       id
0              Wudang       Wuyang   China  1790885

  incorrect_city_name correct_city    country       id
0            Ranywick     Randwick  Australia  2208285

  incorrect_city_name correct_city country       id
0            Mahanzas     Matanzas    Cuba  3547398

  incorrect_city_name correct_city country       id
0          Owon Soung   Owen Sound  Canada  6095645

  incorrect_city_name  correct_city  country       id
0        Oscderslebxn  Oschersleben  Germany  2856930

  incorrect_city_name correct_city      country       id
0               Mrppo        Moppo  South Korea  1841066

  incorrect_city_name correct_city   country       id
0           Pāknattan    Pākpattan  Pakistan  1168555

  incorrect_city_name correct_city    country       id
0               Swgli        Sigli  Indonesia  1213821

  incorrect_city_name correct_city country       id
0            Manglavr     Manglaur   India  1263761

  incorrect_city_name     correct_city country      id
0     Stapaya hupavka  Staraya Kupavna  Russia  489162

  incorrect_city_name correct_city country       id
0             Pdkaran      Pokaran   India  1259460

  incorrect_city_name correct_city country       id
0              Digbvi       Digboi   India  1272629

  incorrect_city_name correct_city country      id
0                Bolu         Bolu  Turkey  750516

  incorrect_city_name correct_city    country       id
0            Wepisara     Welisara  Sri Lanka  1223648

  incorrect_city_name correct_city     country       id
0            Hazotasp     Hazorasp  Uzbekistan  1513957

  incorrect_city_name     correct_city country       id
0     Cruzefrohdo rul  Cruzeiro do Sul  Brazil  3664464

  incorrect_city_name correct_city  country       id
0            Turnhouy     Turnhout  Belgium  2785141

  incorrect_city_name correct_city     country       id
0         rhemokaīkha  Shemonaīkha  Kazakhstan  1519226

  incorrect_city_name correct_city country      id
0           Zcerdevka    Zherdevka  Russia  463217

  incorrect_city_name correct_city country       id
0              Kitcor       Kithor   India  1266461

  incorrect_city_name correct_city         country       id
0          rortsmoutf   Portsmouth  United Kingdom  2639996

  incorrect_city_name     correct_city country      id
0     Medveqx’yegtrsk  Medvezh’yegorsk  Russia  527888

  incorrect_city_name correct_city country       id
0               Royaw        Royan  France  2982343

  incorrect_city_name correct_city country       id
0          cultanaazi   Sultangazi  Turkey  7628416

  incorrect_city_name correct_city    country       id
0           kingosari    Singosari  Indonesia  1626899

  incorrect_city_name correct_city   country      id
0         Franciszswn  Francistown  Botswana  933778

  incorrect_city_name correct_city      country       id
0          Den weldeo   Den Helder  Netherlands  2757220

  incorrect_city_name correct_city country      id
0             Galátsz      Galátsi  Greece  262135

  incorrect_city_name     correct_city  country       id
0     lriedrpchhhagen  Friedrichshagen  Germany  2924577

  incorrect_city_name correct_city    country       id
0            Polewald     Polewali  Indonesia  1630935

  incorrect_city_name correct_city country       id
0             Itaguag      Itaguaí  Brazil  3460899

  incorrect_city_name correct_city  country       id
0          ychorndorr   Schorndorf  Germany  2836320

  incorrect_city_name correct_city country       id
0               Rājām        Rāzām   India  1258270

  incorrect_city_name correct_city country       id
0             Vierzof      Vierzon  France  2969257

  incorrect_city_name correct_city country      id
0            Al Ḩvmūl     Al Ḩāmūl   Egypt  361213

  incorrect_city_name correct_city      country       id
0              Hdiloo       Heiloo  Netherlands  2754516

  incorrect_city_name correct_city country       id
0            Yamagapa     Yamagata   Japan  2110556

  incorrect_city_name correct_city    country       id
0             pondano      Tondano  Indonesia  1623424

  incorrect_city_name   correct_city country       id
0       Vicdsriaville  Victoriaville  Canada  6174151

  incorrect_city_name  correct_city    country       id
0        río Cebalkos  Río Ceballos  Argentina  3838902

  incorrect_city_name correct_city  country       id
0          Inzolsuadt   Ingolstadt  Germany  2895992

  incorrect_city_name correct_city country       id
0             Kātpāli      Kātpādi   India  1267456

  incorrect_city_name correct_city country      id
0           Ar Rayytn    Ar Rayyān   Qatar  289888

  incorrect_city_name     correct_city country       id
0     Nishishiluinaco  Nishishinminato   Japan  1852385

  incorrect_city_name correct_city country       id
0             Shibada      Shimada   Japan  1852472

  incorrect_city_name correct_city country       id
0           Trebiglio    Treviglio   Italy  3165207

  incorrect_city_name correct_city country       id
0            Velletri     Velletri   Italy  3164630

  incorrect_city_name correct_city        country       id
0            Ondlaska     Onalaska  United States  5265702

  incorrect_city_name correct_city    country       id
0            Bathucst     Bathurst  Australia  2176632

  incorrect_city_name correct_city    country       id
0            firadesa     Wiradesa  Indonesia  1621520

  incorrect_city_name correct_city  country       id
0            Ebecbach     Eberbach  Germany  2934020

  incorrect_city_name correct_city   country       id
0          Shāhhāokot   Shāhdādkot  Pakistan  1165638

  incorrect_city_name  correct_city  country      id
0        Uusfktupunki  Uusikaupunki  Finland  633221

  incorrect_city_name correct_city    country      id
0           Kėdainisi    Kėdainiai  Lithuania  598272

  incorrect_city_name correct_city country       id
0                Jora         Jora   India  1268823

    incorrect_city_name          correct_city country     id
0  Al Mawşil alwxadītjh  Al Mawşil al Jadīdah    Iraq  99071

  incorrect_city_name  correct_city country       id
0        Jaggayyapexb  Jaggayyapeta   India  1269570

  incorrect_city_name correct_city country      id
0               Haoza        Havza  Turkey  745714

  incorrect_city_name correct_city country       id
0            Jandkpur     Janakpur   Nepal  1283318

  incorrect_city_name correct_city country       id
0           Tsukazaki    Tsukawaki   Japan  1849706

  incorrect_city_name   correct_city        country       id
0       Sandh Shrings  Sandy Springs  United States  4221333

  incorrect_city_name correct_city        country       id
0            Adelanjo     Adelanto  United States  5322400

  incorrect_city_name correct_city  country       id
0            Iserlodn     Iserlohn  Germany  2895669

  incorrect_city_name correct_city         country       id
0           Pontypooq    Pontypool  United Kingdom  2640106

  incorrect_city_name correct_city country      id
0             Erdemlg      Erdemli  Turkey  315515

,incorrect_city_name,correct_city,country,id
0,Palikur - Naduoval lovernment Cenoef,Palikir - National Government Center,Micronesia,2081986

  incorrect_city_name correct_city country      id
0           Ostasjkov    Ostashkov  Russia  514259

  incorrect_city_name correct_city country       id
0              Peteād       Petlād   India  1259841

  incorrect_city_name correct_city country      id
0         wlekseytvka  Alekseyevka  Russia  582846
1         wlekseytvka  Alekseyevka  Russia  582956

  incorrect_city_name correct_city      country       id
0               Gvpan        Gapan  Philippines  1713226

  incorrect_city_name correct_city country      id
0           Troparëvm    Troparëvo  Russia  481453

  incorrect_city_name correct_city    country       id
0              Paqang       Padang  Indonesia  1633419

  incorrect_city_name correct_city country      id
0               Ammnn        Amman  Jordan  250441

  incorrect_city_name  correct_city       country      id
0        Johannnsburx  Johannesburg  South Africa  993800

  incorrect_city_name correct_city        country       id
0         Gnznite Bay  Granite Bay  United States  5353530

  incorrect_city_name correct_city  country      id
0           Armylns’k    Armyans’k  Ukraine  713203

  incorrect_city_name correct_city  country      id
0              Suvyra       Skvyra  Ukraine  693615

  incorrect_city_name correct_city   country       id
0                Muar         Muar  Malaysia  1732869

  incorrect_city_name correct_city   country       id
0         Piwtal Novo  Pinhal Novo  Portugal  2264718

  incorrect_city_name   correct_city country      id
0       Likqno-Dulivo  Likino-Dulevo  Russia  535243

  incorrect_city_name    correct_city    country       id
0      Villv Merwedes  Villa Mercedes  Argentina  7116866

  incorrect_city_name correct_city country       id
0         vg Campello  el Campello   Spain  2520447

  incorrect_city_name correct_city country       id
0            Siidipet     Siddipet   India  1256377

  incorrect_city_name correct_city      country       id
0             mulilan      Pulilan  Philippines  1692565

  incorrect_city_name correct_city           country       id
0          Pnptndetta   Popondetta  Papua New Guinea  2088163

  incorrect_city_name correct_city country       id
0               Kadod        Kadod   India  1268667

  incorrect_city_name correct_city country       id
0            Chaojang     Chaoyang   China  2038118
1            Chaojang     Chaoyang   China  2038120

  incorrect_city_name correct_city    country       id
0          Maharxcama   Maharagama  Sri Lanka  1236854

  incorrect_city_name correct_city    country       id
0            tongging     Tongging  Indonesia  1213442

  incorrect_city_name correct_city country       id
0              Mvghar       Maghar   India  1264504

  incorrect_city_name correct_city country      id
0                Kulp         Kulp  Turkey  305750

  incorrect_city_name correct_city  country       id
0            Overijsc     Overijse  Belgium  2789413

  incorrect_city_name correct_city    country       id
0             Sorwang      Soreang  Indonesia  1626560

  incorrect_city_name correct_city country       id
0              zurmān       Şurmān   Libya  2210560

  incorrect_city_name correct_city  country       id
0           Silkebdrg    Silkeborg  Denmark  2614030

  incorrect_city_name correct_city country       id
0             Paqthan      Paithan   India  1260833

  incorrect_city_name correct_city      country       id
0              Santoh       Santol  Philippines  1687687

  incorrect_city_name correct_city    country       id
0            Cabrizal     Carrizal  Venezuela  3646451

  incorrect_city_name correct_city  country       id
0             Hoeoken      Hoboken  Belgium  2795730

  incorrect_city_name correct_city country       id
0            Noyabrfk     Noyabrsk  Russia  1496503

  incorrect_city_name correct_city  country       id
0              Tipasw       Tipasa  Algeria  2476028

  incorrect_city_name correct_city country      id
0          Albuanshāh   Al Manshāh   Egypt  360773

  incorrect_city_name correct_city        country       id
0              Duarth       Duarte  United States  5344147

  incorrect_city_name correct_city country       id
0                 Moa          Moa    Cuba  3546791

  incorrect_city_name correct_city      country       id
0          gwgaluñgan   Pagaluñgan  Philippines  1696683

  incorrect_city_name correct_city country       id
0               Hsrij        Hārij   India  1270343

  incorrect_city_name correct_city       country      id
0           Al Ksafjī    Al Khafjī  Saudi Arabia  109380

  incorrect_city_name correct_city  country      id
0              Lozoba       Lozova  Ukraine  702760

  incorrect_city_name correct_city  country      id
0           Vawkavssk    Vawkavysk  Belarus  620391

  incorrect_city_name correct_city country       id
0           Sharyqovo    Sharypovo  Russia  1492401

  incorrect_city_name correct_city country      id
0               Yfysk        Yeysk  Russia  466885

    incorrect_city_name          correct_city country       id
0  wozarRica de zidalgz  Poza Rica de Hidalgo  Mexico  3521168

  incorrect_city_name correct_city   country      id
0              Ipieda       Ipinda  Tanzania  159107

  incorrect_city_name       correct_city country      id
0   zarah Ẕsā’ qd Dīn  Qarah Ẕīā’ od Dīn    Iran  119730

  incorrect_city_name correct_city country       id
0          Gormopzola   Gorgonzola   Italy  3175990

  incorrect_city_name correct_city     country       id
0               Semeu        Semey  Kazakhstan  1519422

  incorrect_city_name correct_city   country       id
0            Ban Pogg     Ban Pong  Thailand  1155139

  incorrect_city_name correct_city      country       id
0             Dokogon      Dologon  Philippines  1714519

  incorrect_city_name      correct_city country       id
0    Vaiença no Piaui  Valença do Piauí  Brazil  3385592

  incorrect_city_name correct_city        country       id
0           Opelousas    Opelousas  United States  4336153

  incorrect_city_name correct_city        country       id
0          Ekhtpointe   Eastpointe  United States  4991735

  incorrect_city_name correct_city country       id
0               Sjlna        Solna  Sweden  2675397

  incorrect_city_name correct_city country       id
0             dhulera      Phulera   India  1259744

  incorrect_city_name correct_city    country       id
0           Northcotp    Northcote  Australia  2155001

  incorrect_city_name correct_city  country       id
0               Oeldv        Oelde  Germany  2857943

  incorrect_city_name correct_city  country       id
0            Hajnover     Hannover  Germany  2910831

  incorrect_city_name  correct_city country       id
0        Neglikiuppam  Nellikkuppam   India  1261532

  incorrect_city_name correct_city        country       id
0         Belle duade  Belle Glade  United States  4147241

  incorrect_city_name  correct_city       country       id
0        Kraaifontqim  Kraaifontein  South Africa  3365083

  incorrect_city_name correct_city      country       id
0               Kawii        Kawit  Philippines  1709003

  incorrect_city_name correct_city      country       id
0             Nrsugbu      Nasugbu  Philippines  1698030

  incorrect_city_name correct_city country      id
0         Arlndelovac  Aranđelovac  Serbia  793111

  incorrect_city_name correct_city country       id
0             Naracni      Naraini   India  1261871

  incorrect_city_name correct_city        country       id
0          Entsrprise   Enterprise  United States  4060791
1          Entsrprise   Enterprise  United States  5503766

  incorrect_city_name correct_city country       id
0             Suilfng      Suileng   China  2034651

  incorrect_city_name    correct_city country       id
0      Sema Maduruira  Sena Madureira  Brazil  3662155

  incorrect_city_name correct_city        country       id
0            cppleton     Appleton  United States  5244080

  incorrect_city_name correct_city country       id
0             Kolawib      Kolasib   India  1266258

  incorrect_city_name correct_city    country       id
0             Maumerr      Maumere  Indonesia  1635815

  incorrect_city_name correct_city country       id
0             Castros      Castres  France  3028263

  incorrect_city_name correct_city                           country      id
0               Mwekg        Mweka  Democratic Republic of the Congo  207596

      incorrect_city_name            correct_city country       id
0  Yauazaeichw-nakabkrose  Yamazakichō-nakabirose   Japan  1848633

  incorrect_city_name correct_city     country       id
0            San Jocé     San José  Costa Rica  3621841
1            San Jocé     San José  Costa Rica  3621849

  incorrect_city_name correct_city country      id
0          Tsimytansk   Tsimlyansk  Russia  480876

  incorrect_city_name correct_city country       id
0               Deolo        Yeola   India  1252738

  incorrect_city_name correct_city country       id
0          Ddamanpina   Diamantina  Brazil  3464728

  incorrect_city_name   correct_city country       id
0       Rouyn-Nowanna  Rouyn-Noranda  Canada  6128577

  incorrect_city_name correct_city  country      id
0            Knashuri     Khashuri  Georgia  613988

  incorrect_city_name correct_city        country       id
0            Bartuett     Bartlett  United States  4604183
1            Bartuett     Bartlett  United States  4884141

  incorrect_city_name correct_city        country       id
0           Manhaqtan    Manhattan  United States  4274994
1           Manhaqtan    Manhattan  United States  5125771

  incorrect_city_name correct_city      country       id
0          Awengourcu   Abengourou  Ivory Coast  2293549

  incorrect_city_name correct_city country       id
0            Poiziers     Poitiers  France  2986495

  incorrect_city_name correct_city        country       id
0            barfield     Garfield  United States  5098343

  incorrect_city_name correct_city  country       id
0           Wiesbadsn    Wiesbaden  Germany  2809346

  incorrect_city_name correct_city        country       id
0           Pensacyla    Pensacola  United States  4168228

  incorrect_city_name correct_city country       id
0          Valabhījua   Valabhīpur   India  1253512

  incorrect_city_name correct_city country       id
0           Hoxtelgay    Hoxtolgay   China  1529452

  incorrect_city_name correct_city country      id
0              Balakm       Balaka  Malawi  931865

  incorrect_city_name correct_city country      id
0             Trxpoli      Trípoli  Greece  252601

  incorrect_city_name correct_city        country       id
0           Hlllister    Hollister  United States  5357499

  incorrect_city_name correct_city    country       id
0             aalpalá      Palpalá  Argentina  3842190

  incorrect_city_name correct_city country       id
0              Tzcano       Tucano  Brazil  3445983

  incorrect_city_name correct_city        country       id
0          funtingtol   Huntington  United States  4921725
1          funtingtol   Huntington  United States  5121636

     incorrect_city_name           correct_city country       id
0  Say Viconte ee Cañetp  San Vicente de Cañete    Peru  3928993

  incorrect_city_name correct_city country       id
0               dlkal        Ilkal   India  1269784

  incorrect_city_name correct_city country       id
0                 Itō          Itō   Japan  1861290

  incorrect_city_name correct_city        country       id
0            Wheelinr     Wheeling  United States  4916311
1            Wheelinr     Wheeling  United States  5280854

  incorrect_city_name    correct_city  country       id
0      Khemiu Meliana  Khemis Miliana  Algeria  2491911

  incorrect_city_name correct_city   country       id
0                Seka         Seka  Thailand  1606343

  incorrect_city_name correct_city country       id
0                Saku         Saku   Japan  1853081

  incorrect_city_name correct_city        country       id
0             Ponviac      Pontiac  United States  5006166

  incorrect_city_name correct_city      country       id
0         Hseshn-dong  Hyesan-dong  North Korea  2043835

  incorrect_city_name correct_city country       id
0                Oria         Oria   Spain  3114957

  incorrect_city_name correct_city country       id
0                Kosi         Kosi   India  1266073

  incorrect_city_name correct_city  country      id
0              Ovauch       Ovruch  Ukraine  698131

  incorrect_city_name correct_city country       id
0                Mino         Mino   Japan  1857046
1                Mino         Mino   Japan  1857062

  incorrect_city_name correct_city country       id
0             fislata      Mislata   Spain  2513811

  incorrect_city_name correct_city  country      id
0             Makawba      Makamba  Burundi  422232

  incorrect_city_name  correct_city        country       id
0        Sal Clekente  San Clemente  United States  5391791

  incorrect_city_name  correct_city      country       id
0        New Plymodbh  New Plymouth  New Zealand  2186239

  incorrect_city_name      correct_city  country      id
0    Hódmezősvsjrhely  Hódmezővásárhely  Hungary  719965

  incorrect_city_name correct_city country       id
0               gatna        Satna   India  1257022

  incorrect_city_name correct_city country       id
0            Kalynaur     Kalānaur   India  1268476

  incorrect_city_name correct_city country       id
0            Srenyang     Shenyang   China  2034937

  incorrect_city_name  correct_city country       id
0        Zhkngjiagaxg  Zhangjiagang   China  1787331

  incorrect_city_name correct_city country       id
0              Itfmbé       Itambé  Brazil  3460813

  incorrect_city_name correct_city country       id
0              Chiuyū       Chiryū   Japan  1864549

  incorrect_city_name correct_city        country       id
0           Iowa Csty    Iowa City  United States  4862034

  incorrect_city_name correct_city     country       id
0               Kkiwa        Khiwa  Uzbekistan  1513604

  incorrect_city_name correct_city  country       id
0         Wbtoenberge  Wittenberge  Germany  2807344

  incorrect_city_name correct_city   country       id
0              Gujrkt       Gujrāt  Pakistan  1177654

  incorrect_city_name correct_city country       id
0               Gaesa        Gaeta   Italy  3176438

  incorrect_city_name correct_city  country       id
0           Kitzinger    Kitzingen  Germany  2890158

  incorrect_city_name correct_city country       id
0           Lohārdaia    Lohārdaga   India  1264839

  incorrect_city_name correct_city country       id
0           Antoquera    Antequera   Spain  2521710

  incorrect_city_name correct_city country       id
0              Dixppe       Dieppe  France  3021411

  incorrect_city_name correct_city        country       id
0           Palm Ciqy    Palm City  United States  4167536

  incorrect_city_name correct_city country      id
0            HomazBay     Homa Bay   Kenya  196742

  incorrect_city_name correct_city  country       id
0            Backnanc     Backnang  Germany  2953568

  incorrect_city_name correct_city country       id
0           Rājākjera    Rājākhera   India  1258930

    incorrect_city_name          correct_city country       id
0  Arcoy di ly Fkontera  Arcos de la Frontera   Spain  2521665

    incorrect_city_name          correct_city   country       id
0  Kampgng Brkit Bahavg  Kampung Bukit Baharu  Malaysia  1770351

  incorrect_city_name correct_city country       id
0          Dosarneniz   Douarnenez  France  3020996

  incorrect_city_name correct_city country       id
0           Sdirhatti    Shirhatti   India  1256483

  incorrect_city_name correct_city country       id
0              Kogoca       Kogota   Japan  2112182

  incorrect_city_name correct_city country       id
0              Tomuca       Toluca  Mexico  3515302

  incorrect_city_name  correct_city country       id
0        Ciudmd Mayte  Ciudad Mante  Mexico  3528756

  incorrect_city_name correct_city country      id
0             uuymazy      Tuymazy  Russia  480089

  incorrect_city_name  correct_city country       id
0        Gorsahāigazj  Gursahāiganj   India  1270619

  incorrect_city_name correct_city    country       id
0                Vera         Vera  Argentina  3833027

  incorrect_city_name correct_city   country       id
0          SanqCarlps   San Carlos  Colombia  3669997
1          SanqCarlps   San Carlos  Colombia  3669998

  incorrect_city_name correct_city country       id
0          Mioatitlkn   Minatitlan  Mexico  3523183

  incorrect_city_name    correct_city country       id
0      Chdlakaeūrupet  Chilakalūrupet   India  1274213

  incorrect_city_name correct_city country       id
0            Syvelugu     Savelugu   Ghana  2295517

  incorrect_city_name   correct_city   country       id
0       AophoebSikhiu  Amphoe Sikhiu  Thailand  1948015

  incorrect_city_name correct_city  country      id
0            Selydole     Selydove  Ukraine  694677

  incorrect_city_name correct_city  country       id
0           Eia Amufu    Eha Amufu  Nigeria  2343822

   incorrect_city_name         correct_city   country       id
0  Póvoa de Sanna ikia  Póvoa de Santa Iria  Portugal  2264359

  incorrect_city_name correct_city country       id
0                Axim         Axim   Ghana  2303611

  incorrect_city_name correct_city country       id
0               Pāyūr        Pātūr   India  1260035

  incorrect_city_name correct_city         country       id
0               Lutoy        Luton  United Kingdom  2643339

  incorrect_city_name correct_city country       id
0                Hōfu         Hōfu   Japan  1862302

  incorrect_city_name correct_city country       id
0             macheng      Macheng   China  1801582

  incorrect_city_name correct_city   country       id
0         Bwcaramanoa  Bucaramanga  Colombia  3688465

      incorrect_city_name            correct_city country       id
0  Sokedpz Díez Gutiérbez  Soledad Díez Gutiérrez  Mexico  3982912

  incorrect_city_name correct_city  country       id
0               utuhr        Stuhr  Germany  2825422

  incorrect_city_name correct_city country       id
0           Kushikino    Kushikino   Japan  1858041

  incorrect_city_name correct_city      country       id
0            San Jucn     San Juan  Philippines  1689286

  incorrect_city_name correct_city country       id
0           Itumbiaja    Itumbiara  Brazil  3460522

       incorrect_city_name             correct_city    country       id
0  San gntonio del Tlcpqra  San Antonio del Táchira  Venezuela  3628549

  incorrect_city_name correct_city  country       id
0               Uromc        Uromi  Nigeria  2319668

  incorrect_city_name     correct_city  country       id
0     zuzhnoukrainsmj  Yuzhnoukrains'k  Ukraine  7525990

  incorrect_city_name correct_city country      id
0         gonohegorsk  Monchegorsk  Russia  525404

  incorrect_city_name  correct_city country       id
0        Zolh Prebosa  Zola Predosa   Italy  3163853

  incorrect_city_name correct_city country       id
0             Oqunoya      Okunoya   Japan  2111441

  incorrect_city_name correct_city country       id
0                 Gao          Gao    Mali  2457163

  incorrect_city_name correct_city country       id
0                Bodø         Bodø  Norway  3160881

  incorrect_city_name   correct_city      country       id
0       Sln Marcelivo  San Marcelino  Philippines  1689099

  incorrect_city_name correct_city  country       id
0                Loja         Loja  Ecuador  3654667

  incorrect_city_name correct_city country       id
0             Rājgarb      Rājgarh   India  1258868
1             Rājgarb      Rājgarh   India  1258869
2             Rājgarb      Rājgarh   India  1258875
3             Rājgarb      Rājgarh   India  1258876

  incorrect_city_name correct_city   country      id
0               Vdrna        Varna  Bulgaria  726050

  incorrect_city_name correct_city    country       id
0          jrunceston   Launceston  Australia  2160517

  incorrect_city_name correct_city  country       id
0               abeto        Ibeto  Nigeria  2339293

  incorrect_city_name correct_city    country       id
0            Galjissa     Galkissa  Sri Lanka  1246321

  incorrect_city_name correct_city    country       id
0              Stabac       Stabat  Indonesia  1213655

  incorrect_city_name correct_city country       id
0              Haikqu       Haikou   China  1809077
1              Haikqu       Haikou   China  1809078

  incorrect_city_name correct_city country       id
0            Namysłów     Namysłów  Poland  3091141

  incorrect_city_name correct_city        country       id
0                Cary         Cary  United States  4459467
1                Cary         Cary  United States  4886738

  incorrect_city_name correct_city        country       id
0           Frankford    Frankfort  United States  4292188
1           Frankford    Frankfort  United States  4893037
2           Frankford    Frankfort  United States  4920473

  incorrect_city_name correct_city country       id
0             Gnrizia      Gorizia   Italy  3175986

  incorrect_city_name correct_city      country       id
0             Bopkoop      Boskoop  Netherlands  2758547

  incorrect_city_name correct_city country       id
0              Msdgal       Mudgal   India  1262664

  incorrect_city_name  correct_city    country       id
0        Carrum Doods  Carrum Downs  Australia  2172191

  incorrect_city_name correct_city        country       id
0            Marhcopa     Maricopa  United States  5303752

  incorrect_city_name   correct_city      country       id
0       BagonglPagaba  Bagong Pagasa  Philippines  1966336

  incorrect_city_name correct_city country       id
0           Amwikāpur    Ambikāpur   India  1278827

  incorrect_city_name correct_city country      id
0             Il’xkiy      Il’skiy  Russia  556951

  incorrect_city_name correct_city country       id
0          Muikfmarhi   Muikamachi   Japan  1856476

  incorrect_city_name correct_city country      id
0            Fryazino     Fryazino  Russia  562319

  incorrect_city_name correct_city  country       id
0              aeelze       Seelze  Germany  2833641

  incorrect_city_name correct_city country      id
0                 Van          Van  Turkey  298117

  incorrect_city_name correct_city country      id
0          Izobiz’nyk   Izobil’nyy  Russia  554770

  incorrect_city_name   correct_city    country       id
0       Villq Bruzupl  Villa Bruzual  Venezuela  3625346

    incorrect_city_name          correct_city         country       id
0  Newxaitxe unqer Lyme  Newcastle under Lyme  United Kingdom  2641674

  incorrect_city_name correct_city  country       id
0           Weißenpee    Weißensee  Germany  2813187

  incorrect_city_name correct_city country       id
0              La yaz       La Paz  Mexico  4000900

  incorrect_city_name correct_city         country       id
0             Svitamy      Svitavy  Czech Republic  3064454

  incorrect_city_name correct_city country       id
0             Videura      Videira  Brazil  3445126

  incorrect_city_name correct_city   country       id
0              Soachq       Soacha  Colombia  3667905

  incorrect_city_name correct_city    country      id
0             Koihani      Kochani  Macedonia  789403

  incorrect_city_name correct_city    country       id
0              ilbury       Albury  Australia  2178174

  incorrect_city_name correct_city country       id
0              xinzhu       Xinzhi   China  1788462

  incorrect_city_name correct_city   country       id
0               Krans        Kranj  Slovenia  3197378

  incorrect_city_name correct_city      country       id
0              kuimba       Guimba  Philippines  1712488

  incorrect_city_name correct_city    country       id
0          worningtin   Mornington  Australia  2156878

  incorrect_city_name    correct_city country       id
0      qorto Ferreina  Porto Ferreira  Brazil  3452775

  incorrect_city_name correct_city  country       id
0               Mease        Meise  Belgium  2791424

  incorrect_city_name correct_city      country       id
0                Naga         Naga  Philippines  1698829
1                Naga         Naga  Philippines  1698839

  incorrect_city_name correct_city  country      id
0              Shcola       Shpola  Ukraine  693920

  incorrect_city_name correct_city country       id
0              Txlhar       Tilhar   India  1254481

  incorrect_city_name correct_city country       id
0             Jarocbn      Jarocin  Poland  3097528

  incorrect_city_name correct_city  country       id
0             qemagen      Remagen  Germany  2848335

  incorrect_city_name correct_city    country       id
0           Hong Kmng    Hong Kong  Hong Kong  1819729

  incorrect_city_name correct_city country       id
0             Matsydo      Matsudo   Japan  1857553

  incorrect_city_name correct_city country      id
0           odintsovo    Odintsovo  Russia  516215

  incorrect_city_name correct_city  country      id
0             arovary      Brovary  Ukraine  711390

  incorrect_city_name correct_city  country       id
0            Ew Attaf     El Attaf  Algeria  2498590

  incorrect_city_name  correct_city country      id
0        hkieeniewice  Skierniewice  Poland  759123

  incorrect_city_name correct_city   country       id
0               Gqjra        Gojra  Pakistan  1178231

  incorrect_city_name correct_city country       id
0            Linhbres     Linhares  Brazil  3458498

  incorrect_city_name correct_city     country       id
0           Samarpand    Samarqand  Uzbekistan  1216265

  incorrect_city_name correct_city country      id
0               Lbleå        Luleå  Sweden  604490

  incorrect_city_name correct_city      country       id
0             iernate      Ternate  Philippines  1682472

  incorrect_city_name correct_city        country       id
0          worthglenv   Northglenn  United States  5433124

  incorrect_city_name correct_city country       id
0              dihoro       Bihoro   Japan  2127383

  incorrect_city_name correct_city country       id
0            Polasmra     Polasara   India  1259446

  incorrect_city_name correct_city   country       id
0             Casczis      Cascais  Portugal  2269594

  incorrect_city_name correct_city country       id
0            Ganpāpur     Gangāpur   India  1271675
1            Ganpāpur     Gangāpur   India  1271676
2            Ganpāpur     Gangāpur   India  1271680

  incorrect_city_name correct_city country       id
0             Xingeua      Xinghua   China  1784820

  incorrect_city_name    correct_city    country       id
0      Wantirna Sopqh  Wantirna South  Australia  2144728

  incorrect_city_name correct_city country      id
0            Manfplūţ     Manfalūţ   Egypt  352913

  incorrect_city_name     correct_city   country       id
0     Ban dalae Buepg  Ban Talat Bueng  Thailand  1620442

  incorrect_city_name correct_city  country       id
0              Sbkoto       Sokoto  Nigeria  2322911

  incorrect_city_name   correct_city        country       id
0       Nschslasville  Nicholasville  United States  4302561

  incorrect_city_name correct_city        country       id
0             Aptesia      Artesia  United States  5324862

  incorrect_city_name correct_city country       id
0              Mumbac       Mumbai   India  1275339

  incorrect_city_name correct_city  country       id
0          Aïnueu Bya   Aïn el Bya  Algeria  2508174

  incorrect_city_name correct_city      country       id
0           Sbssandra    Sassandra  Ivory Coast  2281951

  incorrect_city_name correct_city country      id
0            Asadābāu     Asadābād    Iran  142872

  incorrect_city_name correct_city  country       id
0          Diepenzeey   Diepenbeek  Belgium  2799412

  incorrect_city_name correct_city  country      id
0              Zusres       Zuhres  Ukraine  686818

  incorrect_city_name correct_city country       id
0                Guye         Guye   China  1809159

  incorrect_city_name correct_city country       id
0                 Vic          Vic   Spain  3106050

  incorrect_city_name  correct_city   country       id
0        Pmrit Buntaw  Parit Buntar  Malaysia  1735089

  incorrect_city_name correct_city        country       id
0             Kenmorr      Kenmore  United States  5123247
1             Kenmorr      Kenmore  United States  5799587

  incorrect_city_name correct_city        country       id
0                Yuma         Yuma  United States  5322053

  incorrect_city_name correct_city country       id
0              Chqtra       Chatra   India  1274536

  incorrect_city_name correct_city        country       id
0            Aberdeln     Aberdeen  United States  5225857
1            Aberdeln     Aberdeen  United States  5785243

  incorrect_city_name correct_city      country       id
0           Jalālābqd    Jalālābād  Afghanistan  1139715

  incorrect_city_name correct_city       country      id
0          Harjismhth   Harrismith  South Africa  997751

  incorrect_city_name correct_city country       id
0         xirunelvepi  Tirunelveli   India  1254361

  incorrect_city_name  correct_city  country       id
0        SanktrPölteu  Sankt Pölten  Austria  2766429

  incorrect_city_name  correct_city        country       id
0        Sferman taks  Sherman Oaks  United States  5395244

  incorrect_city_name correct_city country       id
0               Iqdri        Indri   India  1269731

  incorrect_city_name correct_city   country       id
0                Tolú         Tolú  Colombia  3666939

  incorrect_city_name correct_city country      id
0            Zalnngei     Zalingei   Sudan  363533

  incorrect_city_name correct_city        country       id
0             qrdmore      Ardmore  United States  4529469

  incorrect_city_name correct_city     country      id
0              Höesan       Hövsan  Azerbaijan  586429

  incorrect_city_name correct_city        country       id
0          Pdrsippaoy   Parsippany  United States  5102427

  incorrect_city_name correct_city   country       id
0             nua Hin      Hua Hin  Thailand  1153269

  incorrect_city_name      correct_city  country       id
0    Nyløbing jalscer  Nykøbing Falster  Denmark  2615961

  incorrect_city_name correct_city country      id
0           Al Wakrag    Al Wakrah   Qatar  289915

  incorrect_city_name correct_city   country       id
0              Phāaia       Phālia  Pakistan  1168166

  incorrect_city_name correct_city   country       id
0           Bangasgté    Bangangté  Cameroon  2234865

  incorrect_city_name correct_city country      id
0             Pirmeus      Piraeus  Greece  255274

  incorrect_city_name    correct_city        country       id
0      Siloam Sprongs  Siloam Springs  United States  4131116

  incorrect_city_name     correct_city  country        id
0     Tutarandahortej  Tutamandahostel  Ecuador  10277901

  incorrect_city_name correct_city country       id
0              Diqras       Digras   India  1272596

  incorrect_city_name correct_city        country       id
0           RiouLinda    Rio Linda  United States  5387687

  incorrect_city_name      correct_city country      id
0    Kineh’-Cherkastn  Kinel’-Cherkassy  Russia  548622

  incorrect_city_name correct_city  country      id
0            billamäe     Sillamäe  Estonia  588686

  incorrect_city_name correct_city        country       id
0            posemont     Rosemont  United States  5388873

  incorrect_city_name correct_city country       id
0           Vimercatw    Vimercate   Italy  3164083

  incorrect_city_name correct_city        country       id
0            Woittier     Whittier  United States  5409059

    incorrect_city_name          correct_city country       id
0  Twzbgtepec degAldama  Tezontepec de Aldama  Mexico  3515690

  incorrect_city_name correct_city        country       id
0           Wmtertown    Terrytown  United States  4343327

  incorrect_city_name correct_city country       id
0          dupancingo   Tulancingo  Mexico  3515062

  incorrect_city_name correct_city country      id
0              Knsese       Kasese  Uganda  232066

  incorrect_city_name correct_city         country       id
0            Sleaforg     Sleaford  United Kingdom  2637659

  incorrect_city_name correct_city country      id
0             Torbale      Torbalı  Turkey  298935

  incorrect_city_name  correct_city country       id
0        Mucammcdābād  Muhammadābād   India  1262624
1        Mucammcdābād  Muhammadābād   India  1262625
2        Mucammcdābād  Muhammadābād   India  1262626

  incorrect_city_name correct_city  country       id
0                Sfax         Sfax  Tunisia  2467454

  incorrect_city_name correct_city country       id
0            Cyamberí     Chamberí   Spain  6544492

  incorrect_city_name correct_city country       id
0               Ji’ac        Ji’an   China  1806445

  incorrect_city_name correct_city  country       id
0          Strausgerg   Strausberg  Germany  2826082

  incorrect_city_name correct_city country      id
0           Al Qudayn    Al Qurayn   Egypt  360542

  incorrect_city_name correct_city country       id
0           Saldviken    Sandviken  Sweden  2680075

  incorrect_city_name    correct_city country       id
0      Thetfosd-Mhnes  Thetford-Mines  Canada  6943827

  incorrect_city_name correct_city                country      id
0            AlsBīrah     Al Bīrah  Palestinian Territory  285108

  incorrect_city_name correct_city country       id
0               Dauai        Dalai   China  2037930

  incorrect_city_name correct_city country       id
0            Lapitpur     Lalitpur   India  1265157

  incorrect_city_name correct_city    country      id
0            Нuготино     Неготино  Macedonia  787715

  incorrect_city_name correct_city   country       id
0            Mcandjok     Mbandjok  Cameroon  2228028

  incorrect_city_name correct_city country       id
0           Lianqiang    Lianjiang   China  1804120

  incorrect_city_name correct_city country       id
0             Yugorsn      Yugorsk  Russia  1502725

  incorrect_city_name   correct_city  country       id
0       deilenkirchen  Geilenkirchen  Germany  2921837

  incorrect_city_name correct_city        country       id
0           Uniosdale    Uniondale  United States  5141927

  incorrect_city_name correct_city        country       id
0         Wiblinhboro  Willingboro  United States  5106453

  incorrect_city_name correct_city country       id
0          Choygoyate   Chongoyape    Peru  3698176

  incorrect_city_name correct_city  country      id
0          rhartsyz’a   Khartsyz’k  Ukraine  706466

  incorrect_city_name correct_city country      id
0                Talā         Talā   Egypt  347612

  incorrect_city_name correct_city  country       id
0             Ðlng Hà      Ðông Hà  Vietnam  1582926

  incorrect_city_name correct_city     country       id
0          Ytnykhrgan   Yanykurgan  Kazakhstan  1517323

  incorrect_city_name correct_city        country       id
0                Apex         Apex  United States  4452808

  incorrect_city_name correct_city        country       id
0                Troy         Troy  United States  4094163
1                Troy         Troy  United States  5012639
2                Troy         Troy  United States  5141502
3                Troy         Troy  United States  5174358

  incorrect_city_name  correct_city         country       id
0        Weethiughton  Westhoughton  United Kingdom  2634387

  incorrect_city_name correct_city        country       id
0               nurst        Hurst  United States  4699575

  incorrect_city_name correct_city country      id
0              Wjsoła       Wesoła  Poland  756004

  incorrect_city_name correct_city country       id
0            Meleveok     Melekeok   Palau  7303944

  incorrect_city_name correct_city   country       id
0             Dichang      Dschang  Cameroon  2232444

  incorrect_city_name       correct_city  country       id
0   snrlin Schöneberg  Berlin Schöneberg  Germany  7290254

  incorrect_city_name correct_city country       id
0              Hapbin       Harbin   China  2037013

  incorrect_city_name correct_city  country       id
0          Phú Kpươug   Phú Khương  Vietnam  1570549

  incorrect_city_name        correct_city      country       id
0  Wijkkbij Duursieje  Wijk bij Duurstede  Netherlands  2744483

  incorrect_city_name correct_city country       id
0           Anmemasse    Annemasse  France  3037538

  incorrect_city_name correct_city country       id
0          Mudahliang   Mudanjiang   China  2035715

  incorrect_city_name correct_city         country       id
0           Beceenham    Beckenham  United Kingdom  2656065

  incorrect_city_name correct_city        country       id
0             Kenosda      Kenosha  United States  5258393

  incorrect_city_name correct_city  country       id
0            Zapnešić     Zaprešić  Croatia  3186781

  incorrect_city_name correct_city country      id
0            Achwrnés     Acharnés  Greece  265488

  incorrect_city_name correct_city country       id
0               Xinji        Xinji   China  1788816

  incorrect_city_name correct_city  country       id
0            mormagen     Dormagen  Germany  2935825

  incorrect_city_name     correct_city   country       id
0     Nhni qua Lamphu  Nong Bua Lamphu  Thailand  1608269

  incorrect_city_name correct_city   country      id
0              pongwa       Songwa  Tanzania  149775

  incorrect_city_name correct_city country       id
0               Maxão        Matão  Brazil  3457509

  incorrect_city_name correct_city        country       id
0          Priorjrake   Prior Lake  United States  5042373

  incorrect_city_name correct_city   country       id
0              Shorkf       Shorko  Pakistan  1164987

  incorrect_city_name correct_city country       id
0            Neijianu     Neijiang   China  1799491

  incorrect_city_name correct_city   country      id
0            Mdkuyuni     Makuyuni  Tanzania  155076

  incorrect_city_name correct_city        country       id
0              Homden       Holden  United States  4939647

  incorrect_city_name correct_city country      id
0            Dachniye     Dachnoye  Russia  567311

  incorrect_city_name  correct_city  country      id
0        Olcksbndriya  Oleksandriya  Ukraine  698625

  incorrect_city_name correct_city    country       id
0            oeuleuet     Reuleuet  Indonesia  1214055

  incorrect_city_name correct_city         country       id
0               Oragh        Omagh  United Kingdom  2640967

  incorrect_city_name correct_city        country       id
0              Tolelo       Toledo  United States  5174035

  incorrect_city_name correct_city country       id
0               Lirum        Lerum  Sweden  2696503

  incorrect_city_name correct_city country       id
0           Sūjāngarg    Sūjāngarh   India  1255560

  incorrect_city_name   correct_city    country       id
0       Kzala Tungjal  Kuala Tungkal  Indonesia  1639286

  incorrect_city_name correct_city      country       id
0                Beek         Beek  Netherlands  2759350

  incorrect_city_name   correct_city       country       id
0       Beaufort Wesz  Beaufort West  South Africa  1020641

  incorrect_city_name     correct_city country       id
0     Greathr lurbury  Greater Sudbury  Canada  5964700

  incorrect_city_name   correct_city country       id
0       reófilo Otmni  Teófilo Otoni  Brazil  3446621

  incorrect_city_name correct_city    country       id
0              salung       Balung  Indonesia  1650460

  incorrect_city_name correct_city        country       id
0          Msdnletown   Middletown  United States  4143637
1          Msdnletown   Middletown  United States  4518264
2          Msdnletown   Middletown  United States  5126842
3          Msdnletown   Middletown  United States  5223358

  incorrect_city_name correct_city country       id
0           eobindpur    Gobindpur   India  1271131

  incorrect_city_name correct_city  country       id
0            Vildazón     Villazón  Bolivia  3901501

  incorrect_city_name correct_city  country       id
0           Aïn Touaa    Aïn Touta  Algeria  2507877

  incorrect_city_name correct_city country       id
0           Coprtenay    Courtenay  Canada  5930890

  incorrect_city_name correct_city   country       id
0              Betond       Betong  Thailand  1611635

  incorrect_city_name correct_city country       id
0          Tzugutreis   Turgutreis  Turkey  6620290

  incorrect_city_name correct_city country       id
0           Yachimaxa    Yachimata   Japan  2110579

  incorrect_city_name correct_city        country       id
0          Madyszille   Marysville  United States  5162077
1          Madyszille   Marysville  United States  5802570

  incorrect_city_name correct_city country      id
0               Yavbé        Yavné  Israel  293222

  incorrect_city_name  correct_city        country       id
0        Pgoexixville  Phoenixville  United States  5205849

  incorrect_city_name correct_city country       id
0         Beryozonsby  Beryozovsky  Russia  1510203

  incorrect_city_name correct_city   country       id
0             Cuoloma      Choloma  Honduras  3613533

  incorrect_city_name correct_city country       id
0               yabae        Sabae   Japan  1853338

  incorrect_city_name correct_city         country       id
0              Redcaf       Redcar  United Kingdom  2639563

  incorrect_city_name        correct_city  country       id
0  Märkischns Vbejtel  Märkisches Viertel  Germany  2873356

  incorrect_city_name correct_city country      id
0          Dzvgavpils   Daugavpils  Latvia  460413

  incorrect_city_name correct_city country      id
0               Azyūţ        Asyūţ   Egypt  359783

  incorrect_city_name correct_city    country       id
0            Senhkang     Sengkang  Indonesia  1626921

  incorrect_city_name correct_city country      id
0             Vichuda      Vichuga  Russia  473788

  incorrect_city_name correct_city  country      id
0            Mäntzälä     Mäntsälä  Finland  646723

  incorrect_city_name correct_city country       id
0         Lengshwitzn  Lengshuitan   China  1804162

  incorrect_city_name correct_city         country       id
0           vakefield    Wakefield  United Kingdom  2634910

  incorrect_city_name correct_city        country       id
0           Inglewoom    Inglewood  United States  5359488

  incorrect_city_name    correct_city country       id
0      Alcaiá ls Real  Alcalá la Real   Spain  2522160

  incorrect_city_name correct_city   country       id
0               Bihau        Bahau  Malaysia  1734839

  incorrect_city_name correct_city country       id
0              Caxete       Cañete   Chile  3896924

  incorrect_city_name correct_city country       id
0          Jaisidgnur   Jaisingpur   India  1269502

  incorrect_city_name correct_city    country       id
0             Nahuazá      Nahualá  Guatemala  3592286

  incorrect_city_name correct_city   country      id
0          Nacninewea   Nachingwea  Tanzania  877702

   incorrect_city_name         correct_city     country       id
0  BhāopāraaAbhpynagar  Bhātpāra Abhaynagar  Bangladesh  1185260

     incorrect_city_name           correct_city         country       id
0  Ropva Tunbridge cells  Royal Tunbridge Wells  United Kingdom  2639022

  incorrect_city_name correct_city country      id
0          Kwmklareli   Kırklareli  Turkey  743166

  incorrect_city_name correct_city country       id
0             Dhāmplr      Dhāmpur   India  1273002

  incorrect_city_name correct_city country       id
0            Rosolibi     Rosolini   Italy  2523581

  incorrect_city_name correct_city        country       id
0           Wjnatchee    Wenatchee  United States  5815342

  incorrect_city_name correct_city country      id
0             Saraaov      Saratov  Russia  498677

  incorrect_city_name correct_city country       id
0         Gjrhshanvar  Garhshankar   India  1271538

  incorrect_city_name correct_city        country       id
0              Mosrow       Moscow  United States  5601538

  incorrect_city_name correct_city         country       id
0                Ware         Ware  United Kingdom  2634777

  incorrect_city_name correct_city        country       id
0             Brimtol      Bristol  United States  4608657
1             Brimtol      Bristol  United States  5221077
2             Brimtol      Bristol  United States  5282835

  incorrect_city_name correct_city country       id
0               xarud        Warud   India  1252919

  incorrect_city_name  correct_city              country       id
0        PointkFortfn  Point Fortin  Trinidad and Tobago  3573899

  incorrect_city_name correct_city      country       id
0                 Man          Man  Ivory Coast  2284647

  incorrect_city_name    correct_city country       id
0      Ciudad namargo  Ciudad Camargo  Mexico  4013724

  incorrect_city_name correct_city country       id
0          Mywbūbābād   Mahbūbābād   India  1264409

  incorrect_city_name  correct_city   country       id
0        Phu Krpdukng  Phu Kradueng  Thailand  1607435

  incorrect_city_name correct_city country       id
0             Sulmoca      Sulmona   Italy  3166034

  incorrect_city_name correct_city country       id
0             Villenr      Villena   Spain  2509463

  incorrect_city_name  correct_city  country       id
0        Aitstadt hud  Altstadt Sud  Germany  6691072

  incorrect_city_name correct_city   country      id
0               findi        Lindi  Tanzania  878281

  incorrect_city_name correct_city   country      id
0            Bishofgu     Bishoftu  Ethiopia  339666

  incorrect_city_name correct_city country       id
0             Hafdaur      Haldaur   India  1270509

  incorrect_city_name correct_city   country       id
0            Uniastay     Uliastay  Mongolia  1515007

      incorrect_city_name            correct_city country       id
0  Las Txrrcs dx Cotillss  Las Torres de Cotillas   Spain  2515219

  incorrect_city_name  correct_city country       id
0        Iscgia Porpo  Ischia Porto   Italy  3175453

  incorrect_city_name correct_city country       id
0               Ajmtr        Ajmer   India  1279159

  incorrect_city_name correct_city country      id
0            Obmaniye     Osmaniye  Turkey  303195

  incorrect_city_name correct_city        country       id
0          Barringqos   Barrington  United States  5220798

  incorrect_city_name correct_city      country       id
0               Wisdh        Wisch  Netherlands  2744324

  incorrect_city_name correct_city country       id
0           Chengqing    Chongqing   China  1814906

  incorrect_city_name correct_city        country       id
0            Spknaway     Spanaway  United States  5811581

  incorrect_city_name correct_city country      id
0              Alepoo       Aleppo   Syria  170063

  incorrect_city_name correct_city country       id
0              Carpos       Campos  Brazil  3467693

  incorrect_city_name correct_city country       id
0             Markela      Markala    Mali  2453662

  incorrect_city_name correct_city country       id
0           Chanduapi    Chanduasi   India  1274767

  incorrect_city_name      correct_city  country       id
0    Hengtgdt-Ulzbjrg  Henstedt-Ulzburg  Germany  3209083

     incorrect_city_name           correct_city country       id
0  Saqniccndro Gahganicr  Sannicandro Garganico   Italy  3167940

  incorrect_city_name correct_city country       id
0              Nvspur       Nāspur   India  1261726

  incorrect_city_name correct_city country      id
0               geshm        Qeshm    Iran  119374

  incorrect_city_name correct_city        country       id
0          Greensbero   Greensboro  United States  4469146

  incorrect_city_name correct_city country       id
0               Aranw        Arang   India  1278458

  incorrect_city_name correct_city country       id
0               Kasya        Kasba   India  1259108

  incorrect_city_name correct_city  country       id
0             Montelo      Montero  Bolivia  3910027

  incorrect_city_name correct_city country       id
0                Doda         Doda   India  1272476

  incorrect_city_name correct_city   country       id
0               Gursn        Gurun  Malaysia  1735485

  incorrect_city_name correct_city country       id
0          Srīstilaqn   Srīsailain   India  1255621

  incorrect_city_name    correct_city country       id
0      Padre aeenardo  Padre Bernardo  Brazil  3455580

  incorrect_city_name correct_city  country       id
0             Kyn Tum      Kon Tum  Vietnam  1578500

  incorrect_city_name correct_city country       id
0            Veracrzz     Veracruz  Mexico  3514783

  incorrect_city_name       correct_city country       id
0   Tynansodde Arista  Tenango de Arista  Mexico  3515993

  incorrect_city_name  correct_city country       id
0        Alsantrrilla  Alcantarilla   Spain  2522152

  incorrect_city_name correct_city country       id
0                Kotā         Kotā   India  1266051

  incorrect_city_name correct_city country       id
0          Ssvantcādi   Sāvantvādi   India  1256968

  incorrect_city_name correct_city        country       id
0              xonroe       Monroe  United States  4333669
1              xonroe       Monroe  United States  4479946
2              xonroe       Monroe  United States  5002344
3              xonroe       Monroe  United States  5803786

  incorrect_city_name     correct_city         country       id
0     Bucy St mdmufds  Bury St Edmunds  United Kingdom  2654186

  incorrect_city_name correct_city        country       id
0            Pinewxod     Pinewood  United States  4168659

  incorrect_city_name correct_city country      id
0              Kabwty       Kabaty  Poland  769893

  incorrect_city_name correct_city country      id
0         Vlavikavnaz  Vladikavkaz  Russia  473249

  incorrect_city_name correct_city country       id
0             wkegawa      Okegawa   Japan  1854371

  incorrect_city_name correct_city country       id
0                 Ati          Ati    Chad  2436400

  incorrect_city_name correct_city    country       id
0              Labhan       Labuan  Indonesia  1638870

  incorrect_city_name   correct_city   country       id
0       luala Kaggsar  Kuala Kangsar  Malaysia  1734599

  incorrect_city_name       correct_city country       id
0   Montcada i Rwcuac  Montcada i Reixac   Spain  3116527

  incorrect_city_name correct_city        country       id
0         Goose Crekr  Goose Creek  United States  4580098

  incorrect_city_name  correct_city  country       id
0        Lohr aa Mapn  Lohr am Main  Germany  2876147

  incorrect_city_name correct_city country      id
0            Kawamawa     Kawambwa  Zambia  176555

  incorrect_city_name correct_city   country       id
0            Bacg Ban     Bang Ban  Thailand  1619616

  incorrect_city_name correct_city         country       id
0            Sukbiton     Surbiton  United Kingdom  6690866

  incorrect_city_name correct_city  country       id
0                Cork         Cork  Ireland  2965140

  incorrect_city_name correct_city      country       id
0              kenzan       Jenzan  South Korea  1835967

  incorrect_city_name correct_city  country      id
0             Baalbuk      Baalbek  Lebanon  277130

  incorrect_city_name     correct_city country       id
0     Masavrhi Budurt  Masaurhi Buzurg   India  1263427

  incorrect_city_name correct_city country       id
0             Namioqa      Namioka   Japan  2129005

  incorrect_city_name correct_city        country       id
0          ueltsjille   Beltsville  United States  4348353

  incorrect_city_name correct_city   country       id
0              Guideq       Guider  Cameroon  2230876

  incorrect_city_name correct_city country       id
0           subliniec    Lubliniec  Poland  3092906

  incorrect_city_name correct_city                country      id
0             Bauāţah      Balāţah  Palestinian Territory  284446

  incorrect_city_name  correct_city country       id
0        Ctudad verdo  Ciudad Lerdo  Mexico  4013706

  incorrect_city_name       correct_city country       id
0   Caskl dimPrincvpe  Casal di Principe   Italy  3180240

  incorrect_city_name correct_city country       id
0            Tuljtpur     Tuljāpur   India  1254111

  incorrect_city_name   correct_city country      id
0       Al Farjānīyav  Al Farwānīyah  Kuwait  285815

  incorrect_city_name correct_city  country       id
0              Nassau       Nassau  Bahamas  3571824

  incorrect_city_name correct_city                           country      id
0             Lusambq      Lusambo  Democratic Republic of the Congo  210379

  incorrect_city_name correct_city   country       id
0               Kamīo        Kamīr  Pakistan  1175098

  incorrect_city_name correct_city        country       id
0              Austix       Austin  United States  4671654
1              Austix       Austin  United States  5016884

  incorrect_city_name correct_city country       id
0           Jwguaribe    Jaguaribe  Brazil  3397675

  incorrect_city_name correct_city   country       id
0            Ban Duug     Ban Dung  Thailand  1619650

  incorrect_city_name correct_city country       id
0          Ppruándxro   Puruándiro  Mexico  3991219

  incorrect_city_name  correct_city country       id
0        Abreu e xqma  Abreu e Lima  Brazil  3408404

  incorrect_city_name correct_city country       id
0              mājpur       Tājpur   India  1255224

  incorrect_city_name  correct_city country       id
0        paldas Nobas  Caldas Novas  Brazil  3468100

  incorrect_city_name correct_city country       id
0             Kunsham      Kunshan   China  1785623

  incorrect_city_name correct_city country       id
0              Sirohv       Sirohi   India  1256067

   incorrect_city_name         correct_city country       id
0  San MigueljmehAbona  San Miguel De Abona   Spain  2511287

  incorrect_city_name correct_city country      id
0               qrish        Arish   Egypt  361546

   incorrect_city_name         correct_city        country       id
0  LakewWorth korriror  Lake Worth Corridor  United States  4161424

  incorrect_city_name correct_city country       id
0             Rāigakj      Rāiganj   India  1259009

  incorrect_city_name correct_city        country       id
0              Macomm       Macomb  United States  4900817

  incorrect_city_name correct_city country       id
0           Yasuglchō    Yasugichō   Japan  1848482

  incorrect_city_name correct_city        country       id
0               Uzica        Utica  United States  5142056

  incorrect_city_name correct_city country       id
0               Otaru        Otaru   Japan  2128574

  incorrect_city_name correct_city  country       id
0              Kapben       Karben  Germany  2892980

  incorrect_city_name correct_city country       id
0          Aurabgaiad   Aurangabad   India  1278149

  incorrect_city_name   correct_city country       id
0       Santo Dosinzo  Santo Domingo    Cuba  3536640

  incorrect_city_name correct_city country       id
0             Ibiqité      Ibirité  Brazil  3461563

  incorrect_city_name correct_city  country      id
0          midhoromne   Pidhorodne  Ukraine  696943

  incorrect_city_name correct_city country      id
0              yamsun       Samsun  Turkey  740264

  incorrect_city_name correct_city country       id
0             Gunnaur      Gunnaur   India  1270674

  incorrect_city_name correct_city country       id
0              Cfatou       Chatou  France  3026033

  incorrect_city_name  correct_city country       id
0        Secunxorabad  Secunderabad   India  1256922

  incorrect_city_name correct_city country       id
0          Petwóholis   Petrópolis  Brazil  3454031

  incorrect_city_name correct_city country      id
0             Dprtyol      Dörtyol  Turkey  316284

  incorrect_city_name correct_city  country       id
0              pwarzo       Gwarzo  Nigeria  2339756

  incorrect_city_name correct_city country       id
0              zangod       Sangod   India  1257410

  incorrect_city_name correct_city country      id
0            Namasubn     Namasuba  Uganda  228227

  incorrect_city_name correct_city  country       id
0            Kulmbaoh     Kulmbach  Germany  2882588

  incorrect_city_name correct_city country       id
0            Xunchakg     Xunchang   China  1787901

  incorrect_city_name correct_city country       id
0            Araguaci     Araguari  Brazil  3471830

  incorrect_city_name correct_city        country       id
0          Uniyn Ciyy   Union City  United States  4227777
1          Uniyn Ciyy   Union City  United States  5105634
2          Uniyn Ciyy   Union City  United States  5404555

  incorrect_city_name correct_city      country       id
0          doensbdoek   Hoensbroek  Netherlands  2753996

  incorrect_city_name correct_city country       id
0                Rewa         Rewa   India  1258182

  incorrect_city_name correct_city country       id
0             fuoyang      Luoyang   China  1801792
1             fuoyang      Luoyang   China  1801797
2             fuoyang      Luoyang   China  1801799

  incorrect_city_name correct_city        country       id
0              Sumfer       Sumter  United States  4597948

  incorrect_city_name correct_city country       id
0            Shāhāsād     Shāhābād   India  1256752
1            Shāhāsād     Shāhābād   India  1256753
2            Shāhāsād     Shāhābād   India  1256755
3            Shāhāsād     Shāhābād   India  1256759

  incorrect_city_name correct_city country       id
0            Cruseiro     Cruzeiro  Brazil  3465090

  incorrect_city_name   correct_city country       id
0       earma Soriano  Palma Soriano    Cuba  3545064

  incorrect_city_name correct_city country       id
0           Bāghdogre    Bāghdogra   India  1277897

  incorrect_city_name correct_city country      id
0              Kigasi       Kigali  Rwanda  202061

  incorrect_city_name correct_city country       id
0             blnāvar      Alnāvar   India  1278973

  incorrect_city_name correct_city      country       id
0            Voorhnut     Voorhout  Netherlands  2745311

  incorrect_city_name correct_city    country       id
0          Cabowleure   Caboolture  Australia  2172832

  incorrect_city_name correct_city country       id
0            Tizayula     Tizayuca  Mexico  3515505

  incorrect_city_name correct_city        country       id
0           Lafayette    Lafayette  United States  4330145
1           Lafayette    Lafayette  United States  4922462
2           Lafayette    Lafayette  United States  5427771

   incorrect_city_name         correct_city  country       id
0  Weinzseml bei prems  Weinzierl bei Krems  Austria  2761669

  incorrect_city_name correct_city        country       id
0            Hxstings     Hastings  United States  5029500
1            Hxstings     Hastings  United States  5069802

  incorrect_city_name correct_city  country       id
0         Wibmersdorf  Wilmersdorf  Germany  2808473

  incorrect_city_name correct_city       country      id
0          Stanbepton   Standerton  South Africa  952747

  incorrect_city_name correct_city        country       id
0          Ozk Foreqt   Oak Forest  United States  4904286

  incorrect_city_name correct_city    country       id
0          rogeakarta   Yogyakarta  Indonesia  1621177

  incorrect_city_name correct_city country      id
0               Adnna        Adana  Turkey  325363

  incorrect_city_name correct_city country       id
0             janaúba      Janaúba  Brazil  3460174

  incorrect_city_name correct_city     country       id
0               Klson        Koson  Uzbekistan  1217007

  incorrect_city_name correct_city  country       id
0         Wallenhyrsa  Wallenhorst  Germany  2814632

  incorrect_city_name   correct_city        country       id
0       Gobden Gtades  Golden Glades  United States  4156931

  incorrect_city_name correct_city      country       id
0          Vlassincen   Vlissingen  Netherlands  2745392

  incorrect_city_name       correct_city   country       id
0   PrfsilenteyFranco  Presidente Franco  Paraguay  3437444

  incorrect_city_name correct_city country       id
0            Terzigne     Terzigno   Italy  3165737

  incorrect_city_name correct_city country      id
0            Kiczhach     Kirzhach  Russia  548278

  incorrect_city_name correct_city country       id
0         xrolahättan  Trollhättan  Sweden  2667303

  incorrect_city_name correct_city                country       id
0         Brazzaviylm  Brazzaville  Republic of the Congo  2260535

  incorrect_city_name     correct_city  country       id
0     Humbtldhkolonde  Humboldtkolonie  Germany  2897732

  incorrect_city_name    correct_city             country       id
0      Bajos me Hauna  Bajos de Haina  Dominican Republic  3512128

  incorrect_city_name       correct_city  country       id
0   Lsjdsverg am Lech  Landsberg am Lech  Germany  2881509

  incorrect_city_name    correct_city  country       id
0      Domauyschingen  Donaueschingen  Germany  2936267

  incorrect_city_name correct_city                           country      id
0              Bulama       Bukama  Democratic Republic of the Congo  217834

      incorrect_city_name            correct_city country       id
0  Brejo da Mvpre de Dfus  Brejo da Madre de Deus  Brazil  3404862

  incorrect_city_name correct_city      country       id
0                Ipil         Ipil  Philippines  1710612

  incorrect_city_name correct_city country       id
0             Mfszków      Myszków  Poland  3091217

  incorrect_city_name correct_city country       id
0               Magín        Marín   Spain  3117409

  incorrect_city_name correct_city country       id
0            Sindunūr     Sindhnūr   India  1256207

  incorrect_city_name correct_city country      id
0           Kropottin    Kropotkin  Russia  540761

  incorrect_city_name correct_city    country       id
0             Svnggal      Sunggal  Indonesia  1213614

  incorrect_city_name correct_city country       id
0               Noysé        Notsé    Togo  2364752

  incorrect_city_name correct_city         country       id
0           Kirycaldy    Kirkcaldy  United Kingdom  2645298

  incorrect_city_name correct_city country      id
0            Gazipaja     Gazipaşa  Turkey  314812

  incorrect_city_name correct_city    country      id
0              Strugz       Struga  Macedonia  785387

  incorrect_city_name  correct_city country       id
0        Gummidlpondi  Gummidipundi   India  1270718

  incorrect_city_name     correct_city  country       id
0     Draa van jhedda  Draa Ben Khedda  Algeria  2499116

  incorrect_city_name correct_city  country       id
0              gefrou       Sefrou  Morocco  2537545

  incorrect_city_name correct_city country       id
0             Mondodì      Mondovì   Italy  3173162

  incorrect_city_name correct_city country     id
0          ll Mukaleā   Al Mukallā   Yemen  78754

  incorrect_city_name correct_city   country      id
0            Mlangeli     Mlangali  Tanzania  153408

  incorrect_city_name       correct_city country      id
0   Asi Shaykh vitkīn  Ash Shaykh Miskīn   Syria  164328

  incorrect_city_name   correct_city  country      id
0       Novomoukovl’k  Novomoskovs’k  Ukraine  699445

  incorrect_city_name correct_city country       id
0               Pbock        Płock  Poland  3088825

  incorrect_city_name correct_city   country       id
0          yhntchabun   Phetchabun  Thailand  1607737

  incorrect_city_name correct_city country       id
0              Bti’an       Bei’an   China  2038365

  incorrect_city_name correct_city   country       id
0            Sishphŏn     Sisŏphŏn  Cambodia  1822207

  incorrect_city_name correct_city  country       id
0               Hcide        Heide  Germany  2908032

  incorrect_city_name correct_city        country       id
0            vopiague     Copiague  United States  5113683

  incorrect_city_name correct_city country       id
0               Hannm        Hannō   Japan  1863183

  incorrect_city_name correct_city country       id
0              cigwav       Tigwav   Haiti  3718962

  incorrect_city_name correct_city  country       id
0                Dour         Dour  Belgium  2799226

  incorrect_city_name correct_city  country       id
0           Göpmingen    Göppingen  Germany  2919054

  incorrect_city_name correct_city country       id
0             Guaxoré      Guaporé  Brazil  3461941

  incorrect_city_name correct_city country     id
0              ‘Aqrgh       ‘Aqrah    Iraq  98822

  incorrect_city_name correct_city country       id
0               osuki        Usuki   Japan  1849094

  incorrect_city_name correct_city country      id
0               ochër        Ochër  Russia  516256

  incorrect_city_name correct_city   country       id
0              Guxrda       Guarda  Portugal  2738785

  incorrect_city_name correct_city country       id
0             Caidihn      Caidian   China  1816176

  incorrect_city_name correct_city  country      id
0               Dubno        Dubno  Ukraine  709540

  incorrect_city_name correct_city   country       id
0           Phu Khiyo    Phu Khiao  Thailand  1607439

  incorrect_city_name correct_city  country       id
0         Hoognteaten  Hoogstraten  Belgium  2795398

  incorrect_city_name correct_city country       id
0               Pdlūr        Polūr   India  1259434

  incorrect_city_name correct_city         country       id
0               Slaký        Slaný  Czech Republic  3065903

  incorrect_city_name correct_city country       id
0               loria        Lorca   Spain  2514891

  incorrect_city_name correct_city country       id
0              Nādbgi       Nādbai   India  1262296

  incorrect_city_name correct_city        country       id
0          treenfiefd   Greenville  United States  4428475
1          treenfiefd   Greenville  United States  4469160
2          treenfiefd   Greenville  United States  4580543
3          treenfiefd   Greenville  United States  4695066

  incorrect_city_name correct_city        country       id
0          BigiSpoing   Big Spring  United States  5517061

  incorrect_city_name correct_city country       id
0           Feoghuang    Fenghuang   China  7304020

  incorrect_city_name correct_city  country       id
0             Koupgou      Koungou  Mayotte  1090225

  incorrect_city_name correct_city        country       id
0              zuclid       Euclid  United States  5153420

  incorrect_city_name  correct_city country       id
0        Alfendraleje  Almendralejo   Spain  2521893

  incorrect_city_name    correct_city country       id
0      Pomttau-Prince  Port-au-Prince   Haiti  3718426

  incorrect_city_name correct_city country       id
0              tākaur       Pākaur   India  1260824

  incorrect_city_name correct_city        country       id
0         Grants kass  Grants Pass  United States  5729080

  incorrect_city_name correct_city   country       id
0            Sempoana     Semporna  Malaysia  1733697

  incorrect_city_name correct_city country      id
0               uatka        Satka  Russia  498418

  incorrect_city_name correct_city country      id
0            Ishimbag     Ishimbay  Russia  555980

  incorrect_city_name       correct_city         country       id
0   Necton-lebWinlows  Newton-le-Willows  United Kingdom  2641546

  incorrect_city_name correct_city country       id
0           Shinshqro    Shinshiro   Japan  1852046

  incorrect_city_name correct_city  country     id
0           Mogadisou    Mogadishu  Somalia  53654

  incorrect_city_name correct_city     country       id
0               Asska        Asaka  Uzbekistan  1513271

  incorrect_city_name correct_city  country      id
0              Bârled       Bârlad  Romania  684802

  incorrect_city_name correct_city  country       id
0              ueknès       Meknès  Morocco  2542715

  incorrect_city_name correct_city country       id
0           Mcravatío    Maravatío  Mexico  3996626

  incorrect_city_name correct_city country       id
0           Pālakhodu    Pālakkodu   India  1260793

  incorrect_city_name correct_city   country       id
0          Ket Samāga   Kot Samāba  Pakistan  1172888

  incorrect_city_name correct_city    country       id
0           xartapura    Martapura  Indonesia  1636022

  incorrect_city_name correct_city country       id
0              Kanaya       Kanaya   Japan  1860256

  incorrect_city_name correct_city country       id
0            UlanjUde     Ulan-Ude  Russia  2014407

  incorrect_city_name  correct_city        country       id
0        Five Corvess  Five Corners  United States  5794559

  incorrect_city_name correct_city                country      id
0               Rtfaḩ        Rafaḩ  Palestinian Territory  281102

  incorrect_city_name correct_city country       id
0            Kolhāgur     Kolhāpur   India  1266285

  incorrect_city_name  correct_city  country       id
0        Ljchtnrfelde  Lichterfelde  Germany  2878018

  incorrect_city_name correct_city country       id
0               aorba        Korba   India  1266122

  incorrect_city_name correct_city  country      id
0            Bohuslah     Bohuslav  Ukraine  711867

  incorrect_city_name correct_city country       id
0             Ygngkou      Yingkou   China  2033370

  incorrect_city_name correct_city country      id
0          Al Wāpiţay   Al Wāsiţah   Egypt  360464

  incorrect_city_name        correct_city country       id
0  Cbeceiçãq da Feira  Conceição da Feira  Brazil  3465767

  incorrect_city_name correct_city  country       id
0             tanouba      Manouba  Tunisia  2469274

  incorrect_city_name correct_city  country       id
0         Nyavngleqin  Nyaunglebin  Myanmar  1303406

  incorrect_city_name correct_city  country       id
0            Bürstaht     Bürstadt  Germany  2940938

  incorrect_city_name correct_city country       id
0           Cornjredo    Cornaredo   Italy  3178074

  incorrect_city_name correct_city country       id
0          Vcjasawada   Vijayawada   India  1253184

  incorrect_city_name correct_city     country      id
0                Ujar         Ujar  Azerbaijan  584791

  incorrect_city_name        correct_city country       id
0  Plawsancfadu-Touch  Plaisance-du-Touch  France  2986933

  incorrect_city_name correct_city  country       id
0            Zrdelgem     Zedelgem  Belgium  2783308

  incorrect_city_name correct_city   country       id
0            El Coley     El Copey  Colombia  3684452

  incorrect_city_name correct_city   country       id
0              garede       Parede  Portugal  2265169

  incorrect_city_name correct_city country       id
0         Neelagkvrai  Neelankarai   India  9212568

  incorrect_city_name correct_city country       id
0               Apydi        Apodi  Brazil  3407440

  incorrect_city_name   correct_city        country       id
0       qaytond Beach  Daytona Beach  United States  4152872

  incorrect_city_name correct_city country       id
0           Catanzayo    Catanzaro   Italy  2525059

  incorrect_city_name correct_city        country       id
0          Huntinqton   Austintown  United States  5146256

  incorrect_city_name  correct_city country       id
0        Juir dq Fora  Juiz de Fora  Brazil  3459505

  incorrect_city_name correct_city    country       id
0            vucumpiz     Mucumpiz  Venezuela  3631741

  incorrect_city_name correct_city     country       id
0              Rudqyy       Rudnyy  Kazakhstan  1519843

  incorrect_city_name   correct_city country       id
0       Pindarj Miram  Pindaré Mirim  Brazil  3392088

  incorrect_city_name correct_city     country       id
0            Tojtogul     Toktogul  Kyrgyzstan  1538648

  incorrect_city_name correct_city country       id
0            Anantrag     Anantnag   India  1278667

  incorrect_city_name correct_city        country       id
0          Ploinficld   Plainfield  United States  4263108
1          Ploinficld   Plainfield  United States  4906125
2          Ploinficld   Plainfield  United States  5102720

  incorrect_city_name correct_city    country       id
0         Lhokseueare  Lhokseumawe  Indonesia  1214658

  incorrect_city_name correct_city   country       id
0         Pieyhcuesta  Piedecuesta  Colombia  3672328

  incorrect_city_name correct_city    country       id
0         jottnicapán  Totonicapán  Guatemala  3588258

  incorrect_city_name correct_city country      id
0            Luzhnikk     Luzhniki  Russia  533067

  incorrect_city_name correct_city country      id
0          Kkasnastaw   Krasnystaw  Poland  767605

  incorrect_city_name correct_city country       id
0            Chaozhoa     Chaozhou   China  1815395

  incorrect_city_name correct_city      country       id
0          SaniMiduel   San Miguel  Philippines  1688949
1          SaniMiduel   San Miguel  Philippines  1688954

  incorrect_city_name correct_city country      id
0              Vod’sk       Vol’sk  Russia  472278

  incorrect_city_name correct_city country       id
0            Mundargi     Mundargi   India  1262516

  incorrect_city_name   correct_city country       id
0       Tzrre-Papheco  Torre-Pacheco   Spain  2510271

  incorrect_city_name correct_city      country      id
0               Pbjok        Pajok  South Sudan  375495

  incorrect_city_name correct_city    country       id
0             smbalse      Embalse  Argentina  3856235

  incorrect_city_name correct_city  country       id
0             Melouza      Melouza  Algeria  2488202

  incorrect_city_name correct_city  country       id
0               Bbnny        Bonny  Nigeria  2346812

  incorrect_city_name correct_city country      id
0           Ar Riqqvh    Ar Riqqah  Kuwait  285728

  incorrect_city_name correct_city  country       id
0            Oostkamp     Oostkamp  Belgium  2789751

  incorrect_city_name correct_city         country       id
0         gerkharsted  Berkhamsted  United Kingdom  2655858

  incorrect_city_name correct_city         country       id
0           Buckhafen    Buckhaven  United Kingdom  2654415

  incorrect_city_name correct_city  country       id
0               Daknr        Dakar  Senegal  2253354

  incorrect_city_name correct_city country       id
0                Babu         Babu   China  1817858

  incorrect_city_name correct_city country      id
0             Trkhvin      Tikhvin  Russia  483019

  incorrect_city_name   correct_city        country       id
0       Baljh Scrings  Balch Springs  United States  4672059

      incorrect_city_name            correct_city country       id
0  Saht Quirzehdel Vvlsès  Sant Quirze del Vallès   Spain  3110101

  incorrect_city_name correct_city country      id
0             gar’ino      Mar’ino  Russia  529237

  incorrect_city_name correct_city country       id
0              cbreus       Abreus    Cuba  3569741

  incorrect_city_name correct_city    country       id
0             garacay      Maracay  Venezuela  3632998

  incorrect_city_name correct_city      country       id
0             nrecibo      Arecibo  Puerto Rico  4562635

  incorrect_city_name correct_city country       id
0           Maaeshwar    Maheshwar   India  1264385

  incorrect_city_name correct_city  country       id
0          Langejhorh   Langenhorn  Germany  2881018

    incorrect_city_name          correct_city country       id
0  Tpnavera dw la veina  Talavera de la Reina   Spain  2510693

  incorrect_city_name  correct_city        country       id
0        Tahque oerde  Tanque Verde  United States  5316890

  incorrect_city_name correct_city country       id
0              Jacmml       Jacmel   Haiti  3723779

  incorrect_city_name correct_city     country       id
0             Qutasoy      Quvasoy  Uzbekistan  1513331

  incorrect_city_name correct_city       country       id
0          Bothavidlb   Bothaville  South Africa  1016698

  incorrect_city_name correct_city country      id
0           Nakhabinj    Nakhabino  Russia  523553

  incorrect_city_name     correct_city country       id
0     Primer Etsincxe  Primer Ensanche   Spain  8050888

  incorrect_city_name correct_city      country       id
0              Kboten       Kloten  Switzerland  2660127

  incorrect_city_name correct_city  country       id
0                 Ulm          Ulm  Germany  2820256

  incorrect_city_name correct_city  country       id
0               Nesta        Nefta  Tunisia  2468561

  incorrect_city_name correct_city   country       id
0          Buāi zheru   Bhāi Pheru  Pakistan  1182829

  incorrect_city_name correct_city             country       id
0               Neiba        Neiba  Dominican Republic  3495857

  incorrect_city_name correct_city  country      id
0         ClkjgNapoca  Cluj-Napoca  Romania  681290

  incorrect_city_name correct_city        country       id
0         Neubgryport  Newburyport  United States  4945256

  incorrect_city_name  correct_city        country       id
0        Southlaaurel  South Laurel  United States  4369978

  incorrect_city_name correct_city      country       id
0            Nijmigen     Nijmegen  Netherlands  2750053

  incorrect_city_name  correct_city country       id
0        Camso Granke  Campo Grande  Brazil  3467747

  incorrect_city_name correct_city  country      id
0             azmayil      Izmayil  Ukraine  707308

  incorrect_city_name correct_city    country       id
0          Shn Majtín   San Martín  Argentina  3836992

  incorrect_city_name correct_city     country       id
0           hiquirres    Siquirres  Costa Rica  3621440

  incorrect_city_name correct_city country       id
0             Muktsaa      Muktsar   India  1262578

     incorrect_city_name           correct_city  country       id
0  azursbach an der Fils  Ebersbach an der Fils  Germany  2933959

  incorrect_city_name correct_city        country       id
0          TomseRiver   Toms River  United States  4504476

  incorrect_city_name correct_city country      id
0            Garwplin     Garwolin  Poland  772339

  incorrect_city_name correct_city country       id
0               Dalgo        Daigo   Japan  2112989

  incorrect_city_name correct_city   country       id
0              woseau       Roseau  Dominica  3575635

  incorrect_city_name correct_city  country      id
0         Dherzhynu’k  Dzerzhyns’k  Ukraine  709354

  incorrect_city_name correct_city  country       id
0         Lucaenwaldn  Luckenwalde  Germany  2875484

  incorrect_city_name correct_city  country       id
0          Aïn Bhssnm   Aïn Bessem  Algeria  2508268

  incorrect_city_name correct_city country      id
0             lemirci      Demirci  Turkey  317241

  incorrect_city_name correct_city country       id
0             Aracalu      Aracaju  Brazil  3471872

  incorrect_city_name correct_city     country       id
0         Lalmapilhat  Lalmanirhat  Bangladesh  1185181

  incorrect_city_name      correct_city        country       id
0    goutv Plainfievd  South Plainfield  United States  5104844

  incorrect_city_name    correct_city  country       id
0      Scdnevehdingen  Schneverdingen  Germany  2837291

  incorrect_city_name correct_city        country       id
0           Poinciaja    Poinciana  United States  4168930

  incorrect_city_name correct_city country       id
0             Jieshuu      Jieshou   China  1805844

  incorrect_city_name   correct_city  country       id
0       Chasie Royaoe  Chasse Royale  Belgium  2800461

  incorrect_city_name correct_city  country       id
0             Yaculba      Yacuiba  Bolivia  3901178

  incorrect_city_name correct_city       country       id
0           Cvnturion    Centurion  South Africa  1105777

  incorrect_city_name correct_city country      id
0            Japosław     Jarosław  Poland  770380

   incorrect_city_name         correct_city country       id
0  Bandan Seri Benvwan  Bandar Seri Begawan  Brunei  1820906

  incorrect_city_name correct_city country       id
0             Cehelín      Cehegín   Spain  2519651

  incorrect_city_name correct_city  country       id
0                Mila         Mila  Algeria  2487452

  incorrect_city_name correct_city country      id
0                Yazd         Yazd    Iran  111822

  incorrect_city_name correct_city                 country       id
0               Brčko        Brčko  Bosnia and Herzegovina  3203521

       incorrect_city_name             correct_city   country       id
0  Kaspgng Siwpang Rengtam  Kampung Simpang Renggam  Malaysia  1764318

  incorrect_city_name correct_city           country       id
0                Faaa         Faaa  French Polynesia  4034561

  incorrect_city_name correct_city        country       id
0             Bbtavia      Batavia  United States  4884192
1             Bbtavia      Batavia  United States  5108093

  incorrect_city_name correct_city country       id
0         Chgudimarca  Chaupimarca    Peru  3944179

  incorrect_city_name        correct_city country       id
0  San AndrruyCholula  San Andrés Cholula  Mexico  3818742

  incorrect_city_name correct_city country      id
0            Petrogsk     Petrovsk  Russia  509987

  incorrect_city_name correct_city     country       id
0         Cqolpon-Atu  Cholpon-Ata  Kyrgyzstan  1528512

  incorrect_city_name correct_city         country       id
0            Penzaxce     Penzance  United Kingdom  2640377

  incorrect_city_name correct_city      country       id
0          Gewdrinken   Gendringen  Netherlands  2755599

  incorrect_city_name    correct_city country       id
0      Cevgy-Ponvoise  Cergy-Pontoise  France  8555643

  incorrect_city_name correct_city country      id
0              Dfyrūţ       Dayrūţ   Egypt  358269

  incorrect_city_name correct_city     country       id
0              Bjucau       Baucau  East Timor  1649539

  incorrect_city_name correct_city country       id
0              Bendsk       Berdsk  Russia  1510350

  incorrect_city_name correct_city                 country       id
0             Towtola      Tortola  British Virgin Islands  8533874

  incorrect_city_name correct_city country       id
0             Bujāwar      Bijāwar   India  1275694

  incorrect_city_name  correct_city  country       id
0        Nindeukassel  Niederkassel  Germany  2863223

  incorrect_city_name  correct_city country     id
0        Al-Hamdanird  Al-Hamdaniya    Iraq  92430

  incorrect_city_name correct_city country       id
0               Sxiki        Shiki   Japan  1852502

  incorrect_city_name correct_city   country      id
0           Sawdanski    Sandanski  Bulgaria  727447

  incorrect_city_name correct_city   country       id
0              hérida       Lérida  Colombia  3676626

  incorrect_city_name correct_city     country       id
0           Ambzsitra    Ambositra  Madagascar  1079088

  incorrect_city_name correct_city  country      id
0               Bnzău        Buzău  Romania  683123

  incorrect_city_name        correct_city country       id
0  eãokFélixpdo Xingu  São Félix do Xingu  Brazil  3388847

  incorrect_city_name correct_city         country       id
0         ftalybridgn  Stalybridge  United Kingdom  2637106

  incorrect_city_name correct_city  country      id
0           Zdolbukiv    Zdolbuniv  Ukraine  687432

  incorrect_city_name correct_city         country       id
0            polloway     Holloway  United Kingdom  8315400

,incorrect_city_name,correct_city,country,id
0,Mnrfaz-e Wususwalīzye Āchīn,Markaz-e Woluswalī-ye Āchīn,Afghanistan,1469706

  incorrect_city_name correct_city country       id
0              Menkon       Menton  France  2994497

     incorrect_city_name           correct_city    country       id
0  Santiago Sacatgbéqdrz  Santiago Sacatepéquez  Guatemala  3589101

  incorrect_city_name correct_city  country       id
0              Msaven       Msaken  Tunisia  2469140

  incorrect_city_name correct_city   country      id
0               Ckala        Chala  Tanzania  160670

  incorrect_city_name correct_city      country       id
0             Mankino      Mankono  Ivory Coast  2284589

  incorrect_city_name correct_city country       id
0              Mouima       Mouila   Gabon  2398073

  incorrect_city_name correct_city  country       id
0            Hjørrins     Hjørring  Denmark  2620214

  incorrect_city_name correct_city country       id
0           Llugmajor    Llucmajor   Spain  2514984

  incorrect_city_name correct_city country      id
0         Petroúpolss  Petroúpolis  Greece  255377

  incorrect_city_name correct_city      country       id
0             Helmonj      Helmond  Netherlands  2754447

  incorrect_city_name correct_city country       id
0              Hyèces       Hyères  France  3012937

  incorrect_city_name correct_city country       id
0             Snnshui      Sanshui   China  1789273

  incorrect_city_name correct_city  country       id
0               Skiye        Skive  Denmark  2613731

  incorrect_city_name correct_city country       id
0              fàtiva       Xàtiva   Spain  2516345

  incorrect_city_name correct_city  country      id
0             Putygl’      Putyvl’  Ukraine  696008

  incorrect_city_name correct_city   country       id
0            Rājvnpur     Rājanpur  Pakistan  1167380

  incorrect_city_name correct_city country      id
0              Rowtov       Rostov  Russia  501183

  incorrect_city_name correct_city country       id
0              Venpce       Venice   Italy  3164603

  incorrect_city_name  correct_city   country       id
0        KohborePakka  Kohror Pakka  Pakistan  1175446

  incorrect_city_name correct_city country       id
0              Suoaka       Suzaka   Japan  1851357

  incorrect_city_name correct_city country       id
0         Borgfmaneyo  Borgomanero   Italy  3181790

  incorrect_city_name correct_city        country       id
0         Spn Gabrisl  San Gabriel  United States  5392034

  incorrect_city_name correct_city  country      id
0          Voznosunsk   Voznesensk  Ukraine  688860

  incorrect_city_name correct_city country      id
0            Jagodixa     Jagodina  Serbia  789923

  incorrect_city_name correct_city     country       id
0            Dinnjpur     Dinājpur  Bangladesh  1203891

,incorrect_city_name,correct_city,country,id
0,Grytviknn,Grytviken,South Georgia and the South Sandwich Islands,3426466

  incorrect_city_name correct_city        country       id
0            Tualatpn     Tualatin  United States  5757506

  incorrect_city_name    correct_city country      id
0      Severo-ladoksk  Severo-Zadonsk  Russia  496269

  incorrect_city_name correct_city                country      id
0            AsnSamū‘     As Samū‘  Palestinian Territory  284583

  incorrect_city_name correct_city country       id
0           Hirjkerūr    Hirekerūr   India  1270036

  incorrect_city_name correct_city  country      id
0             Focșant      Focșani  Romania  678015

  incorrect_city_name correct_city country       id
0            Moquegga     Moquegua    Peru  3934608

  incorrect_city_name correct_city country       id
0            Tirumwla     Tirumala   India  1254373

  incorrect_city_name correct_city country       id
0             Firmily      Firminy  France  3018455

  incorrect_city_name  correct_city country       id
0        Piusc Alegre  Pouso Alegre  Brazil  3452525

  incorrect_city_name correct_city country      id
0             Erzzrum      Erzurum  Turkey  315368

  incorrect_city_name correct_city    country       id
0            Sokarvja     Sokaraja  Indonesia  1626312

  incorrect_city_name correct_city country      id
0           Lyubnrtsy    Lyubertsy  Russia  532615

  incorrect_city_name     correct_city        country       id
0     South Szlt Lpce  South Salt Lake  United States  5781794

       incorrect_city_name             correct_city country       id
0  San zernzndo de Henanas  San Fernando de Henares   Spain  3110627

  incorrect_city_name correct_city        country       id
0          Seal Bebph   Seal Beach  United States  5394086

  incorrect_city_name correct_city  country       id
0             HànĐông      Hà Đông  Vietnam  1581364

     incorrect_city_name           correct_city country      id
0  Komendintsky aerxdzom  Komendantsky aerodrom  Russia  535729

  incorrect_city_name correct_city     country       id
0                Suai         Suai  East Timor  1626459

  incorrect_city_name correct_city        country       id
0            Corcorae     Corcoran  United States  5339539

  incorrect_city_name correct_city country       id
0           Cachoeiri    Cachoeira  Brazil  3468535

        incorrect_city_name              correct_city  country       id
0  Bxendenburg antder Havrl  Brandenburg an der Havel  Germany  2945358

  incorrect_city_name correct_city country       id
0             Soygayn      Soygaon   India  1255667

  incorrect_city_name correct_city country       id
0              extapa       Ixtapa  Mexico  4004293

  incorrect_city_name correct_city country       id
0               Sahto        Salto  Brazil  3450594

  incorrect_city_name correct_city country       id
0           xästervik    Västervik  Sweden  2664203

  incorrect_city_name correct_city country       id
0             fbirama      Ibirama  Brazil  3461576

  incorrect_city_name correct_city country      id
0              Pýigos       Pýrgos  Greece  255229

  incorrect_city_name correct_city        country       id
0              shelby       Shelby  United States  4491180
1              shelby       Shelby  United States  5009586

  incorrect_city_name correct_city country       id
0         NvvavIguaçu  Nova Iguaçu  Brazil  3456160

  incorrect_city_name   correct_city country       id
0       Mvlins de Rpi  Molins de Rei   Spain  3116562

  incorrect_city_name correct_city country       id
0            Pedro aI     Pedro II  Brazil  3392431

  incorrect_city_name correct_city        country       id
0          Sandy Ciyy   Sandy City  United States  5781061

  incorrect_city_name correct_city country       id
0              viroli       Airoli   India  7279599

  incorrect_city_name       correct_city  country       id
0   Georgwmauibnhütte  Georgsmarienhütte  Germany  2921242

  incorrect_city_name correct_city country      id
0               rafed        Safed  Israel  293100

  incorrect_city_name       correct_city country       id
0   Ly PeuitcQuevilly  Le Petit-Quevilly  France  3002880

  incorrect_city_name correct_city        country       id
0         Gainesvslbe  Gainesville  United States  4156404
1         Gainesvslbe  Gainesville  United States  4196586
2         Gainesvslbe  Gainesville  United States  4692746

  incorrect_city_name correct_city        country       id
0             Shaxter      Shafter  United States  5394842

  incorrect_city_name correct_city country       id
0            Hanzhohg     Hanzhong   China  1808857

  incorrect_city_name      correct_city country       id
0    MarechdllDeoporo  Marechal Deodoro  Brazil  3395395

  incorrect_city_name        correct_city country       id
0  Verneuilwsurpteine  Verneuil-sur-Seine  France  2969796

  incorrect_city_name correct_city         country       id
0               syton        Ryton  United Kingdom  2638894

  incorrect_city_name correct_city        country       id
0              Oxforr       Oxford  United States  4081914
1              Oxforr       Oxford  United States  4440076
2              Oxforr       Oxford  United States  4520760

  incorrect_city_name correct_city    country       id
0          Esqukpmlas   Esquipulas  Guatemala  3595783

  incorrect_city_name correct_city country       id
0               Abbza        Abaza  Russia  1512205

  incorrect_city_name correct_city country      id
0               oohar        Sohar    Oman  286282

  incorrect_city_name correct_city country       id
0             ktlixco      Atlixco  Mexico  3532592

  incorrect_city_name correct_city country     id
0               Ytrīm        Yarīm   Yemen  69559

  incorrect_city_name correct_city  country       id
0             Mascnra      Mascara  Algeria  2490098

  incorrect_city_name correct_city     country      id
0             Maştağh      Maştağa  Azerbaijan  585557

  incorrect_city_name correct_city country       id
0              Pemote       Perote  Mexico  3521628

  incorrect_city_name correct_city country      id
0             Naqcdeh      Naqadeh    Iran  122698

  incorrect_city_name correct_city    country       id
0             Badulld      Badulla  Sri Lanka  1250615

  incorrect_city_name correct_city country       id
0             Katnngi      Katangi   India  1267537
1             Katnngi      Katangi   India  1267538

  incorrect_city_name correct_city       country      id
0          Heidelbrlg   Heidelberg  South Africa  997151

  incorrect_city_name     correct_city country       id
0     Vitlorio dvneto  Vittorio Veneto   Italy  3164028

  incorrect_city_name  correct_city country       id
0        Phunlshmling  Phuntsholing  Bhutan  1252484

  incorrect_city_name correct_city country       id
0                 Rho          Rho   Italy  3169447

  incorrect_city_name correct_city country       id
0             Bhabhum      Bhabhua   India  1276371

  incorrect_city_name  correct_city        country       id
0        Wiltiaestown  Williamstown  United States  4504871

  incorrect_city_name correct_city  country       id
0          Bad Honnmz   Bad Honnef  Germany  2953435

  incorrect_city_name correct_city   country       id
0            kânzeres     Fânzeres  Portugal  2739756

  incorrect_city_name correct_city      country       id
0              Smlana       Solana  Philippines  1685880

  incorrect_city_name        correct_city    country       id
0  Cwty of Parkamctta  City of Parramatta  Australia  7302259

  incorrect_city_name correct_city country       id
0          oahārkganj   Mahārāganj   India  1264433

  incorrect_city_name correct_city country       id
0             Borivmi      Borivli   India  1275248

  incorrect_city_name correct_city      country       id
0            Mercpdes     Mercedes  Philippines  1699833

  incorrect_city_name correct_city         country       id
0               xmara        Smara  Western Sahara  2461874

  incorrect_city_name correct_city country       id
0           Lakhīmpus    Lakhīmpur   India  1265242

  incorrect_city_name correct_city  country       id
0             jayambe      Cayambe  Ecuador  3659578

  incorrect_city_name  correct_city       country       id
0        Balfitoiille  Ballitoville  South Africa  1021360

  incorrect_city_name correct_city      country       id
0            Montreum     Montreux  Switzerland  2659601

  incorrect_city_name correct_city country       id
0              Kisigi       Kosigi   India  1266070

  incorrect_city_name correct_city  country      id
0            Kakhevka     Kakhovka  Ukraine  707244

  incorrect_city_name correct_city        country       id
0          Mprristoqn   Morristown  United States  4642938
1          Mprristoqn   Morristown  United States  5101427

  incorrect_city_name correct_city    country       id
0             Cuilapg      Cuilapa  Guatemala  3597804

         incorrect_city_name               correct_city country       id
0  SrnpMbguelbde Papasquearo  San Miguel de Papasquiaro  Mexico  3985327

  incorrect_city_name correct_city   country      id
0              Wxrota       Werota  Ethiopia  326206

  incorrect_city_name correct_city   country       id
0             Baegkok      Bangkok  Thailand  1609350

  incorrect_city_name correct_city country       id
0             Corumbw      Corumbá  Brazil  3465342

  incorrect_city_name correct_city   country       id
0               Lagws        Lagos  Portugal  2267226

  incorrect_city_name correct_city country       id
0                Kure         Kure   Japan  1858296

  incorrect_city_name  correct_city country      id
0        Bututlirovka  Buturlinovka  Russia  570563

  incorrect_city_name correct_city country      id
0               Bontb        Bonāb    Iran  140889

        incorrect_city_name              correct_city country       id
0  Riodpvrde de Mato Grysso  Rio Verde de Mato Grosso  Brazil  3451051

  incorrect_city_name correct_city country       id
0             Saraulg      Sarauli   India  1257219

  incorrect_city_name correct_city country       id
0               Binea        Binka   India  1275558

  incorrect_city_name correct_city        country       id
0         Ldke Zurich  Lake Zurich  United States  4899170

  incorrect_city_name correct_city        country       id
0         zasthamptkn  Easthampton  United States  4935582

  incorrect_city_name correct_city country       id
0           Białogard    Białogard  Poland  3103556

  incorrect_city_name correct_city country       id
0           tenavente    Benavente   Spain  3128291

  incorrect_city_name correct_city   country       id
0             Trenčíg      Trenčín  Slovakia  3057140

  incorrect_city_name  correct_city country       id
0        Cavpos Belop  Campos Belos  Brazil  3467687

  incorrect_city_name correct_city  country       id
0             Bevereb      Beveren  Belgium  2802031

  incorrect_city_name correct_city country       id
0             Pataudl      Pataudi   India  1260156

  incorrect_city_name correct_city country      id
0                Söke         Söke  Turkey  300399

  incorrect_city_name   correct_city  country       id
0       leue Nesstadt  Neue Neustadt  Germany  2864072

  incorrect_city_name correct_city  country      id
0           auninyets    Luninyets  Belarus  625818

  incorrect_city_name correct_city  country       id
0              Sitywe       Sittwe  Myanmar  1295765

  incorrect_city_name correct_city country       id
0             Chostca      Chosica    Peru  3943423

  incorrect_city_name correct_city country       id
0         Saliyópogis  Salinópolis  Brazil  3389822

  incorrect_city_name correct_city country       id
0           Fukmi-shi    Fukui-shi   Japan  1863985

  incorrect_city_name correct_city country       id
0              ruzano       Suzano  Brazil  3447212

  incorrect_city_name correct_city      country       id
0              Akoupb       Akoupé  Ivory Coast  2293107

  incorrect_city_name correct_city         country       id
0              Orlogá       Orlová  Czech Republic  3068873

  incorrect_city_name correct_city   country      id
0               Buygu        Bungu  Tanzania  160877

  incorrect_city_name correct_city   country       id
0              Hxdāli       Hadāli  Pakistan  1177397

  incorrect_city_name correct_city country       id
0         Hinjikikauu  Hinjilikatu   India  1270066

  incorrect_city_name correct_city         country       id
0            Ckevedon     Clevedon  United Kingdom  2652861

  incorrect_city_name correct_city  country       id
0         grackezheim  Brackenheim  Germany  2945591

  incorrect_city_name    correct_city    country       id
0      Ciudwd Bocívar  Ciudad Bolívar  Venezuela  3645532

  incorrect_city_name  correct_city country      id
0        Assialamīyah  As Salamīyah   Syria  164947

  incorrect_city_name correct_city country       id
0             Morinwa      Morinda   India  1262426

  incorrect_city_name correct_city country       id
0              Kannid       Kannod   India  1268007

  incorrect_city_name correct_city  country      id
0         Kivshahivka  Kivsharivka  Ukraine  704608

  incorrect_city_name correct_city  country       id
0           Hoestebro    Holstebro  Denmark  2620046

  incorrect_city_name correct_city country       id
0          Alaqapevsk   Alapayevsk  Russia  1511954

  incorrect_city_name correct_city country       id
0            Anūpgarx     Anūpgarh   India  1278510

  incorrect_city_name correct_city country       id
0             faigarh      Raigarh   India  1259005

  incorrect_city_name correct_city        country       id
0         Mizmi uakes  Miami Lakes  United States  4164186

  incorrect_city_name correct_city country      id
0         Kuwait Ctey  Kuwait City  Kuwait  285787

  incorrect_city_name correct_city   country       id
0                Ovar         Ovar  Portugal  2736930

  incorrect_city_name correct_city country       id
0         Itajoatihra  Itacoatiara  Brazil  3397893

  incorrect_city_name correct_city country       id
0            Katsuuha     Katsuura   Japan  2112309

  incorrect_city_name correct_city   country      id
0          Beitbritje   Beitbridge  Zimbabwe  895269

  incorrect_city_name correct_city        country       id
0           Kalamazjo    Kalamazoo  United States  4997787

  incorrect_city_name        correct_city         country       id
0  Berwick-Upon-wwreg  Berwick-Upon-Tweed  United Kingdom  2655819

  incorrect_city_name correct_city  country       id
0               Pbndo        Pando  Uruguay  3441354

  incorrect_city_name correct_city        country       id
0         wantalMaria  Santa Maria  United States  5393180

  incorrect_city_name correct_city country       id
0           Shxroishi    Shiroishi   Japan  2111016

  incorrect_city_name  correct_city country      id
0        Judeida lasr  Judeida Makr  Israel  294622

  incorrect_city_name correct_city  country      id
0                Blaj         Blaj  Romania  684612

  incorrect_city_name correct_city country       id
0             Huarmey      Huarmey    Peru  3939168

  incorrect_city_name correct_city   country       id
0              Mfdrid       Madrid  Colombia  3675707

  incorrect_city_name correct_city country       id
0              Tekpri       Tekāri   India  1254797

  incorrect_city_name correct_city   country       id
0            Amaqgarh     Amangarh  Pakistan  1184569

  incorrect_city_name       correct_city         country       id
0   Ashton-uzder-pyee  Ashton-under-Lyne  United Kingdom  2656915

  incorrect_city_name correct_city    country       id
0               nandy        Kandy  Sri Lanka  1241622

  incorrect_city_name correct_city     country       id
0          JayaljAbad   Jalal-Abad  Kyrgyzstan  1528249

  incorrect_city_name correct_city     country       id
0            Rājlhāhi     Rājshāhi  Bangladesh  1185128

,incorrect_city_name,correct_city,country,id
0,Zücico (Kreis 9j /aAltstettex,Zürich (Kreis 9) / Altstetten,Switzerland,6295513

  incorrect_city_name correct_city  country       id
0            Hammayet     Hammamet  Algeria  2494548

  incorrect_city_name correct_city  country       id
0             Restock      Rostock  Germany  2844588

  incorrect_city_name correct_city      country       id
0           Cwinch'ŏn    Chinch'ŏn  South Korea  1846095

  incorrect_city_name correct_city country       id
0          Ganopvaram   Gannavaram   India  1271613

  incorrect_city_name correct_city country      id
0         Vosfrecensk  Voskresensk  Russia  471656

  incorrect_city_name     correct_city        country       id
0     yadison Hpights  Madison Heights  United States  5000500

  incorrect_city_name      correct_city   country       id
0    Kubla Terenggquu  Kuala Terengganu  Malaysia  1734705

  incorrect_city_name       correct_city country       id
0   Ixtapaf deyla fal  Ixtapan de la Sal  Mexico  3526681

  incorrect_city_name correct_city        country       id
0           Brentwoow    Brentwood  United States  4608408
1           Brentwoow    Brentwood  United States  5110077
2           Brentwoow    Brentwood  United States  5330642

  incorrect_city_name correct_city country      id
0              Plavsc       Plavsk  Russia  509052

  incorrect_city_name   correct_city country      id
0       yhililamombwe  Chililabombwe  Zambia  919544

  incorrect_city_name correct_city      country       id
0           Del Pzlar    Del Pilar  Philippines  1715169

  incorrect_city_name correct_city country       id
0             Berasij      Berasia   India  1276449

  incorrect_city_name correct_city country       id
0          femVésinet   Le Vésinet  France  2998854

  incorrect_city_name correct_city country       id
0               Paika        Paita    Peru  3694112

  incorrect_city_name correct_city country       id
0               qaval        Laval  France  3005866

  incorrect_city_name correct_city   country       id
0             Mnlacca      Malacca  Malaysia  1734759

  incorrect_city_name correct_city        country       id
0           Kadsville    Kaysville  United States  5776715

  incorrect_city_name correct_city country       id
0               Serij        Seria  Brunei  1820187

  incorrect_city_name correct_city  country       id
0               hraun        Traun  Austria  2763423

  incorrect_city_name correct_city  country      id
0           Drohdbych    Drohobych  Ukraine  709611

  incorrect_city_name  correct_city   country       id
0        Munaffarpbād  Muzaffarābād  Pakistan  1169607

  incorrect_city_name correct_city       country       id
0           Berberton    Barberton  South Africa  1021086

  incorrect_city_name correct_city country       id
0               Vitné        Vitré  France  2967879

  incorrect_city_name correct_city  country       id
0           Hautingen    Hattingen  Germany  2909230

  incorrect_city_name correct_city country       id
0            Tavakpur     Tanakpur   India  1255027

  incorrect_city_name correct_city        country       id
0               Omiha        Omaha  United States  5074472

  incorrect_city_name correct_city country       id
0           Bogatynma    Bogatynia  Poland  3103096

  incorrect_city_name correct_city    country       id
0                Ubud         Ubud  Indonesia  1622846

        incorrect_city_name              correct_city country       id
0  nilueneuve-Satnt-Geouges  Villeneuve-Saint-Georges  France  2968529

  incorrect_city_name correct_city country      id
0              mhimki       Khimki  Russia  550280

  incorrect_city_name correct_city country       id
0            Tomohama     Toyohama   Japan  1849850

  incorrect_city_name correct_city  country       id
0               Hakga        Hakha  Myanmar  1325443

  incorrect_city_name correct_city country       id
0                Arai         Arai   Japan  1865207

  incorrect_city_name correct_city country       id
0              Anshvn       Anshun   China  1817968

  incorrect_city_name correct_city country       id
0               Mabma        Mayma  Russia  1499163

  incorrect_city_name correct_city        country       id
0         Chabep Hill  Chapel Hill  United States  4460162

  incorrect_city_name correct_city country       id
0               Tulun        Tulun  Russia  2014927

  incorrect_city_name correct_city  country       id
0              Telgee       Telgte  Germany  2823590

  incorrect_city_name correct_city country       id
0          Cuauitémoh   Cuauhtémoc  Mexico  3827409
1          Cuauitémoh   Cuauhtémoc  Mexico  4012406

  incorrect_city_name correct_city      country       id
0            Tiabsalé     Tiassalé  Ivory Coast  2280761

  incorrect_city_name    correct_city        country       id
0      Jeffersoncalle  Jeffersonville  United States  4259671

  incorrect_city_name correct_city      country       id
0              auiglo       Guiglo  Ivory Coast  2287958

  incorrect_city_name correct_city  country       id
0             Shigamu      Shagamu  Nigeria  2323411

  incorrect_city_name correct_city  country       id
0         Rasseleheim  Rüsselsheim  Germany  2842884

  incorrect_city_name correct_city country       id
0             Shegaoa      Shegaon   India  1256620

  incorrect_city_name correct_city country      id
0              Vxlday       Valday  Russia  477301

  incorrect_city_name correct_city country       id
0             Inazawb      Inazawa   Japan  1861602

  incorrect_city_name   correct_city country       id
0       Kamieeya Góra  Kamienna Góra  Poland  3096779

  incorrect_city_name      correct_city  country       id
0    Eisenhüttrnbyadt  Eisenhüttenstadt  Germany  2931481

  incorrect_city_name correct_city        country       id
0            Issaquuh     Issaquah  United States  5798487

  incorrect_city_name correct_city     country       id
0              Isfaga       Isfana  Kyrgyzstan  1222662

  incorrect_city_name correct_city     country       id
0          Noubdhiboo   Nouâdhibou  Mauritania  2377457

  incorrect_city_name correct_city country       id
0               Zafla        Zafra   Spain  2509377

  incorrect_city_name correct_city country      id
0                Inza         Inza  Russia  556283

  incorrect_city_name correct_city country       id
0           Monhauban    Montauban  France  2993002

  incorrect_city_name correct_city country       id
0              Lyrvik       Larvik  Norway  3148129

  incorrect_city_name correct_city      country       id
0              Shtten       Sitten  Switzerland  2658576

  incorrect_city_name  correct_city   country       id
0        Sigbateppque  Siguatepeque  Honduras  3601311

  incorrect_city_name correct_city   country      id
0              Taborn       Tabora  Tanzania  149658

  incorrect_city_name correct_city country       id
0              Htaraz       Huaraz    Peru  3696378

     incorrect_city_name           correct_city country       id
0  Sunta Eulàvia deseRwu  Santa Eulària des Riu   Spain  2511162

  incorrect_city_name correct_city country      id
0          Skilbefteå   Skellefteå  Sweden  602913

  incorrect_city_name correct_city        country       id
0          Bellinxaam   Bellingham  United States  5786899

  incorrect_city_name correct_city country      id
0          petrShe’an   Bet She’an  Israel  295435

  incorrect_city_name correct_city  country       id
0              Skafes       Skanes  Tunisia  2467246

  incorrect_city_name  correct_city country       id
0        Proaop’yepsk  Prokop’yevsk  Russia  1494114

  incorrect_city_name correct_city country       id
0             shanera      Dhanera   India  1272962

  incorrect_city_name correct_city country       id
0               Kāhka        Kālka   India  1268381

  incorrect_city_name correct_city country      id
0               Radjm        Radom  Poland  760778

  incorrect_city_name correct_city      country       id
0              Iloplo       Iloilo  Philippines  1711005

  incorrect_city_name correct_city      country       id
0              xongao       Bongao  Philippines  1724088

  incorrect_city_name correct_city country       id
0              Varele       Varese   Italy  3164699

   incorrect_city_name         correct_city country       id
0  Ovro Pseto do leste  Ouro Preto do Oeste  Brazil  3924948

  incorrect_city_name correct_city       country      id
0          Kfzrksdorp   Klerksdorp  South Africa  989921

  incorrect_city_name correct_city country      id
0             Rybinse      Rybinsk  Russia  500004

  incorrect_city_name correct_city         country       id
0          Mokhejwell   Motherwell  United Kingdom  2642135

  incorrect_city_name correct_city country      id
0               Yulbe        Yumbe  Uganda  225835

  incorrect_city_name correct_city  country       id
0           Hettstgdt    Hettstedt  Germany  2905206

  incorrect_city_name    correct_city country       id
0      Belo Horwzvnte  Belo Horizonte  Brazil  3470127

  incorrect_city_name correct_city country       id
0         Erqttgpetta  Erāttupetta   India  1272022

  incorrect_city_name correct_city country       id
0             Halxuin      Halluin  France  3014034

  incorrect_city_name correct_city country       id
0             Liauran      Lianran   China  1803886

  incorrect_city_name correct_city country       id
0          iitekyushu   Kitakyushu   Japan  1859307

  incorrect_city_name correct_city     country       id
0            Duszanbe     Dushanbe  Tajikistan  1221874

  incorrect_city_name correct_city country       id
0                 Aso          Aso   Japan  6324583

  incorrect_city_name correct_city  country       id
0         La oouvière  La Louvière  Belgium  2793508

  incorrect_city_name correct_city        country       id
0              Leuoir       Lenoir  United States  4475640

  incorrect_city_name correct_city country       id
0           Sikgrauli    Singrauli   India  7279754

  incorrect_city_name correct_city      country       id
0               Nangm        Nanam  North Korea  2042498

  incorrect_city_name correct_city  country       id
0             Rehhaïa      Reghaïa  Algeria  2483757

  incorrect_city_name correct_city country       id
0              Amreha       Amroha   India  1278708

  incorrect_city_name correct_city   country       id
0          da eebaida   La Tebaida  Colombia  3677010

  incorrect_city_name correct_city     country       id
0             jhhātak      Chhātak  Bangladesh  1185254

  incorrect_city_name correct_city country       id
0              Bādāmk       Bādāmi   India  1278017

  incorrect_city_name      correct_city country       id
0    Corbeil-xssonles  Corbeil-Essonnes  France  3023763

  incorrect_city_name correct_city country       id
0                Bāli         Bāli   India  1277539
1                Bāli         Bāli   India  1277590

  incorrect_city_name correct_city  country       id
0            Zqnhoven     Zonhoven  Belgium  2783188

  incorrect_city_name correct_city country       id
0                Bagé         Bagé  Brazil  3471196

  incorrect_city_name  correct_city    country       id
0        Lubuhan meli  Labuhan Deli  Indonesia  1214800

  incorrect_city_name correct_city        country       id
0          Clecrwater   Clearwater  United States  4151316

  incorrect_city_name correct_city           country       id
0              Gorvka       Goroka  Papua New Guinea  2096742

  incorrect_city_name correct_city  country       id
0         Nekstrilitz  Neustrelitz  Germany  2864005

  incorrect_city_name correct_city   country       id
0         DolnýqKubxn  Dolný Kubín  Slovakia  3060405

  incorrect_city_name   correct_city        country       id
0       Ndrth Bef Air  North Bel Air  United States  4363836

  incorrect_city_name correct_city     country       id
0            Sātkhita     Sātkhira  Bangladesh  1185111

  incorrect_city_name correct_city    country       id
0              Florgs       Flores  Guatemala  3595725

  incorrect_city_name correct_city    country       id
0           Sunchajes    Sunchales  Argentina  3834971

  incorrect_city_name correct_city country       id
0              Mūkdwa       Mūndwa   India  1262491

  incorrect_city_name correct_city country       id
0            Cowuimbo     Coquimbo   Chile  3893629

  incorrect_city_name correct_city country       id
0             Fyzilka      Fāzilka   India  1271891

  incorrect_city_name correct_city  country       id
0              Camiry       Camiri  Bolivia  3922414

  incorrect_city_name correct_city    country       id
0              Cibupa       Cikupa  Indonesia  1985663

  incorrect_city_name correct_city  country       id
0           Papenburj    Papenburg  Germany  2855525

  incorrect_city_name correct_city country       id
0            rūnāhāna     Pūnāhāna   India  1259244

  incorrect_city_name correct_city    country       id
0               Aybon        Ambon  Indonesia  1651531

  incorrect_city_name correct_city      country       id
0                Puan         Puan  South Korea  1838722

  incorrect_city_name   correct_city country       id
0       Venarij Rjale  Venaria Reale   Italy  3164617

  incorrect_city_name correct_city country      id
0             Hokkari      Hakkari  Turkey  318137

  incorrect_city_name correct_city country       id
0              Tezsur       Tezpur   India  1254710

  incorrect_city_name       correct_city country       id
0   Kennabaciō-yahiro  Kannabechō-yahiro   Japan  1860176

  incorrect_city_name correct_city    country       id
0                 Moe          Moe  Australia  2157343

  incorrect_city_name correct_city        country       id
0              Carmer       Carmel  United States  4255466

  incorrect_city_name correct_city country       id
0            Qingquwn     Qingquan   China  1797793

  incorrect_city_name correct_city country       id
0           Malīhāgād    Malīhābād   India  1264085

  incorrect_city_name correct_city                           country      id
0               Ilebm        Ilebo  Democratic Republic of the Congo  215976

  incorrect_city_name correct_city        country       id
0           Elk Groue    Elk Grove  United States  5346111

  incorrect_city_name correct_city  country      id
0             Abovyai      Abovyan  Armenia  617026

  incorrect_city_name correct_city     country       id
0         Cyw’s Bāzār  Cox’s Bāzār  Bangladesh  1336134

  incorrect_city_name correct_city        country       id
0           Riverviep    Riverview  United States  4170156

  incorrect_city_name correct_city country       id
0            Coruripe     Coruripe  Brazil  3465329

  incorrect_city_name correct_city country       id
0            dst’-Kut     Ust’-Kut  Russia  2013923

  incorrect_city_name correct_city  country       id
0              lyaydo       Myaydo  Myanmar  1329239

  incorrect_city_name correct_city        country       id
0            Ashejoro     Asheboro  United States  4453035

  incorrect_city_name correct_city country      id
0              Zacnsk       Zainsk  Russia  465543

  incorrect_city_name    correct_city  country       id
0      Balassagyaxmit  Balassagyarmat  Hungary  3055601

  incorrect_city_name correct_city    country       id
0            Bundoosa     Bundoora  Australia  8349381

           incorrect_city_name                 correct_city country       id
0  Sosedad debGgaciano Sáncher  Soledad de Graciano Sánchez  Mexico  8858078

  incorrect_city_name correct_city country       id
0               Dhrod        Dhrol   India  1272699

  incorrect_city_name correct_city country       id
0               Sphio        Schio   Italy  3166917

  incorrect_city_name correct_city  country       id
0                Kiel         Kiel  Germany  2891122

  incorrect_city_name      correct_city        country       id
0    fvarborn Heighth  Dearborn Heights  United States  4990512

  incorrect_city_name correct_city        country       id
0         Wrlsonvillo  Wilsonville  United States  5761287

  incorrect_city_name       correct_city                      country       id
0   bort-aux-Fraotais  Port-aux-Français  French Southern Territories  1546102

  incorrect_city_name correct_city country       id
0             Miszikh      Misrikh   India  1262988

  incorrect_city_name correct_city        country       id
0          Pzainfiela   Pittsfield  United States  4947459

  incorrect_city_name   correct_city        country       id
0       FuquayqVarija  Fuquay-Varina  United States  4467485

  incorrect_city_name correct_city    country       id
0              napala       Zapala  Argentina  3832132

  incorrect_city_name correct_city country        id
0         Kalamasyeby  Kalamassery   India  10630431

  incorrect_city_name    correct_city        country       id
0      Cawhedmal City  Cathedral City  United States  5335006

  incorrect_city_name correct_city        country       id
0               Fzint        Flint  United States  4992982

  incorrect_city_name correct_city country       id
0            Khaiaria     Khamaria   India  1267097

  incorrect_city_name  correct_city country       id
0        Pattukkottaw  Pattukkottai   India  1260040

  incorrect_city_name correct_city     country       id
0             Liquicw      Liquica  East Timor  1637730

  incorrect_city_name correct_city country       id
0           wuarapari    Guarapari  Brazil  3461888

  incorrect_city_name    correct_city     country       id
0      Pointeqà-Pitze  Pointe-à-Pitre  Guadeloupe  3578599

  incorrect_city_name correct_city         country       id
0          rithwrland   Litherland  United Kingdom  2644386

  incorrect_city_name correct_city country       id
0              Nisoio       Nishio   Japan  1855189

  incorrect_city_name correct_city country       id
0         Zaculltppán  Zacualtipán  Mexico  3514134

  incorrect_city_name correct_city country      id
0              Kfngur       Kungur  Russia  539147

  incorrect_city_name correct_city country       id
0         Laf Chowpas  Las Choapas  Mexico  3524903

  incorrect_city_name correct_city        country       id
0              Odemsa       Odessa  United States  5527554

  incorrect_city_name correct_city   country       id
0             Flandjs      Flandes  Colombia  3682458

  incorrect_city_name correct_city   country       id
0               masni        Pasni  Pakistan  1168312

  incorrect_city_name correct_city        country       id
0          Biwmiogham   Birmingham  United States  4049979
1          Biwmiogham   Birmingham  United States  4986172

  incorrect_city_name correct_city country       id
0            Konyagar     Konnagar   India  1266179

  incorrect_city_name correct_city  country       id
0                Asse         Asse  Belgium  2803033

  incorrect_city_name correct_city country       id
0             Nāgnaul      Nārnaul   India  1261772

  incorrect_city_name correct_city      country       id
0                Bato         Bato  Philippines  1726156

  incorrect_city_name correct_city country       id
0          Guyanhourq   Guyancourt  France  3014143

  incorrect_city_name correct_city  country      id
0         Pervomues’k  Pervomays’k  Ukraine  697592
1         Pervomues’k  Pervomays’k  Ukraine  697593

  incorrect_city_name correct_city country      id
0           Yüksekovc    Yüksekova  Turkey  296173

  incorrect_city_name correct_city country       id
0          Cxâkeaudun   Châteaudun  France  3026285

  incorrect_city_name correct_city        country       id
0         sesv Carson  West Carson  United States  5407908

  incorrect_city_name correct_city country      id
0            Kineshmb     Kineshma  Russia  548605

  incorrect_city_name correct_city country       id
0              Nāgrur       Nāgaur   India  1262216

  incorrect_city_name correct_city        country       id
0               Cabft        Cabot  United States  4103957

  incorrect_city_name correct_city country       id
0          Nsugachhia   Naugachhia   India  1261696

  incorrect_city_name correct_city        country       id
0           Hermilage    Hermitage  United States  5193309

  incorrect_city_name correct_city country       id
0               Dijpn        Dijon  France  3021372

    incorrect_city_name          correct_city country      id
0  Kamnnsk-Shakftixfkiy  Kamensk-Shakhtinskiy  Russia  553399

  incorrect_city_name correct_city country       id
0                Meda         Meda   Italy  3173671

  incorrect_city_name correct_city country       id
0           Himimamhi    Himimachi   Japan  1862612

  incorrect_city_name correct_city  country       id
0         Bad Nauhhiw  Bad Nauheim  Germany  2953395

  incorrect_city_name correct_city        country       id
0             Colgnia      Colonia  United States  5096798

  incorrect_city_name       correct_city country       id
0   Casimiroide Arreh  Casimiro de Abreu  Brazil  3466763

  incorrect_city_name correct_city country       id
0            Nasahoyo     Natahoyo   Spain  8629192

  incorrect_city_name correct_city country       id
0              Gasplr       Gaspar  Brazil  3462535

  incorrect_city_name correct_city country       id
0             Xanxerm      Xanxerê  Brazil  3444848

  incorrect_city_name  correct_city        country       id
0        Myrtoe Beacr  Myrtle Beach  United States  4588718

  incorrect_city_name        correct_city country       id
0  CzxoniauLindavista  Colonia Lindavista  Mexico  7280711

  incorrect_city_name correct_city country       id
0              tizuka       Iizuka   Japan  1861835

  incorrect_city_name correct_city  country       id
0                Safi         Safi  Morocco  2537881

  incorrect_city_name correct_city     country      id
0              Şitvan       Şirvan  Azerbaijan  148565

  incorrect_city_name correct_city country       id
0            Jabalpdr     Jabalpur   India  1269633

  incorrect_city_name   correct_city country       id
0       Biegsko-Biapa  Bielsko-Biala  Poland  3103402

  incorrect_city_name correct_city  country      id
0             Triroli      Tripoli  Lebanon  266826

  incorrect_city_name correct_city country      id
0               Bāboc        Bābol    Iran  142363

  incorrect_city_name correct_city  country       id
0              Yangoi       Yangon  Myanmar  1298824

  incorrect_city_name correct_city country       id
0             Bhavsni      Bhavāni   India  1276037

  incorrect_city_name correct_city    country       id
0           Conctrdia    Concordia  Argentina  3435261

  incorrect_city_name correct_city country       id
0            Ecanepec     Ecatepec  Mexico  3529612

  incorrect_city_name correct_city country       id
0              Gohsdi       Gohadi   India  1271083

  incorrect_city_name correct_city  country       id
0           Djidiouaa    Djidiouia  Algeria  2492920

  incorrect_city_name correct_city  country      id
0             Căuşegi      Căuşeni  Moldova  618120

  incorrect_city_name correct_city   country       id
0          Fuqagasugs   Fusagasuga  Colombia  3682274

  incorrect_city_name     correct_city country      id
0     Sarjol-eqv̄ahāb  Sarpol-e Z̄ahāb    Iran  120931

  incorrect_city_name correct_city  country       id
0           Waldkircb    Waldkirch  Germany  2814883

  incorrect_city_name   correct_city        country       id
0       CentrbleIslip  Central Islip  United States  5112078

  incorrect_city_name correct_city country      id
0            Irákleiw     Irákleio  Greece  261743

  incorrect_city_name correct_city        country       id
0               Donnc        Donna  United States  4686593

  incorrect_city_name correct_city        country       id
0            Kingstot     Kingston  United States  5123477

  incorrect_city_name correct_city country       id
0               Dhonf        Dhone   India  1272722

  incorrect_city_name       correct_city country       id
0   Kallidkimurikhchi  Kallidaikurichchi   India  1268360

  incorrect_city_name correct_city  country       id
0         Leichlangmn  Leichlingen  Germany  2879315

  incorrect_city_name  correct_city              country       id
0        SbnyFernando  San Fernando  Trinidad and Tobago  3573738

  incorrect_city_name   correct_city country       id
0       Chbrkhi Dādru  Charkhi Dādri   India  1274571

  incorrect_city_name correct_city country       id
0            ghādāsar     Bhādāsar   India  1276355

  incorrect_city_name correct_city country      id
0           Peqistéri    Peristéri  Greece  255524

  incorrect_city_name correct_city  country       id
0             satekau      Ratekau  Germany  2850235

  incorrect_city_name correct_city country       id
0             Logrofo      Logroño   Spain  3118150

         incorrect_city_name               correct_city country       id
0  Saint-Quenahnspn-Yvilines  Saint-Quentin-en-Yvelines  France  8533870

  incorrect_city_name        correct_city country       id
0  Tremblyy-cz-France  Tremblay-en-France  France  2971874

  incorrect_city_name correct_city country       id
0               Fxnyi        Fenyi   China  1811114

  incorrect_city_name correct_city  country       id
0             Herbwrn      Herborn  Germany  2906199

  incorrect_city_name correct_city country       id
0              Mklina       Molina   Chile  3879627

  incorrect_city_name correct_city country      id
0               wilat        Eilat  Israel  295277

  incorrect_city_name correct_city        country       id
0               Diyon        Dixon  United States  4889959
1               Diyon        Dixon  United States  5343303

  incorrect_city_name correct_city     country       id
0             Libpria      Liberia  Costa Rica  3623076

  incorrect_city_name correct_city country       id
0               Asaky        Asaka   Japan  1907299

  incorrect_city_name     correct_city        country       id
0     Rkmixe-nontjoly  Rémire-Montjoly  French Guiana  3380892

  incorrect_city_name correct_city country      id
0              Çermjk       Çermik  Turkey  318766

  incorrect_city_name  correct_city     country       id
0        Kharrachhati  Khagrachhari  Bangladesh  1185252

  incorrect_city_name     correct_city        country       id
0     SpmmerlinaSauth  Summerlin South  United States  7262622

  incorrect_city_name correct_city  country      id
0                 Dej          Dej  Romania  679550

  incorrect_city_name correct_city        country       id
0          Portsmoudj   Portsmouth  United States  4521816
1          Portsmoudj   Portsmouth  United States  5091383
2          Portsmoudj   Portsmouth  United States  5224082

  incorrect_city_name correct_city country       id
0            Itiigawa     Itoigawa   Japan  1861285

  incorrect_city_name correct_city        country       id
0              lrvada       Arvada  United States  5412199

  incorrect_city_name correct_city        country       id
0          Cloierleak   Cloverleaf  United States  4682127

  incorrect_city_name correct_city country       id
0              Horteh       Horten  Norway  3151770

  incorrect_city_name correct_city country       id
0          Shawinmgar   Shawinigan  Canada  6145489

  incorrect_city_name   correct_city country       id
0       Coktzacoalcws  Coatzacoalcos  Mexico  3530517

  incorrect_city_name correct_city        country       id
0          Pbrrysburv   Perrysburg  United States  5166516

  incorrect_city_name  correct_city country      id
0        Kawm Ḩamldvh  Kawm Ḩamādah   Egypt  353828

  incorrect_city_name correct_city  country       id
0          Steinhpgzn   Steinhagen  Germany  2828050

  incorrect_city_name correct_city country       id
0             Xinzhoi      Xinzhou   China  1788450
1             Xinzhoi      Xinzhou   China  1788452

  incorrect_city_name correct_city    country       id
0              Valbra       Valera  Venezuela  3625542

  incorrect_city_name correct_city     country       id
0          Shxhrisubz   Shahrisabz  Uzbekistan  1216187

  incorrect_city_name correct_city         country       id
0              Malfon       Maldon  United Kingdom  2643160

  incorrect_city_name correct_city         country       id
0          Accrmngtbn   Accrington  United Kingdom  2657770

  incorrect_city_name correct_city country       id
0             Alcsñiz      Alcañiz   Spain  3130606

  incorrect_city_name correct_city country       id
0           Osmvnabad    Osmanabad   India  1261012

  incorrect_city_name correct_city country      id
0                Iţsā         Iţsā   Egypt  355420

  incorrect_city_name correct_city       country       id
0               Seydl        Seydi  Turkmenistan  1218420

  incorrect_city_name correct_city  country      id
0           aovaniemi    Rovaniemi  Finland  638936

  incorrect_city_name    correct_city country      id
0      Katav-pvtnovsk  Katav-Ivanovsk  Russia  551794

  incorrect_city_name correct_city  country       id
0                Dara         Dara  Senegal  2253277

       incorrect_city_name             correct_city country       id
0  metuoq de lax Victorias  Tetuán de las Victorias   Spain  3108118

  incorrect_city_name correct_city country       id
0             Toczigi      Tochigi   Japan  1850311

  incorrect_city_name correct_city country       id
0             Fomentl      Fomento    Cuba  3558744

  incorrect_city_name        correct_city        country       id
0  Butnaveitura bakes  Buenaventura Lakes  United States  4149269

  incorrect_city_name  correct_city        country       id
0        ElmwoobzPark  Elmwood Park  United States  4891051
1        ElmwoobzPark  Elmwood Park  United States  5097627

  incorrect_city_name correct_city  country       id
0         Bfrrourghia  Berrouaghia  Algeria  2504099

  incorrect_city_name correct_city      country       id
0               Laocg        Laoag  Philippines  1707404

  incorrect_city_name   correct_city  country       id
0       urjnsteinfurt  Drensteinfurt  Germany  2935042

  incorrect_city_name correct_city     country       id
0            Votdrozo     Vondrozo  Madagascar  1053507

  incorrect_city_name correct_city country      id
0               oiftá        Ziftá   Egypt  346030

  incorrect_city_name correct_city country       id
0             Chełmgo      Chełmno  Poland  3101795

  incorrect_city_name correct_city              country       id
0          Laaentwlle   Laventille  Trinidad and Tobago  3574309

  incorrect_city_name correct_city  country       id
0             Stokene      Stekene  Belgium  2786087

  incorrect_city_name correct_city       country      id
0              ‘Aw‘ar       ‘Ar‘ar  Saudi Arabia  108512

  incorrect_city_name correct_city country       id
0          Taiobnjras   Taiobeiras  Brazil  3447059

       incorrect_city_name             correct_city  country       id
0  Sawla Cruz ds laoSierra  Santa Cruz de la Sierra  Bolivia  3904906

  incorrect_city_name correct_city         country       id
0          Čewká Líja   Česká Lípa  Czech Republic  3077929

  incorrect_city_name correct_city country       id
0             foishco      Coishco    Peru  3697990

  incorrect_city_name correct_city        country       id
0         Izaho Fllls  Idaho Falls  United States  5596475

  incorrect_city_name correct_city country       id
0          Kukhaiburm   Kuchaiburi   India  1265830

  incorrect_city_name correct_city  country       id
0          Frededicid   Fredericia  Denmark  2621951

  incorrect_city_name correct_city                           country      id
0               Dembj        Demba  Democratic Republic of the Congo  217389

  incorrect_city_name correct_city         country       id
0             Ruislig      Ruislip  United Kingdom  2638976

  incorrect_city_name correct_city   country       id
0           Shijārpur    Shikārpur  Pakistan  1165108

  incorrect_city_name   correct_city      country       id
0       Santa larbaja  Santa Barbara  Philippines  1688372

  incorrect_city_name correct_city   country       id
0          Rvn Pmibun   Ron Phibun  Thailand  1150921

  incorrect_city_name correct_city country       id
0             Uwajqma      Uwajima   Japan  1926020

  incorrect_city_name correct_city country       id
0            Sulechww     Sulechów  Poland  3084241

  incorrect_city_name       correct_city country       id
0   vaxnt-jol-sur-Mer  Saint-Pol-sur-Mer  France  2977388

  incorrect_city_name correct_city   country       id
0               qabis        Labis  Malaysia  1732877

    incorrect_city_name          correct_city country       id
0  hudqiu Chenggjanzven  Huoqiu Chengguanzhen   China  1806651

  incorrect_city_name correct_city country       id
0             Cmstelo      Castelo  Brazil  3466723

      incorrect_city_name            correct_city country       id
0  Santo cnoôniomde Pdsse  Santo Antônio de Posse  Brazil  3449518

  incorrect_city_name    correct_city     country       id
0      Novby Turtlul’  Novyy Turtkul’  Uzbekistan  1513092

  incorrect_city_name correct_city  country       id
0          wraucstein   Traunstein  Germany  2821515

  incorrect_city_name  correct_city country       id
0        Zhaygezhuanz  Zhaogezhuang   China  1784929

  incorrect_city_name correct_city country       id
0              Badras       Barras  Brazil  3406263

  incorrect_city_name correct_city         country       id
0           Becontreo    Becontree  United Kingdom  6690870

  incorrect_city_name correct_city country       id
0            Nyköpjng     Nyköping  Sweden  2687700

    incorrect_city_name          correct_city country       id
0  VerrièrcsilenBfisson  Verrières-le-Buisson  France  2969692

  incorrect_city_name correct_city  country       id
0              Fléror       Fléron  Belgium  2798301

  incorrect_city_name correct_city      country       id
0             Abidjao      Abidjan  Ivory Coast  2293538

  incorrect_city_name  correct_city country       id
0        Tamazutchalj  Tamazunchale  Mexico  3516385

  incorrect_city_name correct_city country       id
0          Shfrbrowke   Sherbrooke  Canada  6146143

  incorrect_city_name correct_city country       id
0          Takzatgaph   Takhatgarh   India  1255213

  incorrect_city_name correct_city country       id
0             Chanatu      Changtu   China  2038139

  incorrect_city_name correct_city country       id
0         Yelovwknife  Yellowknife  Canada  6185377

  incorrect_city_name correct_city country       id
0               yjūin        Ijūin   Japan  1861825

  incorrect_city_name correct_city country       id
0           Redoniela    Redondela   Spain  3112154

  incorrect_city_name correct_city country       id
0              Jarucn       Jaruco    Cuba  3556351

  incorrect_city_name correct_city country       id
0                Reus         Reus   Spain  3111933

  incorrect_city_name correct_city country       id
0         Hudjotzipgo  Huejotzingo  Mexico  3526953

  incorrect_city_name correct_city   country       id
0             Floridq      Florida  Colombia  3682393

  incorrect_city_name  correct_city country       id
0        Dhnrān Bezār  Dharān Bāzār   Nepal  1283460

  incorrect_city_name correct_city country      id
0             Tovzhok      Torzhok  Russia  481985

  incorrect_city_name correct_city  country      id
0            Uzhhoaod     Uzhhorod  Ukraine  690548

  incorrect_city_name    correct_city country       id
0      João qoncevade  João Monlevade  Brazil  3459796

  incorrect_city_name correct_city      country       id
0         San Narciam  San Narciso  Philippines  1688912

  incorrect_city_name     correct_city country       id
0     EpilianohZwpata  Villa Nanchital  Mexico  3522845

  incorrect_city_name correct_city country       id
0               Mkoka        Mooka   Japan  2111836

  incorrect_city_name correct_city country       id
0             Pznalūr      Punalūr   India  1259243

  incorrect_city_name correct_city country       id
0              pawāda       Nawāda   India  1261631

  incorrect_city_name correct_city country       id
0              Nakxma       Nakama   Japan  1855907

  incorrect_city_name    correct_city country      id
0      fabāḩ as pālim  Şabāḩ as Sālim  Kuwait  412800

  incorrect_city_name correct_city  country      id
0         Illizhivskk  Illichivs’k  Ukraine  707688

  incorrect_city_name correct_city country       id
0            Isashiki     Inashiki   Japan  6822108

  incorrect_city_name correct_city   country       id
0           Chigkrodó    Chigorodó  Colombia  3686636

  incorrect_city_name correct_city    country       id
0            Paregare     Parepare  Indonesia  1632353

  incorrect_city_name correct_city  country       id
0           Salzwednl    Salzwedel  Germany  2842112

  incorrect_city_name   correct_city country       id
0       Dewljaon Rāja  Deūlgaon Rāja   India  1273136

  incorrect_city_name correct_city country     id
0             Al Jdwf      Al Jawf   Libya  88962

  incorrect_city_name correct_city country       id
0           Tchkourou    Tchaourou   Benin  2391377

  incorrect_city_name correct_city    country       id
0              erespo       Crespo  Argentina  3859904

  incorrect_city_name correct_city country       id
0              bkashi       Akashi   Japan  1847966

  incorrect_city_name correct_city country       id
0               Chjru        Chūru   India  1273892

  incorrect_city_name  correct_city   country       id
0        Qādirpurtwān  Qādirpur Rān  Pakistan  1167648

  incorrect_city_name correct_city      country       id
0            Uithoore     Uithoorn  Netherlands  2745973

  incorrect_city_name correct_city country       id
0           Camajuaní    Camajuaní    Cuba  3566054

  incorrect_city_name correct_city country       id
0             Yurirda      Yuriria  Mexico  3979855

  incorrect_city_name correct_city country       id
0               Trurk        Truro  Canada  6169587

  incorrect_city_name correct_city country     id
0          Imfm Qasic   Imam Qasim    Iraq  99010

  incorrect_city_name correct_city country       id
0          Shiaacjing   Shitanjing   China  1794971

  incorrect_city_name correct_city         country       id
0               jelby        Selby  United Kingdom  2638235

  incorrect_city_name correct_city country       id
0              Boriri       Bariri  Brazil  3470825

  incorrect_city_name correct_city        country       id
0            Muskegoq     Muskegon  United States  5003132

  incorrect_city_name correct_city        country       id
0            fhakopee     Shakopee  United States  5046997

  incorrect_city_name correct_city country       id
0             Scfacca      Sciacca   Italy  2523194

  incorrect_city_name correct_city country       id
0                Gaur         Gaur   Nepal  1283401

  incorrect_city_name correct_city  country       id
0             Staapen      Staaken  Germany  2829962

  incorrect_city_name correct_city        country       id
0             Findvay      Findlay  United States  5153924

  incorrect_city_name correct_city     country      id
0            Lökgatan     Lökbatan  Azerbaijan  585630

  incorrect_city_name correct_city country      id
0          Nesv Zionq   Ness Ziona  Israel  294074

  incorrect_city_name correct_city country       id
0            Shorfpur     Shorāpur   India  1256431

  incorrect_city_name  correct_city         country       id
0        AcocksdGmeen  Acocks Green  United Kingdom  2657703

  incorrect_city_name    correct_city   country       id
0      Si lxtchanalai  Si Satchanalai  Thailand  1150624

  incorrect_city_name correct_city country       id
0             Ladnion      Lannion  France  3007609

  incorrect_city_name correct_city country       id
0                Koga         Koga   Japan  1859093
1                Koga         Koga   Japan  1859094

  incorrect_city_name correct_city country       id
0            Nithinan     Nichinan   Japan  1855476

  incorrect_city_name correct_city country       id
0             Limacha      Limache   Chile  3883214

  incorrect_city_name       correct_city country       id
0   Vitwrule-François  Vitry-le-François  France  2967856

  incorrect_city_name correct_city   country       id
0              nhuket       Phuket  Thailand  1151254

  incorrect_city_name correct_city  country       id
0           Remschwid    Remscheid  Germany  2848273

  incorrect_city_name correct_city         country       id
0             Mqdřany      Modřany  Czech Republic  3070420

  incorrect_city_name correct_city country      id
0              tamość       Zamość  Poland  753866

  incorrect_city_name correct_city country       id
0                Moss         Moss  Norway  3145375

  incorrect_city_name correct_city        country       id
0           Deer eark    Deer Park  United States  4685737
1           Deer eark    Deer Park  United States  5114731

  incorrect_city_name correct_city country       id
0               Auras        Arras  France  3036784

  incorrect_city_name correct_city        country       id
0           Cheveland    Cleveland  United States  4614088
1           Cheveland    Cleveland  United States  5150529

       incorrect_city_name             correct_city country       id
0  Caitellemmafx di Stabia  Castellammare di Stabia   Italy  3179661

  incorrect_city_name  correct_city country       id
0        BerozOriente  Belo Oriente  Brazil  3470117

  incorrect_city_name correct_city country       id
0          EmbuhGuaçu   Embu Guaçu  Brazil  3464304

  incorrect_city_name      correct_city  country       id
0    Mühlheim am natq  Mühlheim am Main  Germany  2867985

  incorrect_city_name correct_city  country       id
0            Qua Nhon     Qui Nhon  Vietnam  1568574

  incorrect_city_name correct_city country       id
0         Mamambqkkam  Madambakkam   India  1465910

  incorrect_city_name correct_city  country       id
0           Boca Sunt    Boca Suno  Ecuador  3660152

  incorrect_city_name correct_city country       id
0                Gero         Gero   Japan  1848055

  incorrect_city_name correct_city       country       id
0          Rsndebfsch   Rondebosch  South Africa  7302802

  incorrect_city_name correct_city country       id
0               Nagtu        Nagqu   China  1280517

  incorrect_city_name correct_city country       id
0             Ajalpvn      Ajalpan  Mexico  3533126

  incorrect_city_name correct_city country      id
0           Millerfvo    Millerovo  Russia  526558

  incorrect_city_name  correct_city    country       id
0        Guazeguayohú  Gualeguaychú  Argentina  3433658

         incorrect_city_name               correct_city country       id
0  Saant-Séyajtirn-sur-Loiee  Saint-Sébastien-sur-Loire  France  2976984

  incorrect_city_name      correct_city  country      id
0    Syevyeyodoneta’k  Syevyerodonets’k  Ukraine  691999

  incorrect_city_name correct_city country       id
0          Valladolzu   Valladolid  Mexico  3514876

  incorrect_city_name correct_city   country      id
0              Mtinga       Mbinga  Tanzania  877998

  incorrect_city_name correct_city country       id
0          Shklohābād   Shikohābād   India  1256529

  incorrect_city_name correct_city    country       id
0               Kroyb        Kroya  Indonesia  1639337

  incorrect_city_name correct_city        country       id
0          Cincxnnyti   Cincinnati  United States  4508722

  incorrect_city_name correct_city country      id
0             Trnbzon      Trabzon  Turkey  738648

  incorrect_city_name correct_city country       id
0               Bāoda        Bānda   India  1277397

  incorrect_city_name correct_city        country       id
0             kayside      Bayside  United States  5559320

  incorrect_city_name correct_city        country       id
0              Kearcy       Kearny  United States  5099967

  incorrect_city_name    correct_city country       id
0      Sawāi Mādhopui  Sawāi Mādhopur   India  1256949

  incorrect_city_name correct_city country      id
0          Qiyyat Yau   Qiryat Yam  Israel  293822

  incorrect_city_name correct_city country       id
0            Tianceng     Tianpeng   China  1792916

  incorrect_city_name correct_city  country       id
0          Bbni uhiar   Beni Khiar  Tunisia  2472722

  incorrect_city_name correct_city      country       id
0              Onsŏyg       Onsŏng  North Korea  2042267

  incorrect_city_name        correct_city country      id
0  nowyye Cheramushki  Novyye Cherëmushki  Russia  517161

  incorrect_city_name  correct_city     country       id
0        Ankazendondy  Ankazondandy  Madagascar  1072711

  incorrect_city_name correct_city  country       id
0              eyborg       Nyborg  Denmark  2616015

  incorrect_city_name correct_city      country       id
0          pzn Martín   San Martín  El Salvador  3583471

  incorrect_city_name   correct_city country       id
0       BrypsurdMarne  Bry-sur-Marne  France  3029706

  incorrect_city_name correct_city    country       id
0             Terbate      Ternate  Indonesia  1624041

  incorrect_city_name correct_city   country       id
0            Mbalmfyo     Mbalmayo  Cameroon  2228079

  incorrect_city_name correct_city  country       id
0              Zagbeb       Zagreb  Croatia  3186886

  incorrect_city_name correct_city   country      id
0               bzega        Nzega  Tanzania  150930

  incorrect_city_name correct_city        country       id
0           Vicksbfrg    Vicksburg  United States  4449620

  incorrect_city_name   correct_city     country       id
0       Yangiqo‘rw‘tn  Yangiqo‘rg‘on  Uzbekistan  1512350

  incorrect_city_name correct_city country       id
0               Vsrār        Virār   India  1253133

  incorrect_city_name correct_city country       id
0            ambituba     Imbituba  Brazil  3461370

  incorrect_city_name correct_city        country       id
0         Nex Milfoyd  New Milford  United States  5101766

  incorrect_city_name correct_city  country       id
0              Béctar       Béchar  Algeria  2505530

  incorrect_city_name correct_city        country       id
0              Harvsy       Harvey  United States  4327047
1              Harvsy       Harvey  United States  4895298

  incorrect_city_name  correct_city country      id
0        llektrogorsy  Elektrogorsk  Russia  563524

  incorrect_city_name correct_city     country       id
0         Tŭrarŭrgson  Tŭragŭrghon  Uzbekistan  1512549

  incorrect_city_name correct_city      country       id
0          hatac gity   Batac City  Philippines  1726339

  incorrect_city_name correct_city  country       id
0            Gharyaïa     Ghardaïa  Algeria  2496049

  incorrect_city_name correct_city     country      id
0          Nakhcaivin   Nakhchivan  Azerbaijan  147429

      incorrect_city_name            correct_city country       id
0  Funbhhkigachi-funehiki  Funehikimachi-funehiki   Japan  2112903

  incorrect_city_name correct_city        country       id
0          yorteSmith   Fort Smith  United States  4111410

  incorrect_city_name correct_city      country       id
0             vundert      Zundert  Netherlands  2743619

  incorrect_city_name correct_city  country       id
0         haunussteir  Taunusstein  Germany  2823799

  incorrect_city_name correct_city   country      id
0          Nverhngere   Ngerengere  Tanzania  151678

  incorrect_city_name correct_city country       id
0                Catu         Catu  Brazil  3466641

  incorrect_city_name correct_city country       id
0               Koiin        Konin  Poland  3095321

  incorrect_city_name correct_city country       id
0            Hāsimcra     Hāsimāra   India  1270245

  incorrect_city_name correct_city country       id
0             Kālāpad      Kālāvad   India  1268450

  incorrect_city_name correct_city   country      id
0              Hedarq       Hedaru  Tanzania  159647

  incorrect_city_name correct_city        country       id
0          Lgugsville   Louisville  United States  4299276
1          Lgugsville   Louisville  United States  5429522

  incorrect_city_name correct_city    country       id
0           Pbgeralam    Pageralam  Indonesia  1633308

  incorrect_city_name      correct_city        country       id
0    Verx Becch Svuth  Vero Beach South  United States  7260233

  incorrect_city_name correct_city country       id
0              Sarwāy       Sarwār   India  1257093

  incorrect_city_name     correct_city        country       id
0     AkericanvCanyqn  American Canyon  United States  5323694

  incorrect_city_name correct_city country       id
0          Benqcàsmim   Benicàssim   Spain  3128272

  incorrect_city_name correct_city        country       id
0         Mwrgan Hils  Morgan Hill  United States  5374764

  incorrect_city_name     correct_city country      id
0     qirovo-xhepelsk  Kirovo-Chepetsk  Russia  548395

  incorrect_city_name correct_city country       id
0             Bobbpli      Bobbili   India  1275406

  incorrect_city_name correct_city country      id
0                Biga         Biga  Turkey  750605

  incorrect_city_name correct_city  country       id
0           El Khrour    El Khroub  Algeria  2497849

  incorrect_city_name correct_city country       id
0            Islābpur     Islāmpur   India  1269665
1            Islābpur     Islāmpur   India  1269666

  incorrect_city_name correct_city     country       id
0              Tekjāf       Teknāf  Bangladesh  1185095

  incorrect_city_name correct_city    country       id
0          Bytpicaloa   Batticaloa  Sri Lanka  1250161

  incorrect_city_name correct_city     country       id
0          Pjnchagarf   Panchagarh  Bangladesh  1185141

  incorrect_city_name correct_city country       id
0            hhandela     Khandela   India  1267044

  incorrect_city_name correct_city      country       id
0             Calanba      Calamba  Philippines  1720681

  incorrect_city_name correct_city country       id
0             Huyzhou      Huazhou   China  1806960
1             Huyzhou      Huazhou   China  1812990

  incorrect_city_name correct_city country       id
0              Kzunti       Khunti   India  1266622

  incorrect_city_name correct_city country       id
0             Berekrm      Berekum   Ghana  2303125

   incorrect_city_name         correct_city      country       id
0  alphen aan denfRtjn  Alphen aan den Rijn  Netherlands  2759875

  incorrect_city_name correct_city country      id
0              titina       Vitina  Kosovo  784372

    incorrect_city_name          correct_city    country       id
0  Atistfbueo del Vglle  Aristóbulo del Valle  Argentina  3436287

  incorrect_city_name correct_city country       id
0         Montichgapi  Montichiari   Italy  3172681

  incorrect_city_name correct_city country       id
0               Rumoi        Rumoi   Japan  2128382

  incorrect_city_name correct_city country       id
0                Loos         Loos  France  2997620

  incorrect_city_name correct_city  country       id
0           zochristi    Lochristi  Belgium  2792235

  incorrect_city_name  correct_city country       id
0        Ingrāj qāzāq  Ingrāj Bāzār   India  1269723

  incorrect_city_name   correct_city   country       id
0       canta Bárbarf  Santa Bárbara  Honduras  3601691

  incorrect_city_name    correct_city country      id
0      ‘Iobatdal Burj  ‘Izbat al Burj   Egypt  355392

  incorrect_city_name correct_city country       id
0         Lesozavodwk  Lesozavodsk  Russia  2020812

  incorrect_city_name correct_city country       id
0            dalatina     Galatina   Italy  3176407

  incorrect_city_name correct_city country       id
0             Pynākha      Punākha  Bhutan  1252479

  incorrect_city_name correct_city country       id
0             Étampqs      Étampes  France  3019459

  incorrect_city_name correct_city country      id
0              Kiskís       Kilkís  Greece  735736

  incorrect_city_name correct_city        country       id
0                Lutz         Lutz  United States  4163033

  incorrect_city_name correct_city country       id
0          Pjavaltina   Planaltina  Brazil  3453420

  incorrect_city_name correct_city country       id
0            Jaboatãa     Jaboatão  Brazil  3397838

  incorrect_city_name correct_city  country       id
0               Gxbès        Gabès  Tunisia  2468369

  incorrect_city_name correct_city     country       id
0           Antsivabe    Antsirabe  Madagascar  1069166

  incorrect_city_name correct_city country       id
0               Sāqūr        Sāgar   India  1257851

  incorrect_city_name correct_city country       id
0               Anjnr        Anjār   India  1278573

  incorrect_city_name correct_city country       id
0            Ttrancón     Tarancón   Spain  3108317

  incorrect_city_name correct_city         country       id
0             Brivham      Brixham  United Kingdom  2654663

  incorrect_city_name correct_city         country       id
0              Pragud       Prague  Czech Republic  3067696

  incorrect_city_name    correct_city country       id
0      Kehhorai Pātaw  Keshorai Pātan   India  1267226

        incorrect_city_name              correct_city  country       id
0  Eggonstpin-Leoxoldshaftn  Eggenstein-Leopoldshafen  Germany  2933101

   incorrect_city_name         correct_city   country       id
0  Santa Rosa oq Caval  Santa Rosa de Cabal  Colombia  3668454

  incorrect_city_name correct_city country       id
0            Douvbali     Dourbali    Chad  2433055

  incorrect_city_name correct_city country      id
0             Kuvkovo      Kuskovo  Russia  538321

  incorrect_city_name correct_city country       id
0              Rganne       Roanne  France  2983362

  incorrect_city_name correct_city country       id
0             Pānīpvt      Pānīpat   India  1260476

  incorrect_city_name correct_city country       id
0              Cervua       Cervia   Italy  3178998

  incorrect_city_name correct_city country       id
0             Sadahgi      Sadalgi   India  1257895

  incorrect_city_name  correct_city country       id
0        Chikna Salem  Chinna Salem   India  1274146

  incorrect_city_name correct_city      country       id
0           Houng-hai    Heung-hai  South Korea  1832015

  incorrect_city_name correct_city         country       id
0            whoreham     Shoreham  United Kingdom  2637917

  incorrect_city_name correct_city      country       id
0                Divo         Divo  Ivory Coast  2289887

  incorrect_city_name correct_city country      id
0             Genesna      Geneina   Sudan  379303

  incorrect_city_name correct_city country      id
0             Rzeszóq      Rzeszów  Poland  759734

  incorrect_city_name correct_city  country       id
0          Ttttlinven   Tuttlingen  Germany  2820693

  incorrect_city_name correct_city country       id
0               Maksz        Maksi   India  1264198

  incorrect_city_name correct_city     country      id
0            Xankands     Xankandi  Azerbaijan  146970

  incorrect_city_name correct_city country      id
0           Irákleiun    Irákleion  Greece  261745

  incorrect_city_name correct_city country      id
0               Minūl        Minūf   Egypt  352354

  incorrect_city_name correct_city     country       id
0           Morondava    Morondava  Madagascar  1058381

  incorrect_city_name correct_city country       id
0              Rawioz       Rawicz  Poland  3087307

  incorrect_city_name    correct_city        country       id
0      eouth Pasfdena  South Pasadena  United States  5397717

  incorrect_city_name correct_city country       id
0              Méridd       Mérida   Spain  2513917

  incorrect_city_name correct_city  country       id
0             Doljres      Dolores  Uruguay  3442750

  incorrect_city_name correct_city  country       id
0         Ridgelsbehg  Riegelsberg  Germany  2847033

  incorrect_city_name    correct_city  country       id
0      Neubrkndendurg  Neubrandenburg  Germany  2866135

  incorrect_city_name correct_city        country       id
0         giao Rivera  Pico Rivera  United States  5382496

  incorrect_city_name correct_city country       id
0           SãojBento    São Bento  Brazil  3388991
1           SãojBento    São Bento  Brazil  3389006

  incorrect_city_name correct_city        country       id
0          Stilljaker   Stillwater  United States  4552215
1          Stilljaker   Stillwater  United States  5048814

  incorrect_city_name correct_city country       id
0            Yangchuy     Yangchun   China  1814786

  incorrect_city_name correct_city        country       id
0               Ecsex        Essex  United States  4354428

  incorrect_city_name correct_city country       id
0            Kerlstad     Karlstad  Sweden  2701680

  incorrect_city_name correct_city        country       id
0         McMinnveule  McMinnville  United States  5739936

  incorrect_city_name correct_city country       id
0               Skign        Skien  Norway  3139075

  incorrect_city_name correct_city    country       id
0          Slyta Rosa   Santa Rosa  Argentina  3835994

  incorrect_city_name correct_city        country       id
0           tennewick    Kennewick  United States  5799610

  incorrect_city_name correct_city  country       id
0            Eltviile     Eltville  Germany  2930646

  incorrect_city_name correct_city  country      id
0             Doyetsk      Donetsk  Ukraine  709717

  incorrect_city_name correct_city country       id
0          Gruglyapco   Grugliasco   Italy  3175755

  incorrect_city_name correct_city country       id
0          Bfscorezle   Boscoreale   Italy  3181683

  incorrect_city_name correct_city country       id
0            Yugawora     Yugawara   Japan  1848113

  incorrect_city_name correct_city        country       id
0              facine       Racine  United States  5268249

  incorrect_city_name correct_city        country       id
0             iakdale      Oakdale  United States  5039978
1             iakdale      Oakdale  United States  5378500

  incorrect_city_name correct_city       country      id
0            mazanjyk     Gazanjyk  Turkmenistan  161974

,incorrect_city_name,correct_city,country,id
0,Socyrro Mission Numberb1 bolxfia,Socorro Mission Number 1 Colonia,United States,5530937

  incorrect_city_name      correct_city country      id
0    btaraya Derhvnyh  Staraya Derevnya  Russia  489226

          incorrect_city_name                correct_city country       id
0  Iguala de le Ikhvpendencba  Iguala de la Independencia  Mexico  3526798

  incorrect_city_name correct_city country      id
0               Fāqgs        Fāqūs   Egypt  356989

  incorrect_city_name correct_city      country       id
0               panay        Tanay  Philippines  1683319

  incorrect_city_name correct_city        country       id
0          nrangevale   Orangevale  United States  5379566

  incorrect_city_name     correct_city       country      id
0     Louis Trtcjvrdt  Louis Trichardt  South Africa  981827

       incorrect_city_name             correct_city    country       id
0  Grneral Ensique boscvni  General Enrique Mosconi  Argentina  3855116

  incorrect_city_name  correct_city country       id
0        Osveldo lruz  Osvaldo Cruz  Brazil  3455756

  incorrect_city_name correct_city country       id
0              Ptsaia       Pasaia   Spain  6693088

  incorrect_city_name  correct_city  country       id
0        Krrchlenglrn  Kirchlengern  Germany  2890425

  incorrect_city_name correct_city country       id
0               Lxasa        Lhasa   China  1280737

  incorrect_city_name correct_city country       id
0           Anastáhio    Anastácio  Brazil  3472284

  incorrect_city_name   correct_city country       id
0       Novyy Uredgoq  Novyy Urengoy  Russia  1496511

  incorrect_city_name correct_city    country       id
0           ieluknaga    Teluknaga  Indonesia  1990589

  incorrect_city_name correct_city country       id
0             Ogonnax      Oyonnax  France  2988888

  incorrect_city_name correct_city  country       id
0                Hamm         Hamm  Germany  2911240

  incorrect_city_name correct_city  country       id
0             Makolda      Makouda  Algeria  2490297

  incorrect_city_name correct_city country       id
0              Ohtawa       Ottawa  Canada  6094817

  incorrect_city_name correct_city country       id
0               Hakhi        Hakui   Japan  1863341

  incorrect_city_name   correct_city   country        id
0       Putra xeighvs  Putra Heights  Malaysia  10792382

  incorrect_city_name correct_city       country      id
0           Newcasnle    Newcastle  South Africa  971421

  incorrect_city_name correct_city        country       id
0            Torrancb     Torrance  United States  5403022

  incorrect_city_name correct_city country      id
0              Igpnga       Iganga  Uganda  233275

  incorrect_city_name correct_city country       id
0            Partille     Partille  Sweden  2684395

  incorrect_city_name correct_city  country       id
0            Jendouda     Jendouba  Tunisia  2470088

  incorrect_city_name correct_city     country       id
0              Zcysan       Zaysan  Kazakhstan  1517060

  incorrect_city_name correct_city country       id
0               Torqń        Toruń  Poland  3083271

  incorrect_city_name correct_city country       id
0            Vittkria     Vittoria   Italy  2522713

  incorrect_city_name     correct_city        country       id
0     Scuth Brajenxon  South Bradenton  United States  4173392

  incorrect_city_name correct_city  country       id
0                 Jos          Jos  Nigeria  2335953

  incorrect_city_name correct_city country       id
0             Tomarej      Tomares   Spain  2510394

  incorrect_city_name correct_city  country       id
0                Béja         Béja  Tunisia  2472774

  incorrect_city_name correct_city country       id
0            Rolândig     Rolândia  Brazil  3450964

  incorrect_city_name correct_city       country      id
0             Vryherd      Vryheid  South Africa  942470

  incorrect_city_name correct_city country      id
0                Ādam         Ādam    Oman  289433

  incorrect_city_name correct_city    country      id
0              Svopje       Skopje  Macedonia  785842

  incorrect_city_name correct_city         country       id
0             Walkdes      Walkden  United Kingdom  2634887

  incorrect_city_name       correct_city country       id
0   Caldis de Monoiui  Caldes de Montbui   Spain  3127035

  incorrect_city_name correct_city country      id
0             Shblovo      Shilovo  Russia  494427

  incorrect_city_name  correct_city        country       id
0        Rohnyrt Pank  Rohnert Park  United States  5388564

  incorrect_city_name  correct_city  country       id
0        Newtxingston  New Kingston  Jamaica  3489297

  incorrect_city_name correct_city country       id
0             Reynoha      Reynosa  Mexico  3520339

  incorrect_city_name correct_city  country       id
0               Guxau        Gusau  Nigeria  2339937

  incorrect_city_name  correct_city  country       id
0        Dan Chabannl  Dar Chabanne  Tunisia  2471637

  incorrect_city_name correct_city        country       id
0              Dedhab       Dedham  United States  4934664

  incorrect_city_name correct_city country       id
0              Cnāmpa       Chāmpa   India  1274837

  incorrect_city_name correct_city  country       id
0           Nagyrőrös    Nagykőrös  Hungary  3047651

  incorrect_city_name      correct_city country       id
0    Playa dig Carmrn  Playa del Carmen  Mexico  3521342

  incorrect_city_name  correct_city country       id
0        Manseilhe 10  Marseille 10  France  7284890

  incorrect_city_name correct_city country       id
0              Rwmini       Rimini   Italy  3169361

  incorrect_city_name correct_city    country       id
0          mlotenangl   Alotenango  Guatemala  3599788

  incorrect_city_name correct_city   country       id
0              iīwani       Jīwani  Pakistan  1175712

  incorrect_city_name correct_city         country       id
0             Trudnov      Trutnov  Czech Republic  3063907

  incorrect_city_name correct_city   country       id
0         Baz natsada  Ban Ratsada  Thailand  7091912

  incorrect_city_name correct_city        country       id
0         Plrnerville  Porterville  United States  5384471

  incorrect_city_name correct_city country       id
0          wanvelária   Candelária  Brazil  3467550

  incorrect_city_name correct_city  country       id
0                 Ifo          Ifo  Nigeria  2338876

  incorrect_city_name correct_city country      id
0            Mujmansk     Murmansk  Russia  524305

  incorrect_city_name correct_city  country      id
0             cerevan      Yerevan  Armenia  616052

  incorrect_city_name correct_city  country       id
0               Danra        Daura  Nigeria  2345094
1               Danra        Daura  Nigeria  2345096

  incorrect_city_name correct_city country     id
0              Ḩajjeh       Ḩajjah   Yemen  75337

  incorrect_city_name correct_city             country       id
0           Jarapacoa    Jarabacoa  Dominican Republic  3504158

  incorrect_city_name correct_city country       id
0           Shelokhov    Shelekhov  Russia  2016764

  incorrect_city_name correct_city country       id
0                Boké         Boké  Guinea  2422924

  incorrect_city_name correct_city        country       id
0             iendall      Kendall  United States  4160711

  incorrect_city_name correct_city country       id
0              Uwarga       Umarga   India  1253870

  incorrect_city_name correct_city   country       id
0               Pekad        Pekan  Malaysia  1734971

  incorrect_city_name correct_city   country       id
0          nvay Rieug   Svay Rieng  Cambodia  1821993

  incorrect_city_name correct_city country       id
0             Serrdna      Serrana  Brazil  3447720

  incorrect_city_name correct_city country      id
0               Młaaa        Mława  Poland  764634

    incorrect_city_name          correct_city country       id
0  vadta uruw del Norte  Santa Cruz del Norte    Cuba  3537845

  incorrect_city_name correct_city country       id
0           Nowa quda    Nowa Ruda  Poland  3090768

  incorrect_city_name correct_city country       id
0               Hāpol        Hālol   India  1270474

  incorrect_city_name correct_city      country       id
0             Basgolo      Bangolo  Ivory Coast  2292179

  incorrect_city_name correct_city   country       id
0                Beja         Beja  Portugal  2270985

   incorrect_city_name         correct_city country       id
0  Gagbaenati Milanese  Garbagnate Milanese   Italy  3176322

  incorrect_city_name correct_city     country       id
0            Lolmohan     Lālmohan  Bangladesh  1185251

  incorrect_city_name correct_city  country       id
0              treetz       Preetz  Germany  2852280

  incorrect_city_name correct_city   country      id
0              Muslma       Musoma  Tanzania  152451

  incorrect_city_name correct_city  country       id
0              Loomel       Lommel  Belgium  2792179

  incorrect_city_name correct_city  country      id
0               Mazyr        Mazyr  Belarus  625324

  incorrect_city_name correct_city        country       id
0           Pendleron    Pendleton  United States  5745380

  incorrect_city_name correct_city      country       id
0            Borungan     Borongan  Philippines  1723893

  incorrect_city_name correct_city country       id
0               Trfni        Trani   Italy  3165322

  incorrect_city_name correct_city country       id
0               Nagdo        Nagda   India  1262209

  incorrect_city_name correct_city        country       id
0           Edgewjter    Edgewater  United States  4154205

  incorrect_city_name correct_city country       id
0              Sukuqa       Sukuta  Gambia  2411880

  incorrect_city_name correct_city country       id
0               Ahica        Arica   Chile  3899361

    incorrect_city_name          correct_city country       id
0  xouloene-Bilyancturt  Boulogne-Billancourt  France  3031137

    incorrect_city_name          correct_city country       id
0  Sagnt-Amand-lem-kaux  Saint-Amand-les-Eaux  France  2981839

  incorrect_city_name correct_city country       id
0               urdos        Ordos   China  8347664

  incorrect_city_name correct_city country       id
0              Niiāni       Nipāni   India  1261309

  incorrect_city_name correct_city  country       id
0            Izbo-Ora     Igbo-Ora  Nigeria  2338669

  incorrect_city_name correct_city country       id
0            Gursaoāi     Gursarāi   India  1270618

  incorrect_city_name correct_city country       id
0         Charquhldas  Charqueadas  Brazil  3466261

  incorrect_city_name   correct_city country       id
0       qonues Claros  Montes Claros  Brazil  3456814

  incorrect_city_name correct_city     country      id
0                Embi         Embi  Kazakhstan  609924

  incorrect_city_name correct_city     country       id
0               Nkryn        Naryn  Kyrgyzstan  1527592

  incorrect_city_name correct_city     country       id
0         Farafangaqs  Farafangana  Madagascar  1065158

           incorrect_city_name                 correct_city country       id
0  gôfto bpsaal Rolim de Moura  Pôsto Fiscal Rolim de Moura  Brazil  3924877

  incorrect_city_name correct_city country       id
0               Lecxo        Lecco   Italy  3174945

  incorrect_city_name correct_city  country       id
0           Heilbrcnn    Heilbronn  Germany  2907669

  incorrect_city_name correct_city        country       id
0              Ljurel       Laurel  United States  4360369
1              Ljurel       Laurel  United States  4433039

  incorrect_city_name correct_city   country       id
0           xarrancas    Barrancas  Colombia  3689162

  incorrect_city_name correct_city country       id
0            Dcupgāri     Dhupgāri   India  1272674

  incorrect_city_name     correct_city        country       id
0     SanzCaflos Pgrk  San Carlos Park  United States  4171782

  incorrect_city_name   correct_city       country      id
0       Al oukayriyah  Al Bukayrīyah  Saudi Arabia  109878

  incorrect_city_name correct_city      country       id
0               Ustfr        Uster  Switzerland  2658216

  incorrect_city_name correct_city country       id
0             Pwnambi      Panambi  Brazil  3455281

  incorrect_city_name correct_city    country       id
0              Buarjn       Buaran  Indonesia  1647991

     incorrect_city_name           correct_city    country       id
0  iandSalvudor dehJujuy  San Salvador de Jujuy  Argentina  3836564

  incorrect_city_name correct_city country      id
0           Al Bawwţī    Al Bawīţī   Egypt  361394

  incorrect_city_name correct_city country      id
0            Kırknğaç     Kırkağaç  Turkey  307623

  incorrect_city_name correct_city country       id
0             Kyakhta      Kyakhta  Russia  2021066

  incorrect_city_name correct_city  country      id
0          Shepptavka   Shepetivka  Ukraine  694216

  incorrect_city_name correct_city country       id
0               Pirla        Parla   Spain  3114256

  incorrect_city_name correct_city country       id
0              Esceio       Esteio  Brazil  3463859

  incorrect_city_name correct_city country      id
0              Yecköy       Yerköy  Turkey  296895

    incorrect_city_name          correct_city country       id
0  Saint-Larrhnt-do-Vab  Saint-Laurent-du-Var  France  2978891

  incorrect_city_name correct_city           country       id
0               Kimbf        Kimbe  Papua New Guinea  2093967

  incorrect_city_name correct_city        country       id
0            Lockpora     Lockport  United States  4900292
1            Lockpora     Lockport  United States  5125011

  incorrect_city_name correct_city country       id
0              Grimar       Güimar   Spain  2516852

  incorrect_city_name  correct_city country       id
0        Mwdicine Hab  Medicine Hat  Canada  6071618

  incorrect_city_name correct_city country       id
0              mshiku       Ushiku   Japan  2110629

  incorrect_city_name      correct_city country       id
0    Auvnby-sousjBois  Aulnay-sous-Bois  France  3036145

  incorrect_city_name correct_city country       id
0            Inaocara     Itaocara  Brazil  3460774

  incorrect_city_name  correct_city country      id
0        Rosh Hc‘Ayit  Rosh Ha‘Ayin  Israel  293690

  incorrect_city_name correct_city      country       id
0              bangil       Pangil  Philippines  1695283

  incorrect_city_name correct_city country       id
0            Omefepec     Ometepec  Mexico  3522343

  incorrect_city_name correct_city   country      id
0           Dongobezh    Dongobesh  Tanzania  160172

  incorrect_city_name correct_city country       id
0             Malnape      Malnate   Italy  3174141

  incorrect_city_name     correct_city    country       id
0     Cañadaedt Gzmez  Cañada de Gómez  Argentina  3862981

  incorrect_city_name correct_city  country       id
0            Berrvane     Berriane  Algeria  2504110

  incorrect_city_name correct_city   country       id
0               Traig        Trang  Thailand  1150007

  incorrect_city_name correct_city    country       id
0         Mount Elwda  Mount Eliza  Australia  2156663

  incorrect_city_name correct_city country       id
0             eudhāna      Budhāna   India  1275152

  incorrect_city_name correct_city country       id
0           Mqnzhouli    Manzhouli   China  2035836

  incorrect_city_name correct_city country      id
0         Ivanteyevlt  Ivanteyevka  Russia  555111

  incorrect_city_name correct_city   country       id
0           Pāro Āqil    Pāno Āqil  Pakistan  1168412

  incorrect_city_name correct_city country       id
0             Timjteo      Timóteo  Brazil  3446445

  incorrect_city_name correct_city country       id
0             Gsozhou      Gaozhou   China  1810295

  incorrect_city_name correct_city    country       id
0            jshfield     Ashfield  Australia  2177565

  incorrect_city_name correct_city  country       id
0              Llhmar       Lohmar  Germany  2876218

  incorrect_city_name correct_city country       id
0         SfouGabriel  São Gabriel  Brazil  3449099

  incorrect_city_name correct_city country       id
0           Arseu’yev    Arsen’yev  Russia  2027468

  incorrect_city_name correct_city country      id
0           Najafābod    Najafābād    Iran  418606

  incorrect_city_name correct_city country       id
0             Wxnxian      Wanxian   China  1791748

  incorrect_city_name correct_city country       id
0              Parnaa       Parnas  Russia  8504950

  incorrect_city_name correct_city country       id
0            Khawauli     Khatauli   India  1266849

  incorrect_city_name correct_city      country       id
0                Chur         Chur  Switzerland  2661169

  incorrect_city_name correct_city country      id
0         Vsstryakowo  Vostryakovo  Russia  471456
1         Vsstryakowo  Vostryakovo  Russia  471457

  incorrect_city_name correct_city        country       id
0           Lexinjton    Lexington  United States  4297983
1           Lexinjton    Lexington  United States  4475773
2           Lexinjton    Lexington  United States  4585000
3           Lexinjton    Lexington  United States  4941935

  incorrect_city_name correct_city country       id
0                Uran         Uran   India  1253702

  incorrect_city_name     correct_city country       id
0     Casttp Maggbore  Castel Maggiore   Italy  3179560

  incorrect_city_name correct_city country       id
0          Nidepavole   Nidadavole   India  1261446

  incorrect_city_name       correct_city country       id
0   Barajav de Mndcid  Barajas de Madrid   Spain  3128832

  incorrect_city_name      correct_city country       id
0    Morpang-swr-yrge  Morsang-sur-Orge  France  2991719

  incorrect_city_name correct_city   country       id
0             qalarcá      Calarcá  Colombia  3687964

  incorrect_city_name correct_city country       id
0            Shaighai     Shanghai   China  1796236

  incorrect_city_name correct_city country       id
0            vibeirão     Ribeirão  Brazil  3390326

  incorrect_city_name correct_city        country       id
0         Wabt Forest  Wake Forest  United States  4497290

  incorrect_city_name correct_city country       id
0             Bauonne      Bayonne  France  3034475

  incorrect_city_name correct_city         country       id
0             cewquay      Newquay  United Kingdom  2641589

  incorrect_city_name correct_city         country       id
0           Lofthouse    Lofthouse  United Kingdom  2643776

  incorrect_city_name  correct_city      country       id
0        Schafbhausln  Schaffhausen  Switzerland  2658761

  incorrect_city_name correct_city        country       id
0              Cksper       Casper  United States  5820705

  incorrect_city_name correct_city country       id
0              eāruni       Bāruni   India  1276829

  incorrect_city_name correct_city country       id
0           Sidthapur    Siddhapur   India  1256382

  incorrect_city_name correct_city country       id
0            Ismikawa     Ishikawa   Japan  1861393
1            Ismikawa     Ishikawa   Japan  2112583

  incorrect_city_name  correct_city        country       id
0        Blooiingdave  Bloomingdale  United States  4148207
1        Blooiingdave  Bloomingdale  United States  4885156

  incorrect_city_name correct_city        country       id
0           OaksRidge    Oak Ridge  United States  4166583
1           OaksRidge    Oak Ridge  United States  4646571

  incorrect_city_name   correct_city country       id
0       Cqik pallāpur  Chik Ballāpur   India  1274243

  incorrect_city_name correct_city country       id
0           Parafiago    Parabiago   Italy  3171484

  incorrect_city_name correct_city country       id
0            Sodāgpur     Sohāgpur   India  1255884

  incorrect_city_name correct_city   country       id
0          Btrg Pa-in   Bang Pa-in  Thailand  1619369

  incorrect_city_name correct_city country       id
0          Penxāgartm   Pennāgaram   India  1259916

  incorrect_city_name correct_city  country       id
0               Tegjl        Tegel  Germany  2823708

  incorrect_city_name correct_city  country      id
0            Vanadkor     Vanadzor  Armenia  616530

  incorrect_city_name correct_city        country       id
0              Marink       Marina  United States  5370493

  incorrect_city_name correct_city country       id
0             Hualmaj      Hualmay    Peru  3939761

  incorrect_city_name correct_city        country       id
0             Bhllwin      Ballwin  United States  4375663

  incorrect_city_name correct_city country       id
0            Saitutxu     Santutxu   Spain  6618856

    incorrect_city_name          correct_city  country       id
0  Budqppsw VI. kevület  Budapest VI. kerület  Hungary  7284828

  incorrect_city_name correct_city  country      id
0               Kqpan        Kapan  Armenia  174875

  incorrect_city_name correct_city      country       id
0            Tauxanga     Tauranga  New Zealand  2208032

  incorrect_city_name correct_city country       id
0             Chennqi      Chennai   India  1264527

  incorrect_city_name correct_city    country       id
0              Panzóv       Panzós  Guatemala  3591676

  incorrect_city_name correct_city        country       id
0         Rzck xsland  Rock Island  United States  4907907

  incorrect_city_name correct_city country       id
0             Orzeszk      Orzesze  Poland  3089965

  incorrect_city_name correct_city        country       id
0              Ouosso       Owosso  United States  5004792

  incorrect_city_name correct_city country       id
0               Siwri        Siuri   India  1255955

       incorrect_city_name             correct_city  country       id
0  Leinfexden-Echtwrdinxev  Leinfelden-Echterdingen  Germany  2879185

  incorrect_city_name correct_city country       id
0              Latisa       Latina   Spain  6544489

  incorrect_city_name correct_city country       id
0              Mkniar       Maniar   India  1263730

  incorrect_city_name correct_city country       id
0               caomi        Gaomi   China  1810458

  incorrect_city_name correct_city country       id
0              Sehone       Sehore   India  1256913

  incorrect_city_name correct_city  country       id
0               Kanbs        Kanbe  Myanmar  1320944

  incorrect_city_name correct_city  country       id
0             Willicp      Willich  Germany  2808559

  incorrect_city_name correct_city   country       id
0               Bhgra        Bhera  Pakistan  1182665

  incorrect_city_name correct_city country       id
0               Lupań        Lubań  Poland  3093040

  incorrect_city_name     correct_city        country       id
0     pvosado Hrights  Avocado Heights  United States  5325372

  incorrect_city_name correct_city   country       id
0               Penra        Penja  Cameroon  2222623

  incorrect_city_name correct_city        country       id
0          Cldar gark   Cedar Park  United States  4679867

#### Another Approach

In [20]:
def get_matches(query, country):
    df_check = df_correct[(df_correct['country']==country) & (df_correct['name'].str.len()==len(query))]
    
    results = process.extract(query, df_check['name'].tolist(), limit=3)
    df_res = pd.DataFrame(results, columns=['name','match'])
    res = df_res[df_res['match']==(df_res['match'].max())]

    res2 = df_check[df_check['name']==res['name'][0]]['id']
    return res2.values[0]

In [21]:
df_test = df_incorrect.copy()
df_test['match'] = df_test.apply(lambda x: get_matches(x['misspelt_name'], x['country']), axis=1)

In [22]:
df_incorrect_city_matches = df_test.merge(df_correct, how='inner', left_on=['country', 'match'], right_on=['country','id'])
df_incorrect_city_matches.head()

    misspelt_name        country    match            name       id
0  Hfjdúszoposzló        Hungary   720276  Hajdúszoboszló   720276
1        Otrajnyy         Russia   513883        Otradnyy   513883
2      ian Isidre           Peru  3929631      San Isidro  3929631
3   Bordj Zemoufa        Algeria  2503620   Bordj Zemoura  2503620
4     ChulamViwta  United States  5336899     Chula Vista  5336899

In [23]:
df_incorrect_city_matches.shape[0], df_test.shape[0], df_incorrect.shape[0]

(23018, 23018, 23018)